[Killed] BlockStatement
src/tokens/defineToken.ts:28:21
   contractAddress?: string;
   standard?: string;
   coingeckoId?: string;
-}): TokenDefinition {
-  if (!definition.code) throw new Error("Token definition requires a code");
-  if (!definition.symbol) throw new Error("Token definition requires a symbol");
-  if (definition.decimals === undefined)
-    throw new Error("Token definition requires decimals");
-
-  const token: TokenDefinition = {
-    code: definition.code.toUpperCase(),
-    symbol: definition.symbol,
-    decimals: definition.decimals,
-    locale: definition.locale,
-    type: definition.type ?? "custom",
-    chainId: definition.chainId,
-    contractAddress: definition.contractAddress,
-    standard: definition.standard,
-    coingeckoId: definition.coingeckoId,
-  };
-
-  // Register so it can be used with currency codes
-  registerCurrency(token);
-
-  return Object.freeze(token);
-}
+}): TokenDefinition {}
 
 // Pre-defined popular crypto tokens
killedBy: Tokens - defineToken should define a custom token
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ConditionalExpression
src/tokens/defineToken.ts:31:7
 }): TokenDefinition {
   if (!definition.code) throw new Error("Token definition requires a code");
   if (!definition.symbol) throw new Error("Token definition requires a symbol");
-  if (definition.decimals === undefined)
+  if (false)
     throw new Error("Token definition requires decimals");
 
killedBy: Tokens - defineToken should throw error for invalid token definition
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/tokens/defineToken.ts:31:7
 }): TokenDefinition {
   if (!definition.code) throw new Error("Token definition requires a code");
   if (!definition.symbol) throw new Error("Token definition requires a symbol");
-  if (definition.decimals === undefined)
+  if (true)
     throw new Error("Token definition requires decimals");
 
killedBy: Tokens - defineToken should define a custom token
statusReason: Token definition requires decimals

[Killed] StringLiteral
src/tokens/defineToken.ts:32:21
   if (!definition.code) throw new Error("Token definition requires a code");
   if (!definition.symbol) throw new Error("Token definition requires a symbol");
   if (definition.decimals === undefined)
-    throw new Error("Token definition requires decimals");
+    throw new Error("");
 
   const token: TokenDefinition = {
killedBy: Tokens - defineToken should throw error for invalid token definition
statusReason: expected [Function] to throw error including 'Token definition requires decimals' but got ''

[Killed] ObjectLiteral
src/tokens/defineToken.ts:34:34
   if (definition.decimals === undefined)
     throw new Error("Token definition requires decimals");
 
-  const token: TokenDefinition = {
-    code: definition.code.toUpperCase(),
-    symbol: definition.symbol,
-    decimals: definition.decimals,
-    locale: definition.locale,
-    type: definition.type ?? "custom",
-    chainId: definition.chainId,
-    contractAddress: definition.contractAddress,
-    standard: definition.standard,
-    coingeckoId: definition.coingeckoId,
-  };
+  const token: TokenDefinition = {};
 
   // Register so it can be used with currency codes
killedBy: Tokens - defineToken should define a custom token
statusReason: expected undefined to be 'MYT' // Object.is equality
