[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:30:46
   readonly credits: Money;
   readonly difference: Money;
 
-  constructor(debits: Money, credits: Money) {
-    const diff = debits.subtract(credits);
-    super(
-      `Journal entry is not balanced. ` +
-        `Debits: ${debits.format()}, Credits: ${credits.format()}, ` +
-        `Difference: ${diff.format()}`,
-    );
-    this.name = "UnbalancedEntryError";
-    this.debits = debits;
-    this.credits = credits;
-    this.difference = diff;
-  }
+  constructor(debits: Money, credits: Money) {}
 }
 
killedBy: DoubleEntryLedger journal entry posting throws for unbalanced entry
statusReason: expected error to be instance of UnbalancedEntryError

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:33:7
   constructor(debits: Money, credits: Money) {
     const diff = debits.subtract(credits);
     super(
-      `Journal entry is not balanced. ` +
+      `` +
         `Debits: ${debits.format()}, Credits: ${credits.format()}, ` +
         `Difference: ${diff.format()}`,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:37:17
         `Debits: ${debits.format()}, Credits: ${credits.format()}, ` +
         `Difference: ${diff.format()}`,
     );
-    this.name = "UnbalancedEntryError";
+    this.name = "";
     this.debits = debits;
     this.credits = credits;

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:50:34
 export class AccountNotFoundError extends Error {
   readonly accountId: string;
 
-  constructor(accountId: string) {
-    super(`Account not found: "${accountId}"`);
-    this.name = "AccountNotFoundError";
-    this.accountId = accountId;
-  }
+  constructor(accountId: string) {}
 }
 
killedBy: DoubleEntryLedger account management getAccountOrThrow throws for missing account
statusReason: expected error to be instance of AccountNotFoundError

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:52:17
 
   constructor(accountId: string) {
     super(`Account not found: "${accountId}"`);
-    this.name = "AccountNotFoundError";
+    this.name = "";
     this.accountId = accountId;
   }

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:63:34
 export class DuplicateAccountError extends Error {
   readonly accountId: string;
 
-  constructor(accountId: string) {
-    super(`Account already exists: "${accountId}"`);
-    this.name = "DuplicateAccountError";
-    this.accountId = accountId;
-  }
+  constructor(accountId: string) {}
 }
 
killedBy: DoubleEntryLedger account management throws on duplicate account ID
statusReason: expected error to be instance of DuplicateAccountError

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:65:17
 
   constructor(accountId: string) {
     super(`Account already exists: "${accountId}"`);
-    this.name = "DuplicateAccountError";
+    this.name = "";
     this.accountId = accountId;
   }

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:118:21
   private currency: string;
 
   constructor(currency: string | Currency) {
-    this.currency = typeof currency === "string" ? currency : currency.code;
+    this.currency = false ? currency : currency.code;
   }
 
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account currency (USD) must match ledger currency (undefined)

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:124:49
   /**
    * Creates a new account in the chart of accounts.
    */
-  createAccount(config: AccountConfig): Account {
-    if (this.accounts.has(config.id)) {
-      throw new DuplicateAccountError(config.id);
-    }
-
-    // Validate currency matches ledger
-    const accountCurrency =
-      typeof config.currency === "string"
-        ? config.currency
-        : config.currency.code;
-
-    if (accountCurrency !== this.currency) {
-      throw new InvalidArgumentError(
-        `Account currency (${accountCurrency}) must match ledger currency (${this.currency})`,
-      );
-    }
-
-    const account = new Account(config);
-    this.accounts.set(config.id, account);
-    return account;
-  }
+  createAccount(config: AccountConfig): Account {}
 
   /**
killedBy: DoubleEntryLedger account management creates an account
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:125:9
    * Creates a new account in the chart of accounts.
    */
   createAccount(config: AccountConfig): Account {
-    if (this.accounts.has(config.id)) {
+    if (true) {
       throw new DuplicateAccountError(config.id);
     }
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account already exists: "cash"

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:125:39
    * Creates a new account in the chart of accounts.
    */
   createAccount(config: AccountConfig): Account {
-    if (this.accounts.has(config.id)) {
-      throw new DuplicateAccountError(config.id);
-    }
+    if (this.accounts.has(config.id)) {}
 
     // Validate currency matches ledger
killedBy: DoubleEntryLedger account management throws on duplicate account ID
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:131:7
 
     // Validate currency matches ledger
     const accountCurrency =
-      typeof config.currency === "string"
+      true
         ? config.currency
         : config.currency.code;
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account currency ([object Object]) must match ledger currency (USD)

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:131:7
 
     // Validate currency matches ledger
     const accountCurrency =
-      typeof config.currency === "string"
+      typeof config.currency !== "string"
         ? config.currency
         : config.currency.code;
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account currency ([object Object]) must match ledger currency (USD)

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:135:9
         ? config.currency
         : config.currency.code;
 
-    if (accountCurrency !== this.currency) {
+    if (accountCurrency === this.currency) {
       throw new InvalidArgumentError(
         `Account currency (${accountCurrency}) must match ledger currency (${this.currency})`,
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account currency (USD) must match ledger currency (USD)

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:135:9
         ? config.currency
         : config.currency.code;
 
-    if (accountCurrency !== this.currency) {
+    if (true) {
       throw new InvalidArgumentError(
         `Account currency (${accountCurrency}) must match ledger currency (${this.currency})`,
killedBy: DoubleEntryLedger account management creates an account
statusReason: Account currency (USD) must match ledger currency (USD)

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:149:55
   /**
    * Creates multiple accounts at once (for setting up chart of accounts).
    */
-  createAccounts(configs: AccountConfig[]): Account[] {
-    return configs.map((config) => this.createAccount(config));
-  }
+  createAccounts(configs: AccountConfig[]): Account[] {}
 
   /**
killedBy: DoubleEntryLedger account management creates multiple accounts at once
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:150:24
    * Creates multiple accounts at once (for setting up chart of accounts).
    */
   createAccounts(configs: AccountConfig[]): Account[] {
-    return configs.map((config) => this.createAccount(config));
+    return configs.map(() => undefined);
   }
 
killedBy: DoubleEntryLedger account management creates multiple accounts at once
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:156:47
   /**
    * Gets an account by ID.
    */
-  getAccount(id: string): Account | undefined {
-    return this.accounts.get(id);
-  }
+  getAccount(id: string): Account | undefined {}
 
   /**
killedBy: DoubleEntryLedger account management creates an account
statusReason: expected undefined to be Account{ id: 'cash', …(11) } // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:163:42
   /**
    * Gets an account by ID or throws if not found.
    */
-  getAccountOrThrow(id: string): Account {
-    const account = this.accounts.get(id);
-    if (!account) {
-      throw new AccountNotFoundError(id);
-    }
-    return account;
-  }
+  getAccountOrThrow(id: string): Account {}
 
   /**
killedBy: DoubleEntryLedger account management getAccountOrThrow throws for missing account
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:165:9
    */
   getAccountOrThrow(id: string): Account {
     const account = this.accounts.get(id);
-    if (!account) {
+    if (false) {
       throw new AccountNotFoundError(id);
     }
killedBy: DoubleEntryLedger account management getAccountOrThrow throws for missing account
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:165:9
    */
   getAccountOrThrow(id: string): Account {
     const account = this.accounts.get(id);
-    if (!account) {
+    if (account) {
       throw new AccountNotFoundError(id);
     }
killedBy: DoubleEntryLedger account management getAccountOrThrow throws for missing account
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:174:79
   /**
    * Gets all accounts, optionally filtered by type.
    */
-  getAccounts(filter?: { type?: AccountType; isActive?: boolean }): Account[] {
-    let accounts = Array.from(this.accounts.values());
-
-    if (filter?.type) {
-      accounts = accounts.filter((a) => a.type === filter.type);
-    }
-    if (filter?.isActive !== undefined) {
-      accounts = accounts.filter((a) => a.isActive === filter.isActive);
-    }
-
-    return accounts;
-  }
+  getAccounts(filter?: { type?: AccountType; isActive?: boolean }): Account[] {}
 
   /**
killedBy: DoubleEntryLedger account management filters accounts by type
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:177:9
   getAccounts(filter?: { type?: AccountType; isActive?: boolean }): Account[] {
     let accounts = Array.from(this.accounts.values());
 
-    if (filter?.type) {
+    if (true) {
       accounts = accounts.filter((a) => a.type === filter.type);
     }
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:177:9
   getAccounts(filter?: { type?: AccountType; isActive?: boolean }): Account[] {
     let accounts = Array.from(this.accounts.values());
 
-    if (filter?.type) {
+    if (false) {
       accounts = accounts.filter((a) => a.type === filter.type);
     }
killedBy: DoubleEntryLedger account management filters accounts by type
statusReason: expected [ Account{ id: 'cash', …(11) }, …(2) ] to have a length of 2 but got 3

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:178:18
     let accounts = Array.from(this.accounts.values());
 
     if (filter?.type) {
-      accounts = accounts.filter((a) => a.type === filter.type);
+      accounts = accounts;
     }
     if (filter?.isActive !== undefined) {
killedBy: DoubleEntryLedger account management filters accounts by type
statusReason: expected [ Account{ id: 'cash', …(11) }, …(2) ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:178:41
     let accounts = Array.from(this.accounts.values());
 
     if (filter?.type) {
-      accounts = accounts.filter((a) => a.type === filter.type);
+      accounts = accounts.filter((a) => a.type !== filter.type);
     }
     if (filter?.isActive !== undefined) {
killedBy: DoubleEntryLedger account management filters accounts by type
statusReason: expected [ Account{ id: 'revenue', …(11) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:180:41
     if (filter?.type) {
       accounts = accounts.filter((a) => a.type === filter.type);
     }
-    if (filter?.isActive !== undefined) {
-      accounts = accounts.filter((a) => a.isActive === filter.isActive);
-    }
+    if (filter?.isActive !== undefined) {}
 
     return accounts;
killedBy: DoubleEntryLedger getAccounts filtering filters by active status
statusReason: expected [ Array(2) ] to have a length of 1 but got 2

[Killed] OptionalChaining
src/ledger/DoubleEntryLedger.ts:180:9
     if (filter?.type) {
       accounts = accounts.filter((a) => a.type === filter.type);
     }
-    if (filter?.isActive !== undefined) {
+    if (filter.isActive !== undefined) {
       accounts = accounts.filter((a) => a.isActive === filter.isActive);
     }
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'isActive')

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:181:34
       accounts = accounts.filter((a) => a.type === filter.type);
     }
     if (filter?.isActive !== undefined) {
-      accounts = accounts.filter((a) => a.isActive === filter.isActive);
+      accounts = accounts.filter(() => undefined);
     }
 
killedBy: DoubleEntryLedger getAccounts filtering filters by active status
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:181:41
       accounts = accounts.filter((a) => a.type === filter.type);
     }
     if (filter?.isActive !== undefined) {
-      accounts = accounts.filter((a) => a.isActive === filter.isActive);
+      accounts = accounts.filter((a) => a.isActive !== filter.isActive);
     }
 
killedBy: DoubleEntryLedger getAccounts filtering filters by active status
statusReason: expected 'inactive' to be 'active' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:198:37
    */
   post(input: JournalEntryInput): JournalEntry {
     // Validate all accounts exist
-    for (const line of input.lines) {
-      if (!this.accounts.has(line.accountId)) {
-        throw new AccountNotFoundError(line.accountId);
-      }
-    }
+    for (const line of input.lines) {}
 
     // Calculate totals
killedBy: DoubleEntryLedger journal entry posting throws for non-existent account
statusReason: expected error to be instance of AccountNotFoundError

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:199:11
   post(input: JournalEntryInput): JournalEntry {
     // Validate all accounts exist
     for (const line of input.lines) {
-      if (!this.accounts.has(line.accountId)) {
+      if (this.accounts.has(line.accountId)) {
         throw new AccountNotFoundError(line.accountId);
       }
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Account not found: "cash"

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:199:11
   post(input: JournalEntryInput): JournalEntry {
     // Validate all accounts exist
     for (const line of input.lines) {
-      if (!this.accounts.has(line.accountId)) {
+      if (true) {
         throw new AccountNotFoundError(line.accountId);
       }
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Account not found: "cash"

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:205:25
     }
 
     // Calculate totals
-    const totalDebits = input.lines
-      .filter((l) => l.type === "debit")
+    const totalDebits = input.lines
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Journal entry is not balanced. Debits: $200.00, Credits: $100.00, Difference: $100.00

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:206:22
 
     // Calculate totals
     const totalDebits = input.lines
-      .filter((l) => l.type === "debit")
+      .filter((l) => l.type !== "debit")
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting throws for unbalanced entry
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:206:22
 
     // Calculate totals
     const totalDebits = input.lines
-      .filter((l) => l.type === "debit")
+      .filter((l) => false)
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Journal entry is not balanced. Debits: $0.00, Credits: $100.00, Difference: -$100.00

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:207:15
     // Calculate totals
     const totalDebits = input.lines
       .filter((l) => l.type === "debit")
-      .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
+      .reduce(() => undefined, Money.zero(this.currency));
 
     const totalCredits = input.lines
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:209:26
       .filter((l) => l.type === "debit")
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
-    const totalCredits = input.lines
-      .filter((l) => l.type === "credit")
+    const totalCredits = input.lines
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Journal entry is not balanced. Debits: $100.00, Credits: $200.00, Difference: -$100.00

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:210:22
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
     const totalCredits = input.lines
-      .filter((l) => l.type === "credit")
+      .filter((l) => true)
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Journal entry is not balanced. Debits: $100.00, Credits: $200.00, Difference: -$100.00

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:210:22
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
     const totalCredits = input.lines
-      .filter((l) => l.type === "credit")
+      .filter((l) => l.type !== "credit")
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
killedBy: DoubleEntryLedger journal entry posting throws for unbalanced entry
statusReason: expected function to throw an error, but it didn't

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:211:15
 
     const totalCredits = input.lines
       .filter((l) => l.type === "credit")
-      .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
+      .reduce(() => undefined, Money.zero(this.currency));
 
     // Verify balanced
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Cannot convert undefined to a BigInt

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:214:9
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
     // Verify balanced
-    if (!totalDebits.equals(totalCredits)) {
+    if (false) {
       throw new UnbalancedEntryError(totalDebits, totalCredits);
     }
killedBy: DoubleEntryLedger journal entry posting throws for unbalanced entry
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:214:9
       .reduce((sum, l) => sum.add(l.amount), Money.zero(this.currency));
 
     // Verify balanced
-    if (!totalDebits.equals(totalCredits)) {
+    if (totalDebits.equals(totalCredits)) {
       throw new UnbalancedEntryError(totalDebits, totalCredits);
     }
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Journal entry is not balanced. Debits: $100.00, Credits: $100.00, Difference: $0.00

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:220:7
 
     // Create the entry
     const previousHash =
-      this.journalEntries.length > 0
+      false
         ? this.journalEntries[this.journalEntries.length - 1].hash
         : null;
killedBy: DoubleEntryLedger journal entry posting creates hash chain
statusReason: expected null to be 'dc7015b9ea68b347a7e69a4583575d9b1348e…' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:220:7
 
     // Create the entry
     const previousHash =
-      this.journalEntries.length > 0
+      true
         ? this.journalEntries[this.journalEntries.length - 1].hash
         : null;
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Cannot read properties of undefined (reading 'hash')

[Killed] ArithmeticOperator
src/ledger/DoubleEntryLedger.ts:221:31
     // Create the entry
     const previousHash =
       this.journalEntries.length > 0
-        ? this.journalEntries[this.journalEntries.length - 1].hash
+        ? this.journalEntries[this.journalEntries.length + 1].hash
         : null;
 
killedBy: DoubleEntryLedger journal entry posting increments entry numbers sequentially
statusReason: Cannot read properties of undefined (reading 'hash')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:224:26
         ? this.journalEntries[this.journalEntries.length - 1].hash
         : null;
 
-    const entryContent = {
-      id: randomUUID(),
-      entryNumber: this.nextEntryNumber,
-      lines: input.lines.map((l) => Object.freeze({ ...l })),
-      metadata: Object.freeze({
-        ...input.metadata,
-        date: input.metadata.date ?? new Date(),
-      }),
-      createdAt: new Date(),
-      previousHash,
-      isPosted: true,
-      isVoided: false,
-    };
+    const entryContent = {};
 
     const hash = generateHashSync(entryContent);
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:227:30
     const entryContent = {
       id: randomUUID(),
       entryNumber: this.nextEntryNumber,
-      lines: input.lines.map((l) => Object.freeze({ ...l })),
+      lines: input.lines.map(() => undefined),
       metadata: Object.freeze({
         ...input.metadata,
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Cannot read properties of undefined (reading 'accountId')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:228:31
       id: randomUUID(),
       entryNumber: this.nextEntryNumber,
       lines: input.lines.map((l) => Object.freeze({ ...l })),
-      metadata: Object.freeze({
-        ...input.metadata,
-        date: input.metadata.date ?? new Date(),
-      }),
+      metadata: Object.freeze({}),
       createdAt: new Date(),
       previousHash,
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:230:15
       lines: input.lines.map((l) => Object.freeze({ ...l })),
       metadata: Object.freeze({
         ...input.metadata,
-        date: input.metadata.date ?? new Date(),
+        date: input.metadata.date && new Date(),
       }),
       createdAt: new Date(),
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:234:17
       }),
       createdAt: new Date(),
       previousHash,
-      isPosted: true,
+      isPosted: false,
       isVoided: false,
     };
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:235:17
       createdAt: new Date(),
       previousHash,
       isPosted: true,
-      isVoided: false,
+      isVoided: true,
     };
 
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:246:37
     });
 
     // Post to accounts
-    for (const line of input.lines) {
-      const account = this.accounts.get(line.accountId)!;
-      if (line.type === "debit") {
-        account.debit(line.amount);
-      } else {
-        account.credit(line.amount);
-      }
-    }
+    for (const line of input.lines) {}
 
     this.journalEntries.push(entry);
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '0.00' to be '100.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:248:11
     // Post to accounts
     for (const line of input.lines) {
       const account = this.accounts.get(line.accountId)!;
-      if (line.type === "debit") {
+      if (false) {
         account.debit(line.amount);
       } else {
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:248:11
     // Post to accounts
     for (const line of input.lines) {
       const account = this.accounts.get(line.accountId)!;
-      if (line.type === "debit") {
+      if (true) {
         account.debit(line.amount);
       } else {
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:250:14
       const account = this.accounts.get(line.accountId)!;
       if (line.type === "debit") {
         account.debit(line.amount);
-      } else {
-        account.credit(line.amount);
-      }
+      } else {}
     }
 
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '0.00' to be '100.00' // Object.is equality

[Killed] UpdateOperator
src/ledger/DoubleEntryLedger.ts:256:5
     }
 
     this.journalEntries.push(entry);
-    this.nextEntryNumber++;
+    this.nextEntryNumber--;
 
     return entry;
killedBy: DoubleEntryLedger journal entry posting increments entry numbers sequentially
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:272:7
    */
   void(entryId: string, reason: string): JournalEntry {
     const originalIndex = this.journalEntries.findIndex(
-      (e) => e.id === entryId,
+      () => undefined,
     );
     if (originalIndex === -1) {
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Journal entry not found: c0c9cfc4-5bf8-423a-9f87-bf6e96ef3465

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:272:14
    */
   void(entryId: string, reason: string): JournalEntry {
     const originalIndex = this.journalEntries.findIndex(
-      (e) => e.id === entryId,
+      (e) => e.id !== entryId,
     );
     if (originalIndex === -1) {
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Journal entry not found: 85062218-7ff8-44c5-a743-84919642eb39

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:274:9
     const originalIndex = this.journalEntries.findIndex(
       (e) => e.id === entryId,
     );
-    if (originalIndex === -1) {
+    if (originalIndex !== -1) {
       throw new InvalidArgumentError(`Journal entry not found: ${entryId}`);
     }
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Journal entry not found: 7884e473-748c-4dc8-9528-76ffee507248

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:274:31
     const originalIndex = this.journalEntries.findIndex(
       (e) => e.id === entryId,
     );
-    if (originalIndex === -1) {
-      throw new InvalidArgumentError(`Journal entry not found: ${entryId}`);
-    }
+    if (originalIndex === -1) {}
 
     const original = this.journalEntries[originalIndex];
killedBy: DoubleEntryLedger voiding entries throws when voiding non-existent entry
statusReason: expected [Function] to throw error including 'Journal entry not found' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:275:38
       (e) => e.id === entryId,
     );
     if (originalIndex === -1) {
-      throw new InvalidArgumentError(`Journal entry not found: ${entryId}`);
+      throw new InvalidArgumentError(``);
     }
 
killedBy: DoubleEntryLedger voiding entries throws when voiding non-existent entry
statusReason: expected [Function] to throw error including 'Journal entry not found' but got ''
