[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:279:9
     }
 
     const original = this.journalEntries[originalIndex];
-    if (original.isVoided) {
+    if (false) {
       throw new InvalidArgumentError(
         `Journal entry ${entryId} is already voided`,
killedBy: DoubleEntryLedger voiding entries throws when voiding already voided entry
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:279:28
     }
 
     const original = this.journalEntries[originalIndex];
-    if (original.isVoided) {
-      throw new InvalidArgumentError(
-        `Journal entry ${entryId} is already voided`,
-      );
-    }
+    if (original.isVoided) {}
 
     // Create reversing entry (swap debits and credits)
killedBy: DoubleEntryLedger voiding entries throws when voiding already voided entry
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:281:9
     const original = this.journalEntries[originalIndex];
     if (original.isVoided) {
       throw new InvalidArgumentError(
-        `Journal entry ${entryId} is already voided`,
+        ``,
       );
     }
killedBy: DoubleEntryLedger voiding entries throws when voiding already voided entry
statusReason: expected [Function] to throw error including 'already voided' but got ''

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:286:62
     }
 
     // Create reversing entry (swap debits and credits)
-    const reversingLines: JournalLine[] = original.lines.map((line) => ({
-      accountId: line.accountId,
-      amount: line.amount,
-      type: line.type === "debit" ? "credit" : "debit",
-      memo: `Reversal: ${line.memo ?? ""}`.trim(),
-    }));
+    const reversingLines: JournalLine[] = original.lines.map(() => undefined);
 
     const reversingEntry = this.post({
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Cannot read properties of undefined (reading 'accountId')

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:289:13
     const reversingLines: JournalLine[] = original.lines.map((line) => ({
       accountId: line.accountId,
       amount: line.amount,
-      type: line.type === "debit" ? "credit" : "debit",
+      type: true ? "credit" : "debit",
       memo: `Reversal: ${line.memo ?? ""}`.trim(),
     }));
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Journal entry is not balanced. Debits: $0.00, Credits: $200.00, Difference: -$200.00

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:289:13
     const reversingLines: JournalLine[] = original.lines.map((line) => ({
       accountId: line.accountId,
       amount: line.amount,
-      type: line.type === "debit" ? "credit" : "debit",
+      type: line.type !== "debit" ? "credit" : "debit",
       memo: `Reversal: ${line.memo ?? ""}`.trim(),
     }));
killedBy: DoubleEntryLedger voiding entries reverses account balances
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/ledger/DoubleEntryLedger.ts:290:26
       accountId: line.accountId,
       amount: line.amount,
       type: line.type === "debit" ? "credit" : "debit",
-      memo: `Reversal: ${line.memo ?? ""}`.trim(),
+      memo: `Reversal: ${line.memo && ""}`.trim(),
     }));
 

[Survived] MethodExpression
src/ledger/DoubleEntryLedger.ts:290:13
       accountId: line.accountId,
       amount: line.amount,
       type: line.type === "debit" ? "credit" : "debit",
-      memo: `Reversal: ${line.memo ?? ""}`.trim(),
+      memo: `Reversal: ${line.memo ?? ""}`,
     }));
 

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:298:20
       metadata: {
         description: `VOID: ${original.metadata.description} - ${reason}`,
         reference: original.metadata.reference,
-        tags: [...(original.metadata.tags ?? []), "void", "reversal"],
+        tags: [...(original.metadata.tags && []), "void", "reversal"],
       },
     });
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/ledger/DoubleEntryLedger.ts:298:15
       metadata: {
         description: `VOID: ${original.metadata.description} - ${reason}`,
         reference: original.metadata.reference,
-        tags: [...(original.metadata.tags ?? []), "void", "reversal"],
+        tags: [],
       },
     });
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: expected [] to include 'void'

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:305:17
     // Mark original as voided (create new frozen object)
     const voidedOriginal: JournalEntry = Object.freeze({
       ...original,
-      isVoided: true,
+      isVoided: false,
       voidedBy: reversingEntry.id,
     });
killedBy: DoubleEntryLedger voiding entries marks original entry as voided
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/ledger/DoubleEntryLedger.ts:313:23
     this.journalEntries[originalIndex] = voidedOriginal;
 
     // Mark reversing entry with reference to original
-    const lastIndex = this.journalEntries.length - 1;
+    const lastIndex = this.journalEntries.length + 1;
     const reversingWithRef: JournalEntry = Object.freeze({
       ...this.journalEntries[lastIndex],
killedBy: DoubleEntryLedger voiding entries voids an entry by creating a reversal
statusReason: Cannot read properties of undefined (reading 'tags')

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:330:9
     let entries = [...this.journalEntries];
 
     // Filter voided entries (excluded by default)
-    if (!options.includeVoided) {
+    if (true) {
       entries = entries.filter((e) => !e.isVoided);
     }
killedBy: DoubleEntryLedger querying includes voided entries when requested
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:330:9
     let entries = [...this.journalEntries];
 
     // Filter voided entries (excluded by default)
-    if (!options.includeVoided) {
+    if (false) {
       entries = entries.filter((e) => !e.isVoided);
     }
killedBy: DoubleEntryLedger querying excludes voided entries by default
statusReason: expected [ { …(10) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:331:39
 
     // Filter voided entries (excluded by default)
     if (!options.includeVoided) {
-      entries = entries.filter((e) => !e.isVoided);
+      entries = entries.filter((e) => e.isVoided);
     }
 
killedBy: DoubleEntryLedger querying queries by account
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:331:17
 
     // Filter voided entries (excluded by default)
     if (!options.includeVoided) {
-      entries = entries.filter((e) => !e.isVoided);
+      entries = entries;
     }
 
killedBy: DoubleEntryLedger querying excludes voided entries by default
statusReason: expected [ { …(10) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:335:27
     }
 
     // Filter by date range
-    if (options.fromDate) {
-      entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
-      );
-    }
+    if (options.fromDate) {}
     if (options.toDate) {
       entries = entries.filter(
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:335:9
     }
 
     // Filter by date range
-    if (options.fromDate) {
+    if (false) {
       entries = entries.filter(
         (e) =>
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:336:17
 
     // Filter by date range
     if (options.fromDate) {
-      entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
-      );
+      entries = entries;
     }
     if (options.toDate) {
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:337:9
     // Filter by date range
     if (options.fromDate) {
       entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
+        () => undefined,
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:338:11
     if (options.fromDate) {
       entries = entries.filter(
         (e) =>
-          (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
+          true,
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:338:11
     if (options.fromDate) {
       entries = entries.filter(
         (e) =>
-          (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
+          (e.metadata.date ?? e.createdAt) < (options.fromDate ?? new Date(0)),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:339:12
       entries = entries.filter(
         (e) =>
           (e.metadata.date ?? e.createdAt) >=
-          (options.fromDate ?? new Date(0)),
+          (options.fromDate && new Date(0)),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - fromDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:342:9
           (options.fromDate ?? new Date(0)),
       );
     }
-    if (options.toDate) {
+    if (false) {
       entries = entries.filter(
         (e) =>
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:342:25
           (options.fromDate ?? new Date(0)),
       );
     }
-    if (options.toDate) {
-      entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) <=
-          (options.toDate ?? new Date(8640000000000000)),
-      );
-    }
+    if (options.toDate) {}
 
     // Filter by account
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:343:17
       );
     }
     if (options.toDate) {
-      entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) <=
-          (options.toDate ?? new Date(8640000000000000)),
-      );
+      entries = entries;
     }
 
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:344:9
     }
     if (options.toDate) {
       entries = entries.filter(
-        (e) =>
-          (e.metadata.date ?? e.createdAt) <=
-          (options.toDate ?? new Date(8640000000000000)),
+        () => undefined,
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:345:12
     if (options.toDate) {
       entries = entries.filter(
         (e) =>
-          (e.metadata.date ?? e.createdAt) <=
+          (e.metadata.date && e.createdAt) <=
           (options.toDate ?? new Date(8640000000000000)),
       );
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:345:11
     if (options.toDate) {
       entries = entries.filter(
         (e) =>
-          (e.metadata.date ?? e.createdAt) <=
-          (options.toDate ?? new Date(8640000000000000)),
+          (e.metadata.date ?? e.createdAt) > (options.toDate ?? new Date(8640000000000000)),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:346:12
       entries = entries.filter(
         (e) =>
           (e.metadata.date ?? e.createdAt) <=
-          (options.toDate ?? new Date(8640000000000000)),
+          (options.toDate && new Date(8640000000000000)),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by date range - toDate
statusReason: expected [ { …(9) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:351:9
     }
 
     // Filter by account
-    if (options.accountId) {
+    if (true) {
       entries = entries.filter((e) =>
         e.lines.some((l) => l.accountId === options.accountId),
killedBy: DoubleEntryLedger querying includes voided entries when requested
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:351:9
     }
 
     // Filter by account
-    if (options.accountId) {
+    if (false) {
       entries = entries.filter((e) =>
         e.lines.some((l) => l.accountId === options.accountId),

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:352:32
 
     // Filter by account
     if (options.accountId) {
-      entries = entries.filter((e) =>
-        e.lines.some((l) => l.accountId === options.accountId),
+      entries = entries.filter(() => undefined,
       );
     }
killedBy: DoubleEntryLedger querying queries by account
statusReason: expected [] to have a length of 2 but got +0

[Survived] MethodExpression
src/ledger/DoubleEntryLedger.ts:352:17
 
     // Filter by account
     if (options.accountId) {
-      entries = entries.filter((e) =>
-        e.lines.some((l) => l.accountId === options.accountId),
-      );
+      entries = entries;
     }
 

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:353:29
     // Filter by account
     if (options.accountId) {
       entries = entries.filter((e) =>
-        e.lines.some((l) => l.accountId === options.accountId),
+        e.lines.some((l) => false),
       );
     }
killedBy: DoubleEntryLedger querying queries by account
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:353:9
     // Filter by account
     if (options.accountId) {
       entries = entries.filter((e) =>
-        e.lines.some((l) => l.accountId === options.accountId),
+        e.lines.every(l => l.accountId === options.accountId),
       );
     }
killedBy: DoubleEntryLedger querying queries by account
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:358:9
     }
 
     // Filter by reference
-    if (options.reference) {
+    if (false) {
       entries = entries.filter(
         (e) => e.metadata.reference === options.reference,
killedBy: DoubleEntryLedger querying queries by reference
statusReason: expected [ { …(9) }, { …(9) } ] to have a length of 1 but got 2

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:358:28
     }
 
     // Filter by reference
-    if (options.reference) {
-      entries = entries.filter(
-        (e) => e.metadata.reference === options.reference,
-      );
-    }
+    if (options.reference) {}
 
     // Filter by tags
killedBy: DoubleEntryLedger querying queries by reference
statusReason: expected [ { …(9) }, { …(9) } ] to have a length of 1 but got 2

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:359:17
 
     // Filter by reference
     if (options.reference) {
-      entries = entries.filter(
-        (e) => e.metadata.reference === options.reference,
-      );
+      entries = entries;
     }
 
killedBy: DoubleEntryLedger querying queries by reference
statusReason: expected [ { …(9) }, { …(9) } ] to have a length of 1 but got 2

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:360:9
     // Filter by reference
     if (options.reference) {
       entries = entries.filter(
-        (e) => e.metadata.reference === options.reference,
+        () => undefined,
       );
     }
killedBy: DoubleEntryLedger querying queries by reference
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:360:16
     // Filter by reference
     if (options.reference) {
       entries = entries.filter(
-        (e) => e.metadata.reference === options.reference,
+        (e) => false,
       );
     }
killedBy: DoubleEntryLedger querying queries by reference
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:365:50
     }
 
     // Filter by tags
-    if (options.tags && options.tags.length > 0) {
-      entries = entries.filter((e) =>
-        options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
-      );
-    }
+    if (options.tags && options.tags.length > 0) {}
 
     // Pagination
killedBy: DoubleEntryLedger query edge cases filters by tags
statusReason: expected [ { …(9) }, { …(9) } ] to have a length of 1 but got 2

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:365:9
     }
 
     // Filter by tags
-    if (options.tags && options.tags.length > 0) {
+    if (options.tags || options.tags.length > 0) {
       entries = entries.filter((e) =>
         options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
killedBy: DoubleEntryLedger querying queries by account
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:366:17
 
     // Filter by tags
     if (options.tags && options.tags.length > 0) {
-      entries = entries.filter((e) =>
-        options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
-      );
+      entries = entries;
     }
 
killedBy: DoubleEntryLedger query edge cases filters by tags
statusReason: expected [ { …(9) }, { …(9) } ] to have a length of 1 but got 2

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:366:32
 
     // Filter by tags
     if (options.tags && options.tags.length > 0) {
-      entries = entries.filter((e) =>
-        options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
+      entries = entries.filter(() => undefined,
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by tags
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:367:28
     // Filter by tags
     if (options.tags && options.tags.length > 0) {
       entries = entries.filter((e) =>
-        options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
+        options.tags!.some(() => undefined),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by tags
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:367:9
     // Filter by tags
     if (options.tags && options.tags.length > 0) {
       entries = entries.filter((e) =>
-        options.tags!.some((tag) => e.metadata.tags?.includes(tag)),
+        options.tags!.every(tag => e.metadata.tags?.includes(tag)),
       );
     }
killedBy: DoubleEntryLedger query edge cases filters by tags
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:372:25
     }
 
     // Pagination
-    if (options.offset) {
-      entries = entries.slice(options.offset);
-    }
+    if (options.offset) {}
     if (options.limit) {
       entries = entries.slice(0, options.limit);
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected '0caa02ba-d273-4d03-8d23-6f931a95be0d' not to be '0caa02ba-d273-4d03-8d23-6f931a95be0d' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:372:9
     }
 
     // Pagination
-    if (options.offset) {
+    if (false) {
       entries = entries.slice(options.offset);
     }
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected 'dcecd580-dcee-4030-a91a-08b7e83fbc2a' not to be 'dcecd580-dcee-4030-a91a-08b7e83fbc2a' // Object.is equality

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:373:17
 
     // Pagination
     if (options.offset) {
-      entries = entries.slice(options.offset);
+      entries = entries;
     }
     if (options.limit) {
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected 'e5bc6759-294d-426e-9ccf-c9e6410fd3f2' not to be 'e5bc6759-294d-426e-9ccf-c9e6410fd3f2' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:375:24
     if (options.offset) {
       entries = entries.slice(options.offset);
     }
-    if (options.limit) {
-      entries = entries.slice(0, options.limit);
-    }
+    if (options.limit) {}
 
     return entries;
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(7) ] to have a length of 3 but got 10

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:375:9
     if (options.offset) {
       entries = entries.slice(options.offset);
     }
-    if (options.limit) {
+    if (false) {
       entries = entries.slice(0, options.limit);
     }
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(7) ] to have a length of 3 but got 10

[Killed] MethodExpression
src/ledger/DoubleEntryLedger.ts:376:17
       entries = entries.slice(options.offset);
     }
     if (options.limit) {
-      entries = entries.slice(0, options.limit);
+      entries = entries;
     }
 
killedBy: DoubleEntryLedger querying supports pagination
statusReason: expected [ { …(9) }, { …(9) }, { …(9) }, …(7) ] to have a length of 3 but got 10

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:398:46
     let runningDebits = Money.zero(this.currency);
     let runningCredits = Money.zero(this.currency);
 
-    for (const entry of this.journalEntries) {
-      if (entry.isVoided) continue;
-
-      for (const line of entry.lines) {
-        if (line.accountId === accountId) {
-          if (line.type === "debit") {
-            runningDebits = runningDebits.add(line.amount);
-          } else {
-            runningCredits = runningCredits.add(line.amount);
-          }
-
-          const runningBalance = account.increasesWithDebit()
-            ? runningDebits.subtract(runningCredits)
-            : runningCredits.subtract(runningDebits);
-
-          history.push({
-            entry,
-            line: line as JournalLine,
-            runningBalance,
-          });
-        }
-      }
-    }
+    for (const entry of this.journalEntries) {}
 
     return history;
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:399:11
     let runningCredits = Money.zero(this.currency);
 
     for (const entry of this.journalEntries) {
-      if (entry.isVoided) continue;
+      if (true) continue;
 
       for (const line of entry.lines) {
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:399:11
     let runningCredits = Money.zero(this.currency);
 
     for (const entry of this.journalEntries) {
-      if (entry.isVoided) continue;
+      if (false) continue;
 
       for (const line of entry.lines) {

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:401:39
     for (const entry of this.journalEntries) {
       if (entry.isVoided) continue;
 
-      for (const line of entry.lines) {
-        if (line.accountId === accountId) {
-          if (line.type === "debit") {
-            runningDebits = runningDebits.add(line.amount);
-          } else {
-            runningCredits = runningCredits.add(line.amount);
-          }
-
-          const runningBalance = account.increasesWithDebit()
-            ? runningDebits.subtract(runningCredits)
-            : runningCredits.subtract(runningDebits);
-
-          history.push({
-            entry,
-            line: line as JournalLine,
-            runningBalance,
-          });
-        }
-      }
+      for (const line of entry.lines) {}
     }
 
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:402:43
       if (entry.isVoided) continue;
 
       for (const line of entry.lines) {
-        if (line.accountId === accountId) {
-          if (line.type === "debit") {
-            runningDebits = runningDebits.add(line.amount);
-          } else {
-            runningCredits = runningCredits.add(line.amount);
-          }
-
-          const runningBalance = account.increasesWithDebit()
-            ? runningDebits.subtract(runningCredits)
-            : runningCredits.subtract(runningDebits);
-
-          history.push({
-            entry,
-            line: line as JournalLine,
-            runningBalance,
-          });
-        }
+        if (line.accountId === accountId) {}
       }
     }
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:402:13
       if (entry.isVoided) continue;
 
       for (const line of entry.lines) {
-        if (line.accountId === accountId) {
+        if (false) {
           if (line.type === "debit") {
             runningDebits = runningDebits.add(line.amount);
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:403:15
 
       for (const line of entry.lines) {
         if (line.accountId === accountId) {
-          if (line.type === "debit") {
+          if (false) {
             runningDebits = runningDebits.add(line.amount);
           } else {
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:403:15
 
       for (const line of entry.lines) {
         if (line.accountId === accountId) {
-          if (line.type === "debit") {
+          if (line.type !== "debit") {
             runningDebits = runningDebits.add(line.amount);
           } else {
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:405:18
         if (line.accountId === accountId) {
           if (line.type === "debit") {
             runningDebits = runningDebits.add(line.amount);
-          } else {
-            runningCredits = runningCredits.add(line.amount);
-          }
+          } else {}
 
           const runningBalance = account.increasesWithDebit()
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: expected '100.00' to be '70.00' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:413:24
             ? runningDebits.subtract(runningCredits)
             : runningCredits.subtract(runningDebits);
 
-          history.push({
-            entry,
-            line: line as JournalLine,
-            runningBalance,
-          });
+          history.push({});
         }
       }
killedBy: DoubleEntryLedger account history tracks running balance for an account
statusReason: Cannot read properties of undefined (reading 'toDecimalString')

[Survived] ArrayDeclaration
src/ledger/DoubleEntryLedger.ts:432:42
    * In a properly maintained ledger, total debits must equal total credits.
    */
   getTrialBalance(asOf?: Date): TrialBalance {
-    const entries: TrialBalanceEntry[] = [];
+    const entries: TrialBalanceEntry[] = ["Stryker was here"];
     let totalDebits = Money.zero(this.currency);
     let totalCredits = Money.zero(this.currency);

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:437:11
     let totalCredits = Money.zero(this.currency);
 
     for (const account of this.accounts.values()) {
-      if (!account.isActive) continue;
+      if (account.isActive) continue;
 
       const balance = account.getBalance();
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected undefined to be defined
