[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:437:11
     let totalCredits = Money.zero(this.currency);
 
     for (const account of this.accounts.values()) {
-      if (!account.isActive) continue;
+      if (true) continue;
 
       const balance = account.getBalance();
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:446:11
       let creditBalance = Money.zero(this.currency);
 
       // Place balance on appropriate side
-      if (balance.isPositive()) {
+      if (true) {
         if (classification.normalBalance === "debit") {
           debitBalance = balance;
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative asset)
statusReason: expected '0.00' to be '1000.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:446:33
       let creditBalance = Money.zero(this.currency);
 
       // Place balance on appropriate side
-      if (balance.isPositive()) {
-        if (classification.normalBalance === "debit") {
-          debitBalance = balance;
-          totalDebits = totalDebits.add(balance);
-        } else {
-          creditBalance = balance;
-          totalCredits = totalCredits.add(balance);
-        }
-      } else if (balance.isNegative()) {
+      if (balance.isPositive()) {} else if (balance.isNegative()) {
         // Contra balance - put on opposite side
         const absBalance = balance.abs();
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:447:13
 
       // Place balance on appropriate side
       if (balance.isPositive()) {
-        if (classification.normalBalance === "debit") {
+        if (classification.normalBalance !== "debit") {
           debitBalance = balance;
           totalDebits = totalDebits.add(balance);
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative asset)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:447:55
 
       // Place balance on appropriate side
       if (balance.isPositive()) {
-        if (classification.normalBalance === "debit") {
-          debitBalance = balance;
-          totalDebits = totalDebits.add(balance);
-        } else {
+        if (classification.normalBalance === "debit") {} else {
           creditBalance = balance;
           totalCredits = totalCredits.add(balance);
killedBy: DoubleEntryLedger trial balance generates balanced trial balance
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:450:16
         if (classification.normalBalance === "debit") {
           debitBalance = balance;
           totalDebits = totalDebits.add(balance);
-        } else {
-          creditBalance = balance;
-          totalCredits = totalCredits.add(balance);
-        }
+        } else {}
       } else if (balance.isNegative()) {
         // Contra balance - put on opposite side
killedBy: DoubleEntryLedger trial balance generates balanced trial balance
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:454:40
           creditBalance = balance;
           totalCredits = totalCredits.add(balance);
         }
-      } else if (balance.isNegative()) {
-        // Contra balance - put on opposite side
-        const absBalance = balance.abs();
-        if (classification.normalBalance === "debit") {
-          creditBalance = absBalance;
-          totalCredits = totalCredits.add(absBalance);
-        } else {
-          debitBalance = absBalance;
-          totalDebits = totalDebits.add(absBalance);
-        }
-      }
+      } else if (balance.isNegative()) {}
 
       // Only include accounts with activity
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative asset)
statusReason: expected undefined to be '1000.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:454:18
           creditBalance = balance;
           totalCredits = totalCredits.add(balance);
         }
-      } else if (balance.isNegative()) {
+      } else if (false) {
         // Contra balance - put on opposite side
         const absBalance = balance.abs();
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative asset)
statusReason: expected undefined to be '1000.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:457:13
       } else if (balance.isNegative()) {
         // Contra balance - put on opposite side
         const absBalance = balance.abs();
-        if (classification.normalBalance === "debit") {
+        if (true) {
           creditBalance = absBalance;
           totalCredits = totalCredits.add(absBalance);
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative liability)
statusReason: expected '0.00' to be '500.00' // Object.is equality

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:457:13
       } else if (balance.isNegative()) {
         // Contra balance - put on opposite side
         const absBalance = balance.abs();
-        if (classification.normalBalance === "debit") {
+        if (classification.normalBalance !== "debit") {
           creditBalance = absBalance;
           totalCredits = totalCredits.add(absBalance);
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative asset)
statusReason: expected '0.00' to be '1000.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:460:16
         if (classification.normalBalance === "debit") {
           creditBalance = absBalance;
           totalCredits = totalCredits.add(absBalance);
-        } else {
-          debitBalance = absBalance;
-          totalDebits = totalDebits.add(absBalance);
-        }
+        } else {}
       }
 
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative liability)
statusReason: expected undefined to be '500.00' // Object.is equality

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:467:37
       }
 
       // Only include accounts with activity
-      if (!debitBalance.isZero() || !creditBalance.isZero()) {
+      if (!debitBalance.isZero() || creditBalance.isZero()) {
         entries.push({
           accountId: account.id,
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected { accountId: 'ar', …(4) } to be undefined

[Killed] LogicalOperator
src/ledger/DoubleEntryLedger.ts:467:11
       }
 
       // Only include accounts with activity
-      if (!debitBalance.isZero() || !creditBalance.isZero()) {
+      if (!debitBalance.isZero() && !creditBalance.isZero()) {
         entries.push({
           accountId: account.id,
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:478:12
       }
     }
 
-    return {
-      asOf: asOf ?? new Date(),
-      entries,
-      totalDebits,
-      totalCredits,
-      isBalanced: totalDebits.equals(totalCredits),
-      currency: this.currency,
-    };
+    return {};
   }
 
killedBy: DoubleEntryLedger trial balance generates balanced trial balance
statusReason: expected undefined to be true // Object.is equality

[Survived] LogicalOperator
src/ledger/DoubleEntryLedger.ts:479:13
     }
 
     return {
-      asOf: asOf ?? new Date(),
+      asOf: asOf && new Date(),
       entries,
       totalDebits,

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:491:52
   /**
    * Gets all journal entries (read-only).
    */
-  getJournalEntries(): ReadonlyArray<JournalEntry> {
-    return Object.freeze([...this.journalEntries]);
-  }
+  getJournalEntries(): ReadonlyArray<JournalEntry> {}
 
   /**
killedBy: DoubleEntryLedger voiding entries marks original entry as voided
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ArrayDeclaration
src/ledger/DoubleEntryLedger.ts:492:26
    * Gets all journal entries (read-only).
    */
   getJournalEntries(): ReadonlyArray<JournalEntry> {
-    return Object.freeze([...this.journalEntries]);
+    return Object.freeze([]);
   }
 
killedBy: DoubleEntryLedger voiding entries marks original entry as voided
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:503:21
    * part of the hash integrity check.
    */
   verify(): boolean {
-    for (let i = 0; i < this.journalEntries.length; i++) {
+    for (let i = 0; i >= this.journalEntries.length; i++) {
       const entry = this.journalEntries[i];
       const previousEntry = i > 0 ? this.journalEntries[i - 1] : null;
killedBy: DoubleEntryLedger verification edge cases returns true for empty ledger
statusReason: Cannot read properties of undefined (reading 'previousHash')

[Killed] UpdateOperator
src/ledger/DoubleEntryLedger.ts:503:53
    * part of the hash integrity check.
    */
   verify(): boolean {
-    for (let i = 0; i < this.journalEntries.length; i++) {
+    for (let i = 0; i < this.journalEntries.length; i--) {
       const entry = this.journalEntries[i];
       const previousEntry = i > 0 ? this.journalEntries[i - 1] : null;
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: Cannot read properties of undefined (reading 'previousHash')

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:505:29
   verify(): boolean {
     for (let i = 0; i < this.journalEntries.length; i++) {
       const entry = this.journalEntries[i];
-      const previousEntry = i > 0 ? this.journalEntries[i - 1] : null;
+      const previousEntry = i <= 0 ? this.journalEntries[i - 1] : null;
 
       // Check previous hash pointer
killedBy: DoubleEntryLedger verification edge cases verifies multiple entries in chain
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:505:29
   verify(): boolean {
     for (let i = 0; i < this.journalEntries.length; i++) {
       const entry = this.journalEntries[i];
-      const previousEntry = i > 0 ? this.journalEntries[i - 1] : null;
+      const previousEntry = false ? this.journalEntries[i - 1] : null;
 
       // Check previous hash pointer
killedBy: DoubleEntryLedger verification edge cases verifies multiple entries in chain
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:509:13
 
       // Check previous hash pointer
       if (previousEntry) {
-        if (entry.previousHash !== previousEntry.hash) return false;
+        if (true) return false;
       } else {
         if (entry.previousHash !== null) return false;
killedBy: DoubleEntryLedger verification edge cases verifies multiple entries in chain
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:517:23
       // Check integrity of current entry
       // Reconstruct content as it was when the hash was originally calculated
       // (before any post-creation modifications like voiding)
-      const content = {
-        id: entry.id,
-        entryNumber: entry.entryNumber,
-        lines: entry.lines,
-        metadata: entry.metadata,
-        createdAt: entry.createdAt,
-        previousHash: entry.previousHash,
-        isPosted: true, // Always true at creation time
-        isVoided: entry.voids ? true : false, // Reversing entries have voids set at creation
-      };
+      const content = {};
 
       const calculatedHash = generateHashSync(content);
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:524:19
         metadata: entry.metadata,
         createdAt: entry.createdAt,
         previousHash: entry.previousHash,
-        isPosted: true, // Always true at creation time
+        isPosted: false, // Always true at creation time
         isVoided: entry.voids ? true : false, // Reversing entries have voids set at creation
       };
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:525:40
         createdAt: entry.createdAt,
         previousHash: entry.previousHash,
         isPosted: true, // Always true at creation time
-        isVoided: entry.voids ? true : false, // Reversing entries have voids set at creation
+        isVoided: entry.voids ? true : true, // Reversing entries have voids set at creation
       };
 
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:525:33
         createdAt: entry.createdAt,
         previousHash: entry.previousHash,
         isPosted: true, // Always true at creation time
-        isVoided: entry.voids ? true : false, // Reversing entries have voids set at creation
+        isVoided: entry.voids ? false : false, // Reversing entries have voids set at creation
       };
 

[Killed] EqualityOperator
src/ledger/DoubleEntryLedger.ts:529:11
       };
 
       const calculatedHash = generateHashSync(content);
-      if (entry.hash !== calculatedHash) return false;
+      if (entry.hash === calculatedHash) return false;
     }
     return true;
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:529:11
       };
 
       const calculatedHash = generateHashSync(content);
-      if (entry.hash !== calculatedHash) return false;
+      if (true) return false;
     }
     return true;
killedBy: DoubleEntryLedger verification verifies ledger integrity
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/ledger/DoubleEntryLedger.ts:538:61
    * Creates a snapshot for backup/restore.
    */
   snapshot(): DoubleEntrySnapshot {
-    const accounts = Array.from(this.accounts.values()).map((account) => ({
-      id: account.id,
-      name: account.name,
-      type: account.type,
-      currency: account.currency,
-      description: account.description,
-      parentId: account.parentId,
-      accountNumber: account.accountNumber,
-      isActive: account.isActive,
-      metadata: { ...account.metadata },
-      debits: JSON.stringify(account.getTotalDebits().toJSON()),
-      credits: JSON.stringify(account.getTotalCredits().toJSON()),
-    }));
+    const accounts = Array.from(this.accounts.values()).map(() => undefined);
 
     return {
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:538:75
    * Creates a snapshot for backup/restore.
    */
   snapshot(): DoubleEntrySnapshot {
-    const accounts = Array.from(this.accounts.values()).map((account) => ({
-      id: account.id,
-      name: account.name,
-      type: account.type,
-      currency: account.currency,
-      description: account.description,
-      parentId: account.parentId,
-      accountNumber: account.accountNumber,
-      isActive: account.isActive,
-      metadata: { ...account.metadata },
-      debits: JSON.stringify(account.getTotalDebits().toJSON()),
-      credits: JSON.stringify(account.getTotalCredits().toJSON()),
-    }));
+    const accounts = Array.from(this.accounts.values()).map((account) => ({}));
 
     return {
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:547:17
       parentId: account.parentId,
       accountNumber: account.accountNumber,
       isActive: account.isActive,
-      metadata: { ...account.metadata },
+      metadata: {},
       debits: JSON.stringify(account.getTotalDebits().toJSON()),
       credits: JSON.stringify(account.getTotalCredits().toJSON()),

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:552:12
       credits: JSON.stringify(account.getTotalCredits().toJSON()),
     }));
 
-    return {
-      version: SNAPSHOT_VERSION,
-      accounts,
-      journalEntries: [...this.journalEntries],
-      nextEntryNumber: this.nextEntryNumber,
-      currency: this.currency,
-      createdAt: new Date(),
-      checksum: generateHashSync({
-        accounts,
-        journalEntries: this.journalEntries,
-      }),
-    };
+    return {};
   }
 
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ArrayDeclaration
src/ledger/DoubleEntryLedger.ts:555:23
     return {
       version: SNAPSHOT_VERSION,
       accounts,
-      journalEntries: [...this.journalEntries],
+      journalEntries: [],
       nextEntryNumber: this.nextEntryNumber,
       currency: this.currency,
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:592:11
       const debits = Money.fromMinor(BigInt(debitsData.amount), debitsData.currency);
       const credits = Money.fromMinor(BigInt(creditsData.amount), creditsData.currency);
 
-      if (!debits.isZero()) {
+      if (false) {
         account.debit(debits);
       }
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: expected '0.00' to be '500.00' // Object.is equality

[Killed] BooleanLiteral
src/ledger/DoubleEntryLedger.ts:592:11
       const debits = Money.fromMinor(BigInt(debitsData.amount), debitsData.currency);
       const credits = Money.fromMinor(BigInt(creditsData.amount), creditsData.currency);
 
-      if (!debits.isZero()) {
+      if (debits.isZero()) {
         account.debit(debits);
       }
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: expected '0.00' to be '500.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/DoubleEntryLedger.ts:595:11
       if (!debits.isZero()) {
         account.debit(debits);
       }
-      if (!credits.isZero()) {
+      if (false) {
         account.credit(credits);
       }
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: expected '0.00' to be '500.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:595:30
       if (!debits.isZero()) {
         account.debit(debits);
       }
-      if (!credits.isZero()) {
-        account.credit(credits);
-      }
+      if (!credits.isZero()) {}
 
       ledger.accounts.set(account.id, account);
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: expected '0.00' to be '500.00' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:612:25
   /**
    * Gets the ledger currency.
    */
-  getCurrency(): string {
-    return this.currency;
-  }
+  getCurrency(): string {}
 
   /**
killedBy: DoubleEntryLedger getCurrency returns the ledger currency
statusReason: expected undefined to be 'USD' // Object.is equality

[Killed] BlockStatement
src/ledger/DoubleEntryLedger.ts:624:5
     entryCount: number;
     currency: string;
     isBalanced: boolean;
-  } {
-    const trialBalance = this.getTrialBalance();
-    return {
-      accountCount: this.accounts.size,
-      entryCount: this.journalEntries.length,
-      currency: this.currency,
-      isBalanced: trialBalance.isBalanced,
-    };
-  }
+  } {}
 }
 
killedBy: DoubleEntryLedger getSummary returns ledger summary
statusReason: Cannot read properties of undefined (reading 'accountCount')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:644:5
    */
   smallBusiness: (currency: string): AccountConfig[] => [
     // Assets (1000s)
-    {
-      id: "cash",
-      name: "Cash",
-      type: "asset",
-      currency,
-      accountNumber: "1000",
-    },
+    {},
     {
       id: "bank",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:645:11
   smallBusiness: (currency: string): AccountConfig[] => [
     // Assets (1000s)
     {
-      id: "cash",
+      id: "",
       name: "Cash",
       type: "asset",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:646:13
     // Assets (1000s)
     {
       id: "cash",
-      name: "Cash",
+      name: "",
       type: "asset",
       currency,
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: expected '' to be 'Cash' // Object.is equality

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:652:11
       accountNumber: "1000",
     },
     {
-      id: "bank",
+      id: "",
       name: "Bank Account",
       type: "asset",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:656:22
       name: "Bank Account",
       type: "asset",
       currency,
-      accountNumber: "1010",
+      accountNumber: "",
     },
     {

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:661:13
     {
       id: "accounts-receivable",
       name: "Accounts Receivable",
-      type: "asset",
+      type: "",
       currency,
       accountNumber: "1200",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:663:22
       name: "Accounts Receivable",
       type: "asset",
       currency,
-      accountNumber: "1200",
+      accountNumber: "",
     },
     {

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:670:22
       name: "Inventory",
       type: "asset",
       currency,
-      accountNumber: "1400",
+      accountNumber: "",
     },
     {

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:672:5
       currency,
       accountNumber: "1400",
     },
-    {
-      id: "prepaid-expenses",
-      name: "Prepaid Expenses",
-      type: "asset",
-      currency,
-      accountNumber: "1500",
-    },
+    {},
     {
       id: "equipment",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:673:11
       accountNumber: "1400",
     },
     {
-      id: "prepaid-expenses",
+      id: "",
       name: "Prepaid Expenses",
       type: "asset",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:675:13
     {
       id: "prepaid-expenses",
       name: "Prepaid Expenses",
-      type: "asset",
+      type: "",
       currency,
       accountNumber: "1500",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:684:22
       name: "Equipment",
       type: "asset",
       currency,
-      accountNumber: "1600",
+      accountNumber: "",
     },
     {

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:696:11
 
     // Liabilities (2000s)
     {
-      id: "accounts-payable",
+      id: "",
       name: "Accounts Payable",
       type: "liability",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:700:22
       name: "Accounts Payable",
       type: "liability",
       currency,
-      accountNumber: "2000",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: expected '' to be '2000' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:702:5
       currency,
       accountNumber: "2000",
     },
-    {
-      id: "credit-cards",
-      name: "Credit Cards Payable",
-      type: "liability",
-      currency,
-      accountNumber: "2100",
-    },
+    {},
     {
       id: "payroll-liabilities",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:703:11
       accountNumber: "2000",
     },
     {
-      id: "credit-cards",
+      id: "",
       name: "Credit Cards Payable",
       type: "liability",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:707:22
       name: "Credit Cards Payable",
       type: "liability",
       currency,
-      accountNumber: "2100",
+      accountNumber: "",
     },
     {

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:714:22
       name: "Payroll Liabilities",
       type: "liability",
       currency,
-      accountNumber: "2200",
+      accountNumber: "",
     },
     {

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:719:13
     {
       id: "sales-tax-payable",
       name: "Sales Tax Payable",
-      type: "liability",
+      type: "",
       currency,
       accountNumber: "2300",

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:723:5
       currency,
       accountNumber: "2300",
     },
-    {
-      id: "loans-payable",
-      name: "Loans Payable",
-      type: "liability",
-      currency,
-      accountNumber: "2500",
-    },
+    {},
 
     // Equity (3000s)
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:725:13
     },
     {
       id: "loans-payable",
-      name: "Loans Payable",
+      name: "",
       type: "liability",
       currency,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:726:13
     {
       id: "loans-payable",
       name: "Loans Payable",
-      type: "liability",
+      type: "",
       currency,
       accountNumber: "2500",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:728:22
       name: "Loans Payable",
       type: "liability",
       currency,
-      accountNumber: "2500",
+      accountNumber: "",
     },
 

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:737:22
       name: "Owner's Equity",
       type: "equity",
       currency,
-      accountNumber: "3000",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: expected '' to be '3000' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:739:5
       currency,
       accountNumber: "3000",
     },
-    {
-      id: "retained-earnings",
-      name: "Retained Earnings",
-      type: "equity",
-      currency,
-      accountNumber: "3200",
-    },
+    {},
     {
       id: "owner-draws",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:746:5
       currency,
       accountNumber: "3200",
     },
-    {
-      id: "owner-draws",
-      name: "Owner's Draws",
-      type: "contra-equity",
-      currency,
-      accountNumber: "3300",
-    },
+    {},
 
     // Revenue (4000s)
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:749:13
     {
       id: "owner-draws",
       name: "Owner's Draws",
-      type: "contra-equity",
+      type: "",
       currency,
       accountNumber: "3300",

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:755:5
     },
 
     // Revenue (4000s)
-    {
-      id: "sales-revenue",
-      name: "Sales Revenue",
-      type: "revenue",
-      currency,
-      accountNumber: "4000",
-    },
+    {},
     {
       id: "service-revenue",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:756:11
 
     // Revenue (4000s)
     {
-      id: "sales-revenue",
+      id: "",
       name: "Sales Revenue",
       type: "revenue",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:764:13
     },
     {
       id: "service-revenue",
-      name: "Service Revenue",
+      name: "",
       type: "revenue",
       currency,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:772:13
     {
       id: "other-income",
       name: "Other Income",
-      type: "revenue",
+      type: "",
       currency,
       accountNumber: "4900",
