[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:783:5
       currency,
       accountNumber: "4010",
     },
-    {
-      id: "sales-returns",
-      name: "Sales Returns",
-      type: "contra-revenue",
-      currency,
-      accountNumber: "4020",
-    },
+    {},
 
     // Expenses (5000s-6000s)
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:788:22
       name: "Sales Returns",
       type: "contra-revenue",
       currency,
-      accountNumber: "4020",
+      accountNumber: "",
     },
 

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:793:11
 
     // Expenses (5000s-6000s)
     {
-      id: "cost-of-goods-sold",
+      id: "",
       name: "Cost of Goods Sold",
       type: "expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:797:22
       name: "Cost of Goods Sold",
       type: "expense",
       currency,
-      accountNumber: "5000",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: expected '' to be '5000' // Object.is equality

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:801:13
     },
     {
       id: "wages-expense",
-      name: "Wages Expense",
+      name: "",
       type: "expense",
       currency,

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:811:22
       name: "Rent Expense",
       type: "expense",
       currency,
-      accountNumber: "6100",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: expected '' to be '6100' // Object.is equality

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:814:11
       accountNumber: "6100",
     },
     {
-      id: "utilities-expense",
+      id: "",
       name: "Utilities Expense",
       type: "expense",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:821:11
       accountNumber: "6200",
     },
     {
-      id: "office-supplies",
+      id: "",
       name: "Office Supplies",
       type: "expense",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:825:22
       name: "Office Supplies",
       type: "expense",
       currency,
-      accountNumber: "6300",
+      accountNumber: "",
     },
     {

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:827:5
       currency,
       accountNumber: "6300",
     },
-    {
-      id: "insurance-expense",
-      name: "Insurance Expense",
-      type: "expense",
-      currency,
-      accountNumber: "6400",
-    },
+    {},
     {
       id: "depreciation-expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:828:11
       accountNumber: "6300",
     },
     {
-      id: "insurance-expense",
+      id: "",
       name: "Insurance Expense",
       type: "expense",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:829:13
     },
     {
       id: "insurance-expense",
-      name: "Insurance Expense",
+      name: "",
       type: "expense",
       currency,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:830:13
     {
       id: "insurance-expense",
       name: "Insurance Expense",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "6400",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:836:13
     },
     {
       id: "depreciation-expense",
-      name: "Depreciation Expense",
+      name: "",
       type: "expense",
       currency,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:839:22
       name: "Depreciation Expense",
       type: "expense",
       currency,
-      accountNumber: "6500",
+      accountNumber: "",
     },
     {

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:844:13
     {
       id: "bank-fees",
       name: "Bank Fees",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "6600",

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:848:5
       currency,
       accountNumber: "6600",
     },
-    {
-      id: "professional-services",
-      name: "Professional Services",
-      type: "expense",
-      currency,
-      accountNumber: "6700",
-    },
+    {},
     {
       id: "marketing-expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates small business chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:849:11
       accountNumber: "6600",
     },
     {
-      id: "professional-services",
+      id: "",
       name: "Professional Services",
       type: "expense",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:850:13
     },
     {
       id: "professional-services",
-      name: "Professional Services",
+      name: "",
       type: "expense",
       currency,

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:856:11
       accountNumber: "6700",
     },
     {
-      id: "marketing-expense",
+      id: "",
       name: "Marketing & Advertising",
       type: "expense",

[Survived] StringLiteral
src/ledger/DoubleEntryLedger.ts:858:13
     {
       id: "marketing-expense",
       name: "Marketing & Advertising",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "6800",

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:872:13
     {
       id: "stripe-clearing",
       name: "Stripe Clearing",
-      type: "asset",
+      type: "",
       currency,
       accountNumber: "1020",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: expected '' to be 'asset' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:876:5
       currency,
       accountNumber: "1020",
     },
-    {
-      id: "paypal-clearing",
-      name: "PayPal Clearing",
-      type: "asset",
-      currency,
-      accountNumber: "1021",
-    },
+    {},
     {
       id: "shipping-income",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:885:13
     },
     {
       id: "shipping-income",
-      name: "Shipping Income",
+      name: "",
       type: "revenue",
       currency,
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: expected '' to be 'Shipping Income' // Object.is equality

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:893:13
     {
       id: "payment-processing-fees",
       name: "Payment Processing Fees",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "5100",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: expected '' to be 'expense' // Object.is equality

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:895:22
       name: "Payment Processing Fees",
       type: "expense",
       currency,
-      accountNumber: "5100",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: expected '' to be '5100' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:897:5
       currency,
       accountNumber: "5100",
     },
-    {
-      id: "shipping-expense",
-      name: "Shipping Expense",
-      type: "expense",
-      currency,
-      accountNumber: "5200",
-    },
+    {},
     {
       id: "refunds-expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:904:5
       currency,
       accountNumber: "5200",
     },
-    {
-      id: "refunds-expense",
-      name: "Refunds Expense",
-      type: "expense",
-      currency,
-      accountNumber: "5300",
-    },
+    {},
   ],
 
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:905:11
       accountNumber: "5200",
     },
     {
-      id: "refunds-expense",
+      id: "",
       name: "Refunds Expense",
       type: "expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:909:22
       name: "Refunds Expense",
       type: "expense",
       currency,
-      accountNumber: "5300",
+      accountNumber: "",
     },
   ],
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates ecommerce chart of accounts with correct details
statusReason: expected '' to be '5300' // Object.is equality

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:919:11
   saas: (currency: string): AccountConfig[] => [
     ...ChartOfAccountsTemplates.smallBusiness(currency),
     {
-      id: "deferred-revenue",
+      id: "",
       name: "Deferred Revenue",
       type: "liability",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:923:22
       name: "Deferred Revenue",
       type: "liability",
       currency,
-      accountNumber: "2400",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: expected '' to be '2400' // Object.is equality

[Killed] ObjectLiteral
src/ledger/DoubleEntryLedger.ts:925:5
       currency,
       accountNumber: "2400",
     },
-    {
-      id: "subscription-revenue",
-      name: "Subscription Revenue",
-      type: "revenue",
-      currency,
-      accountNumber: "4000",
-    },
+    {},
     {
       id: "usage-revenue",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:930:22
       name: "Subscription Revenue",
       type: "revenue",
       currency,
-      accountNumber: "4000",
+      accountNumber: "",
     },
     {
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: expected '' to be '4000' // Object.is equality

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:933:11
       accountNumber: "4000",
     },
     {
-      id: "usage-revenue",
+      id: "",
       name: "Usage Revenue",
       type: "revenue",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:940:11
       accountNumber: "4100",
     },
     {
-      id: "hosting-costs",
+      id: "",
       name: "Hosting & Infrastructure",
       type: "expense",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:942:13
     {
       id: "hosting-costs",
       name: "Hosting & Infrastructure",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "5100",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: expected '' to be 'expense' // Object.is equality

[Killed] StringLiteral
src/ledger/DoubleEntryLedger.ts:949:13
     {
       id: "customer-success",
       name: "Customer Success",
-      type: "expense",
+      type: "",
       currency,
       accountNumber: "6900",
killedBy: DoubleEntryLedger ChartOfAccountsTemplates creates SaaS chart of accounts with correct details
statusReason: expected '' to be 'expense' // Object.is equality
