[Killed] BlockStatement
src/errors/InsufficientFundsError.ts:4:33
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class InsufficientFundsError extends MonetraError {
-  constructor(message?: string) {
-    super(
-      message || "Insufficient funds for this operation.",
-      MonetraErrorCode.INSUFFICIENT_FUNDS,
-    );
-  }
+  constructor(message?: string) {}
 }
 
killedBy: InsufficientFundsError should use default message when none provided
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
