[Killed] BlockStatement
src/financial/compound.ts:18:10
 export function futureValue(
   presentValue: Money,
   options: CompoundOptions,
-): Money {
-  const {
-    rate,
-    years,
-    compoundingPerYear = 12,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  const n = compoundingPerYear;
-  const t = years;
-  const multiplier = Math.pow(1 + rate / n, n * t);
-
-  return presentValue.multiply(multiplier, { rounding });
-}
+): Money {}
 
 /**
killedBy: Financial - Compound Interest should calculate future value
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] BlockStatement
src/financial/compound.ts:40:10
 export function presentValue(
   futureVal: Money,
   options: CompoundOptions,
-): Money {
-  const {
-    rate,
-    years,
-    compoundingPerYear = 12,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  const n = compoundingPerYear;
-  const t = years;
-  const divisor = Math.pow(1 + rate / n, n * t);
-
-  return futureVal.divide(divisor, { rounding });
-}
+): Money {}
 
 // Alias for familiarity
killedBy: Financial - Compound Interest should calculate present value
statusReason: Cannot read properties of undefined (reading 'format')
