[Killed] EqualityOperator
src/financial/depreciation.ts:41:7
     rounding = RoundingMode.HALF_EVEN,
   } = options;
 
-  if (cost.currency.code !== salvageValue.currency.code) {
+  if (cost.currency.code === salvageValue.currency.code) {
     throw new CurrencyMismatchError(
       cost.currency.code,
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] BlockStatement
src/financial/depreciation.ts:48:24
     );
   }
 
-  if (usefulLife <= 0) {
-    throw new InvalidArgumentError("Useful life must be positive");
-  }
+  if (usefulLife <= 0) {}
 
   if (salvageValue.greaterThan(cost)) {
killedBy: Financial - Depreciation should throw error for invalid useful life
statusReason: expected [Function] to throw error matching /Useful life must be positive/ but got 'Division by zero'

[Killed] ConditionalExpression
src/financial/depreciation.ts:48:7
     );
   }
 
-  if (usefulLife <= 0) {
+  if (true) {
     throw new InvalidArgumentError("Useful life must be positive");
   }
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: Useful life must be positive

[Killed] StringLiteral
src/financial/depreciation.ts:49:36
   }
 
   if (usefulLife <= 0) {
-    throw new InvalidArgumentError("Useful life must be positive");
+    throw new InvalidArgumentError("");
   }
 
killedBy: Financial - Depreciation should throw error for invalid useful life
statusReason: expected [Function] to throw error matching /Useful life must be positive/ but got ''

[Killed] ConditionalExpression
src/financial/depreciation.ts:72:11
       const bookValue = cost.subtract(totalDepreciation);
 
       // Ensure book value doesn't drop below salvage value
-      if (bookValue.lessThan(salvageValue)) {
+      if (true) {
         return salvageValue;
       }
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '$0.00' to be '$800.00' // Object.is equality

[Killed] ConditionalExpression
src/financial/depreciation.ts:83:26
       let previousBookValue = cost;
       const maxYears = Math.ceil(usefulLife);
 
-      for (let year = 1; year <= maxYears; year++) {
+      for (let year = 1; false; year++) {
         const currentBookValue = result.bookValueAtYear(year);
         const depreciation = previousBookValue.subtract(currentBookValue);
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: expected [] to have a length of 3 but got +0

[Killed] ObjectLiteral
src/financial/depreciation.ts:87:23
         const currentBookValue = result.bookValueAtYear(year);
         const depreciation = previousBookValue.subtract(currentBookValue);
 
-        schedule.push({
-          year,
-          depreciation,
-          bookValue: currentBookValue,
-        });
+        schedule.push({});
 
         previousBookValue = currentBookValue;
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: Cannot read properties of undefined (reading 'format')
