[Killed] BlockStatement
src/financial/investment.ts:15:69
  * @returns The ROI as a decimal (e.g., 0.15 for 15%).
  * @throws {CurrencyMismatchError} If currencies differ.
  */
-export function roi(initialValue: Money, finalValue: Money): number {
-  if (initialValue.currency.code !== finalValue.currency.code) {
-    throw new CurrencyMismatchError(
-      initialValue.currency.code,
-      finalValue.currency.code,
-    );
-  }
-
-  const gain = finalValue.subtract(initialValue);
-  return Number(gain.minor) / Number(initialValue.minor);
-}
+export function roi(initialValue: Money, finalValue: Money): number {}
 
 /**
killedBy: Financial - Investment should calculate ROI
statusReason: expected undefined to be 0.15 // Object.is equality

[Killed] BlockStatement
src/financial/investment.ts:33:10
 export function npv(
   discountRate: number,
   cashFlows: Money[], // First is initial investment (usually negative)
-): Money {
-  if (cashFlows.length === 0) {
-    throw new Error("At least one cash flow required");
-  }
-
-  const currency = cashFlows[0].currency;
-
-  let total = Money.zero(currency);
-
-  for (let i = 0; i < cashFlows.length; i++) {
-    const discountFactor = Math.pow(1 + discountRate, i);
-    const discounted = cashFlows[i].divide(discountFactor, {
-      rounding: RoundingMode.HALF_EVEN,
-    });
-    total = total.add(discounted);
-  }
-
-  return total;
-}
+): Money {}
 
 /**
killedBy: Financial - Investment should calculate NPV
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] BlockStatement
src/financial/investment.ts:99:80
  * @throws {CurrencyMismatchError} If currencies differ.
  * @throws {InvalidArgumentError} If price is zero or negative.
  */
-export function currentYield(annualCoupon: Money, currentPrice: Money): number {
-  if (annualCoupon.currency.code !== currentPrice.currency.code) {
-    throw new CurrencyMismatchError(
-      annualCoupon.currency.code,
-      currentPrice.currency.code,
-    );
-  }
-
-  if (currentPrice.minor <= 0n) {
-    throw new InvalidArgumentError("Current price must be positive");
-  }
-
-  return Number(annualCoupon.minor) / Number(currentPrice.minor);
-}
+export function currentYield(annualCoupon: Money, currentPrice: Money): number {}
 
killedBy: Financial - Investment should calculate current yield for bond at par
statusReason: expected undefined to be 0.05 // Object.is equality

[Killed] BlockStatement
src/financial/investment.ts:100:66
  * @throws {InvalidArgumentError} If price is zero or negative.
  */
 export function currentYield(annualCoupon: Money, currentPrice: Money): number {
-  if (annualCoupon.currency.code !== currentPrice.currency.code) {
-    throw new CurrencyMismatchError(
-      annualCoupon.currency.code,
-      currentPrice.currency.code,
-    );
-  }
+  if (annualCoupon.currency.code !== currentPrice.currency.code) {}
 
   if (currentPrice.minor <= 0n) {
killedBy: Financial - Investment should throw error for currency mismatch in current yield
statusReason: expected [Function] to throw an error
