[Killed] BlockStatement
src/financial/leverage.ts:87:11
 export function equityMultiplier(
   totalAssets: Money,
   totalEquity: Money,
-): number {
-  assertSameCurrency(totalAssets, totalEquity);
-  if (totalEquity.isZero()) {
-    throw new Error("Total equity cannot be zero");
-  }
-  return Number(totalAssets.minor) / Number(totalEquity.minor);
-}
+): number {}
 
 /**
killedBy: Financial - Leverage Ratios should calculate Equity Multiplier correctly
statusReason: expected undefined to be 3 // Object.is equality
