[Killed] BlockStatement
src/financial/simple.ts:40:10
 export function simpleInterest(
   principal: Money,
   options: SimpleInterestOptions,
-): Money {
-  const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
-
-  // Handle edge cases
-  if (rate.isZero() || years === 0) {
-    return Money.zero(principal.currency);
-  }
-
-  // Simple Interest = Principal × Rate × Time
-  const interestMultiplier = rate.toDecimal() * years;
-
-  return principal.multiply(interestMultiplier, { rounding });
-}
+): Money {}
 
 /**
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] BlockStatement
src/financial/simple.ts:81:10
 export function simpleInterestTotal(
   principal: Money,
   options: SimpleInterestOptions,
-): Money {
-  const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
-
-  // Handle edge cases
-  if (rate.isZero() || years === 0) {
-    return principal;
-  }
-
-  // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + rate.toDecimal() * years;
-
-  return principal.multiply(totalMultiplier, { rounding });
-}
+): Money {}
 
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] LogicalOperator
src/financial/simple.ts:85:7
   const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
 
   // Handle edge cases
-  if (rate.isZero() || years === 0) {
+  if (rate.isZero() && years === 0) {
     return principal;
   }
killedBy: Financial - Simple Interest Edge Cases simpleInterestTotal returns exactly principal for zero rate (not computed)
statusReason: expected Money{ minor: 100000n, …(1) } to be Money{ minor: 100000n, …(1) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Money{ minor: 100000n, …(1) }
Received: serializes to the same string

[Killed] ConditionalExpression
src/financial/simple.ts:85:24
   const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
 
   // Handle edge cases
-  if (rate.isZero() || years === 0) {
+  if (rate.isZero() || false) {
     return principal;
   }
killedBy: Financial - Simple Interest Edge Cases simpleInterestTotal returns exactly principal for zero years (not computed)
statusReason: expected Money{ minor: 100000n, …(1) } to be Money{ minor: 100000n, …(1) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Money{ minor: 100000n, …(1) }
Received: serializes to the same string

[Killed] ArithmeticOperator
src/financial/simple.ts:90:31
   }
 
   // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + rate.toDecimal() * years;
+  const totalMultiplier = 1 + rate.toDecimal() / years;
 
   return principal.multiply(totalMultiplier, { rounding });
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: expected '$1,025.00' to be '$1,100.00' // Object.is equality

[Killed] ArithmeticOperator
src/financial/simple.ts:90:27
   }
 
   // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + rate.toDecimal() * years;
+  const totalMultiplier = 1 - rate.toDecimal() * years;
 
   return principal.multiply(totalMultiplier, { rounding });
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: expected '$900.00' to be '$1,100.00' // Object.is equality
