[Killed] BlockStatement
src/format/parser.ts:52:44
 
   // Handle the case where group and decimal separators are the same
   // (shouldn't happen, but be defensive)
-  if (groupSeparator === decimalSeparator) {
-    throw new Error(
-      `Invalid locale configuration: group and decimal separators are the same for locale ${options.locale}`,
-    );
-  }
+  if (groupSeparator === decimalSeparator) {}
 
   // Remove currency symbols and whitespace
killedBy: Parser should throw when Intl reports invalid locale separators (defensive)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/format/parser.ts:91:11
   amount: string,
   currency: Currency,
   options: LocaleParseOptions,
-): bigint {
-  const normalized = parseLocaleString(amount, options);
-  return parseToMinor(normalized, currency);
-}
+): bigint {}
 
 /**
killedBy: Parser should parse valid money strings
statusReason: expected undefined to be 123456n // Object.is equality

[Killed] BlockStatement
src/format/parser.ts:133:50
   const integerPart = parts[0];
   const fractionalPart = parts[1] || "";
 
-  if (fractionalPart.length > currency.decimals) {
-    throw new InvalidPrecisionError(
-      `Precision ${fractionalPart.length} exceeds currency decimals ${currency.decimals}`,
-    );
-  }
+  if (fractionalPart.length > currency.decimals) {}
 
   // Pad fractional part
killedBy: Parser should reject precision exceeding currency decimals
statusReason: expected function to throw an error, but it didn't
