[Killed] BlockStatement
src/ledger/Account.ts:92:38
   private debits: Money;
   private credits: Money;
 
-  constructor(config: AccountConfig) {
-    this.id = config.id;
-    this.name = config.name;
-    this.type = config.type;
-    this.currency =
-      typeof config.currency === "string"
-        ? config.currency
-        : config.currency.code;
-    this.description = config.description;
-    this.parentId = config.parentId;
-    this.accountNumber = config.accountNumber;
-    this.isActive = config.isActive ?? true;
-    this.metadata = Object.freeze({ ...config.metadata });
-    this.createdAt = new Date();
-
-    // Initialize with zero balances
-    this.debits = Money.zero(this.currency);
-    this.credits = Money.zero(this.currency);
-  }
+  constructor(config: AccountConfig) {}
 
   /**
killedBy: DoubleEntryLedger account management creates an account
statusReason: expected undefined to be 'cash' // Object.is equality

[Killed] ConditionalExpression
src/ledger/Account.ts:97:7
     this.name = config.name;
     this.type = config.type;
     this.currency =
-      typeof config.currency === "string"
+      false
         ? config.currency
         : config.currency.code;
killedBy: DoubleEntryLedger snapshot and restore creates and restores from snapshot
statusReason: Currency mismatch: Account "Cash" uses undefined, but received USD

[Killed] ConditionalExpression
src/ledger/Account.ts:97:7
     this.name = config.name;
     this.type = config.type;
     this.currency =
-      typeof config.currency === "string"
+      true
         ? config.currency
         : config.currency.code;
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: Currency mismatch: Account "Cash" uses [object Object], but received USD

[Killed] BooleanLiteral
src/ledger/Account.ts:103:40
     this.description = config.description;
     this.parentId = config.parentId;
     this.accountNumber = config.accountNumber;
-    this.isActive = config.isActive ?? true;
+    this.isActive = config.isActive ?? false;
     this.metadata = Object.freeze({ ...config.metadata });
     this.createdAt = new Date();
killedBy: DoubleEntryLedger trial balance includes only active accounts with activity
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/ledger/Account.ts:103:21
     this.description = config.description;
     this.parentId = config.parentId;
     this.accountNumber = config.accountNumber;
-    this.isActive = config.isActive ?? true;
+    this.isActive = config.isActive && true;
     this.metadata = Object.freeze({ ...config.metadata });
     this.createdAt = new Date();
killedBy: Account creation creates an account with required fields
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:115:46
   /**
    * Gets the classification of this account type.
    */
-  getClassification(): AccountClassification {
-    return Account.getClassificationForType(this.type);
-  }
+  getClassification(): AccountClassification {}
 
   /**
killedBy: Account account classifications classifies asset correctly
statusReason: Cannot read properties of undefined (reading 'statement')

[Killed] ConditionalExpression
src/ledger/Account.ts:124:7
    */
   static getClassificationForType(type: AccountType): AccountClassification {
     switch (type) {
-      case "asset":
-        return {
-          statement: "balance-sheet",
-          category: "assets",
-          normalBalance: "debit",
-        };
+      case "asset":
       case "contra-asset":
         return {
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] ObjectLiteral
src/ledger/Account.ts:125:16
   static getClassificationForType(type: AccountType): AccountClassification {
     switch (type) {
       case "asset":
-        return {
-          statement: "balance-sheet",
-          category: "assets",
-          normalBalance: "debit",
-        };
+        return {};
       case "contra-asset":
         return {
killedBy: Account account classifications classifies asset correctly
statusReason: expected undefined to be 'balance-sheet' // Object.is equality

[Survived] ConditionalExpression
src/ledger/Account.ts:130:7
           category: "assets",
           normalBalance: "debit",
         };
-      case "contra-asset":
-        return {
-          statement: "balance-sheet",
-          category: "assets",
-          normalBalance: "credit",
-        };
+      case "contra-asset":
       case "liability":
         return {

[Killed] ConditionalExpression
src/ledger/Account.ts:136:7
           category: "assets",
           normalBalance: "credit",
         };
-      case "liability":
-        return {
-          statement: "balance-sheet",
-          category: "liabilities",
-          normalBalance: "credit",
-        };
+      case "liability":
       case "contra-liability":
         return {
killedBy: Account account classifications classifies liability correctly
statusReason: expected 'debit' to be 'credit' // Object.is equality

[Killed] StringLiteral
src/ledger/Account.ts:136:12
           category: "assets",
           normalBalance: "credit",
         };
-      case "liability":
+      case "":
         return {
           statement: "balance-sheet",
killedBy: DoubleEntryLedger trial balance edge cases handles contra balances (negative liability)
statusReason: Cannot read properties of undefined (reading 'normalBalance')

[Killed] ObjectLiteral
src/ledger/Account.ts:137:16
           normalBalance: "credit",
         };
       case "liability":
-        return {
-          statement: "balance-sheet",
-          category: "liabilities",
-          normalBalance: "credit",
-        };
+        return {};
       case "contra-liability":
         return {
killedBy: Account account classifications classifies liability correctly
statusReason: expected undefined to be 'balance-sheet' // Object.is equality

[Killed] ConditionalExpression
src/ledger/Account.ts:142:7
           category: "liabilities",
           normalBalance: "credit",
         };
-      case "contra-liability":
-        return {
-          statement: "balance-sheet",
-          category: "liabilities",
-          normalBalance: "debit",
-        };
+      case "contra-liability":
       case "equity":
         return {
killedBy: Account account classifications classifies contra-liability correctly
statusReason: expected 'credit' to be 'debit' // Object.is equality

[Killed] StringLiteral
src/ledger/Account.ts:142:12
           category: "liabilities",
           normalBalance: "credit",
         };
-      case "contra-liability":
+      case "":
         return {
           statement: "balance-sheet",
killedBy: Account account classifications classifies contra-liability correctly
statusReason: Cannot read properties of undefined (reading 'statement')

[Killed] StringLiteral
src/ledger/Account.ts:144:22
         };
       case "contra-liability":
         return {
-          statement: "balance-sheet",
+          statement: "",
           category: "liabilities",
           normalBalance: "debit",
killedBy: Account account classifications classifies contra-liability correctly
statusReason: expected '' to be 'balance-sheet' // Object.is equality

[Survived] StringLiteral
src/ledger/Account.ts:145:21
       case "contra-liability":
         return {
           statement: "balance-sheet",
-          category: "liabilities",
+          category: "",
           normalBalance: "debit",
         };

[Killed] ConditionalExpression
src/ledger/Account.ts:148:7
           category: "liabilities",
           normalBalance: "debit",
         };
-      case "equity":
-        return {
-          statement: "balance-sheet",
-          category: "equity",
-          normalBalance: "credit",
-        };
+      case "equity":
       case "contra-equity":
         return {
killedBy: Account account classifications classifies equity correctly
statusReason: expected 'debit' to be 'credit' // Object.is equality

[Killed] StringLiteral
src/ledger/Account.ts:148:12
           category: "liabilities",
           normalBalance: "debit",
         };
-      case "equity":
+      case "":
         return {
           statement: "balance-sheet",
killedBy: Account account classifications classifies equity correctly
statusReason: Cannot read properties of undefined (reading 'statement')

[Killed] ObjectLiteral
src/ledger/Account.ts:149:16
           normalBalance: "debit",
         };
       case "equity":
-        return {
-          statement: "balance-sheet",
-          category: "equity",
-          normalBalance: "credit",
-        };
+        return {};
       case "contra-equity":
         return {
killedBy: Account account classifications classifies equity correctly
statusReason: expected undefined to be 'balance-sheet' // Object.is equality

[Survived] StringLiteral
src/ledger/Account.ts:151:21
       case "equity":
         return {
           statement: "balance-sheet",
-          category: "equity",
+          category: "",
           normalBalance: "credit",
         };

[Killed] ConditionalExpression
src/ledger/Account.ts:154:7
           category: "equity",
           normalBalance: "credit",
         };
-      case "contra-equity":
-        return {
-          statement: "balance-sheet",
-          category: "equity",
-          normalBalance: "debit",
-        };
+      case "contra-equity":
       case "revenue":
         return {
killedBy: Account account classifications classifies contra-equity correctly
statusReason: expected 'income-statement' to be 'balance-sheet' // Object.is equality

[Killed] ObjectLiteral
src/ledger/Account.ts:155:16
           normalBalance: "credit",
         };
       case "contra-equity":
-        return {
-          statement: "balance-sheet",
-          category: "equity",
-          normalBalance: "debit",
-        };
+        return {};
       case "revenue":
         return {
killedBy: Account account classifications classifies contra-equity correctly
statusReason: expected undefined to be 'balance-sheet' // Object.is equality

[Killed] ConditionalExpression
src/ledger/Account.ts:160:7
           category: "equity",
           normalBalance: "debit",
         };
-      case "revenue":
-        return {
-          statement: "income-statement",
-          category: "revenue",
-          normalBalance: "credit",
-        };
+      case "revenue":
       case "contra-revenue":
         return {
killedBy: Account account classifications classifies revenue correctly
statusReason: expected 'debit' to be 'credit' // Object.is equality

[Killed] StringLiteral
src/ledger/Account.ts:160:12
           category: "equity",
           normalBalance: "debit",
         };
-      case "revenue":
+      case "":
         return {
           statement: "income-statement",
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: Cannot read properties of undefined (reading 'normalBalance')

[Killed] ObjectLiteral
src/ledger/Account.ts:161:16
           normalBalance: "debit",
         };
       case "revenue":
-        return {
-          statement: "income-statement",
-          category: "revenue",
-          normalBalance: "credit",
-        };
+        return {};
       case "contra-revenue":
         return {
killedBy: Account account classifications classifies revenue correctly
statusReason: expected undefined to be 'income-statement' // Object.is equality

[Killed] StringLiteral
src/ledger/Account.ts:162:22
         };
       case "revenue":
         return {
-          statement: "income-statement",
+          statement: "",
           category: "revenue",
           normalBalance: "credit",
killedBy: Account account classifications classifies revenue correctly
statusReason: expected '' to be 'income-statement' // Object.is equality

[Survived] StringLiteral
src/ledger/Account.ts:163:21
       case "revenue":
         return {
           statement: "income-statement",
-          category: "revenue",
+          category: "",
           normalBalance: "credit",
         };

[Killed] StringLiteral
src/ledger/Account.ts:164:26
         return {
           statement: "income-statement",
           category: "revenue",
-          normalBalance: "credit",
+          normalBalance: "",
         };
       case "contra-revenue":
killedBy: Account account classifications classifies revenue correctly
statusReason: expected '' to be 'credit' // Object.is equality

[Survived] ConditionalExpression
src/ledger/Account.ts:166:7
           category: "revenue",
           normalBalance: "credit",
         };
-      case "contra-revenue":
-        return {
-          statement: "income-statement",
-          category: "revenue",
-          normalBalance: "debit",
-        };
+      case "contra-revenue":
       case "expense":
         return {

[Killed] StringLiteral
src/ledger/Account.ts:166:12
           category: "revenue",
           normalBalance: "credit",
         };
-      case "contra-revenue":
+      case "":
         return {
           statement: "income-statement",
killedBy: Account account classifications classifies contra-revenue correctly
statusReason: Cannot read properties of undefined (reading 'statement')

[Killed] ConditionalExpression
src/ledger/Account.ts:172:7
           category: "revenue",
           normalBalance: "debit",
         };
-      case "expense":
-        return {
-          statement: "income-statement",
-          category: "expenses",
-          normalBalance: "debit",
-        };
+      case "expense":
       case "contra-expense":
         return {
killedBy: Account account classifications classifies expense correctly
statusReason: expected 'credit' to be 'debit' // Object.is equality

[Survived] StringLiteral
src/ledger/Account.ts:175:21
       case "expense":
         return {
           statement: "income-statement",
-          category: "expenses",
+          category: "",
           normalBalance: "debit",
         };

[Killed] ConditionalExpression
src/ledger/Account.ts:178:7
           category: "expenses",
           normalBalance: "debit",
         };
-      case "contra-expense":
-        return {
-          statement: "income-statement",
-          category: "expenses",
-          normalBalance: "credit",
-        };
+      case "contra-expense":
     }
   }
killedBy: Account account classifications classifies contra-expense correctly
statusReason: Cannot read properties of undefined (reading 'statement')

[Killed] BlockStatement
src/ledger/Account.ts:190:33
   /**
    * Returns whether this account increases with debits.
    */
-  increasesWithDebit(): boolean {
-    return this.getClassification().normalBalance === "debit";
-  }
+  increasesWithDebit(): boolean {}
 
   /**
killedBy: Account debits and credits asset accounts increase with debits
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] ConditionalExpression
src/ledger/Account.ts:191:12
    * Returns whether this account increases with debits.
    */
   increasesWithDebit(): boolean {
-    return this.getClassification().normalBalance === "debit";
+    return true;
   }
 
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] EqualityOperator
src/ledger/Account.ts:191:12
    * Returns whether this account increases with debits.
    */
   increasesWithDebit(): boolean {
-    return this.getClassification().normalBalance === "debit";
+    return this.getClassification().normalBalance !== "debit";
   }
 
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:198:30
    * Records a debit to this account.
    * @internal Used by DoubleEntryLedger - not meant for direct use.
    */
-  debit(amount: Money): void {
-    this.validateCurrency(amount);
-    this.debits = this.debits.add(amount);
-  }
+  debit(amount: Money): void {}
 
   /**
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '0.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:207:31
    * Records a credit to this account.
    * @internal Used by DoubleEntryLedger - not meant for direct use.
    */
-  credit(amount: Money): void {
-    this.validateCurrency(amount);
-    this.credits = this.credits.add(amount);
-  }
+  credit(amount: Money): void {}
 
   /**
killedBy: Account debits and credits asset accounts increase with debits
statusReason: expected '100.00' to be '70.00' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:224:23
    * A positive balance means the account is in its natural state.
    * A negative balance indicates a contra position.
    */
-  getBalance(): Money {
-    if (this.increasesWithDebit()) {
-      return this.debits.subtract(this.credits);
-    }
-    return this.credits.subtract(this.debits);
-  }
+  getBalance(): Money {}
 
   /**
killedBy: Account debits and credits asset accounts increase with debits
statusReason: Cannot read properties of undefined (reading 'toDecimalString')

[Killed] ConditionalExpression
src/ledger/Account.ts:225:9
    * A negative balance indicates a contra position.
    */
   getBalance(): Money {
-    if (this.increasesWithDebit()) {
+    if (true) {
       return this.debits.subtract(this.credits);
     }
killedBy: DoubleEntryLedger journal entry posting updates account balances correctly
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:225:36
    * A negative balance indicates a contra position.
    */
   getBalance(): Money {
-    if (this.increasesWithDebit()) {
-      return this.debits.subtract(this.credits);
-    }
+    if (this.increasesWithDebit()) {}
     return this.credits.subtract(this.debits);
   }
killedBy: Account debits and credits asset accounts increase with debits
statusReason: expected '-100.00' to be '100.00' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:234:27
   /**
    * Gets total debits posted to this account.
    */
-  getTotalDebits(): Money {
-    return this.debits;
-  }
+  getTotalDebits(): Money {}
 
   /**
killedBy: Account debits and credits tracks total debits and credits separately
statusReason: Cannot read properties of undefined (reading 'toDecimalString')

[Killed] BlockStatement
src/ledger/Account.ts:241:28
   /**
    * Gets total credits posted to this account.
    */
-  getTotalCredits(): Money {
-    return this.credits;
-  }
+  getTotalCredits(): Money {}
 
   /**
killedBy: Account debits and credits tracks total debits and credits separately
statusReason: Cannot read properties of undefined (reading 'toDecimalString')

[Killed] BlockStatement
src/ledger/Account.ts:256:5
     debits: Money;
     credits: Money;
     isActive: boolean;
-  } {
-    return {
-      id: this.id,
-      name: this.name,
-      type: this.type,
-      balance: this.getBalance(),
-      debits: this.debits,
-      credits: this.credits,
-      isActive: this.isActive,
-    };
-  }
+  } {}
 
   private validateCurrency(amount: Money): void {
killedBy: Account toSummary returns a complete summary object
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/ledger/Account.ts:257:12
     credits: Money;
     isActive: boolean;
   } {
-    return {
-      id: this.id,
-      name: this.name,
-      type: this.type,
-      balance: this.getBalance(),
-      debits: this.debits,
-      credits: this.credits,
-      isActive: this.isActive,
-    };
+    return {};
   }
 
killedBy: Account toSummary returns a complete summary object
statusReason: expected undefined to be 'cash' // Object.is equality

[Killed] BlockStatement
src/ledger/Account.ts:268:49
     };
   }
 
-  private validateCurrency(amount: Money): void {
-    if (amount.currency.code !== this.currency) {
-      throw new Error(
-        `Currency mismatch: Account "${this.name}" uses ${this.currency}, ` +
-          `but received ${amount.currency.code}`,
-      );
-    }
-  }
+  private validateCurrency(amount: Money): void {}
 }
 
killedBy: Account debits and credits throws on currency mismatch
statusReason: expected [Function] to throw error including 'Account "Cash" uses USD, but received…' but got 'Currency mismatch: expected USD, rece…'

[Killed] BlockStatement
src/ledger/Account.ts:269:49
   }
 
   private validateCurrency(amount: Money): void {
-    if (amount.currency.code !== this.currency) {
-      throw new Error(
-        `Currency mismatch: Account "${this.name}" uses ${this.currency}, ` +
-          `but received ${amount.currency.code}`,
-      );
-    }
+    if (amount.currency.code !== this.currency) {}
   }
 }
killedBy: Account debits and credits throws on currency mismatch
statusReason: expected [Function] to throw error including 'Account "Cash" uses USD, but received…' but got 'Currency mismatch: expected USD, rece…'

[Killed] ConditionalExpression
src/ledger/Account.ts:269:9
   }
 
   private validateCurrency(amount: Money): void {
-    if (amount.currency.code !== this.currency) {
+    if (true) {
       throw new Error(
         `Currency mismatch: Account "${this.name}" uses ${this.currency}, ` +
killedBy: Account debits and credits asset accounts increase with debits
statusReason: Currency mismatch: Account "Cash" uses USD, but received USD
