[Killed] BlockStatement
src/ledger/Ledger.ts:80:48
     money: Money,
     metadata: TransactionMetadata,
   ): Promise<Entry> {
-    if (money.currency.code !== this.currency) {
-      throw new CurrencyMismatchError(this.currency, money.currency.code);
-    }
+    if (money.currency.code !== this.currency) {}
 
     const previousHash =
killedBy: Ledger should throw on currency mismatch (async)
statusReason: promise resolved "{ …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/ledger/Ledger.ts:80:9
     money: Money,
     metadata: TransactionMetadata,
   ): Promise<Entry> {
-    if (money.currency.code !== this.currency) {
+    if (false) {
       throw new CurrencyMismatchError(this.currency, money.currency.code);
     }
killedBy: Ledger should throw on currency mismatch (async)
statusReason: promise resolved "{ …(6) }" instead of rejecting

[Killed] ObjectLiteral
src/ledger/Ledger.ts:92:31
     const content = {
       id: randomUUID(),
       money,
-      metadata: Object.freeze({
-        ...metadata,
-        timestamp: metadata.timestamp ?? new Date(),
-      }),
+      metadata: Object.freeze({}),
       createdAt: new Date(),
       previousHash,
killedBy: Ledger should preserve metadata in async record
statusReason: expected undefined to be 'deposit' // Object.is equality

[Killed] ObjectLiteral
src/ledger/Ledger.ts:102:26
 
     const hash = await generateHash(content);
 
-    const entry: Entry = {
-      ...content,
-      hash,
-    };
+    const entry: Entry = {};
 
     this.entries.push(Object.freeze(entry));
killedBy: Ledger should verify asynchronously
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:115:23
   /**
    * Gets the current balance.
    */
-  getBalance(): Money {
-    return this.entries.reduce(
-      (balance, entry) => balance.add(entry.money),
-      Money.zero(this.currency),
-    );
-  }
+  getBalance(): Money {}
 
   /**
killedBy: Ledger should record transactions
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/ledger/Ledger.ts:140:15
     minAmount?: Money;
     maxAmount?: Money;
     tags?: string[];
-  }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
-  }
+  }): Entry[] {}
 
   /**
killedBy: Ledger should filter queries
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/ledger/Ledger.ts:141:12
     maxAmount?: Money;
     tags?: string[];
   }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
+    return this.entries;
   }
 
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:141:43
     maxAmount?: Money;
     tags?: string[];
   }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
+    return this.entries.filter((entry) => {});
   }
 
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:142:24
     tags?: string[];
   }): Entry[] {
     return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
+      if (filter.type) {}
       if (filter.from && entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:146:64
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
       }
-      if (filter.from && entry.createdAt < filter.from) return false;
+      if (filter.from && entry.createdAt < filter.from) return true;
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:146:11
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
       }
-      if (filter.from && entry.createdAt < filter.from) return false;
+      if (false) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/ledger/Ledger.ts:147:24
         if (!types.includes(entry.metadata.type)) return false;
       }
       if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
+      if (filter.to && entry.createdAt <= filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
killedBy: Ledger should filter queries
statusReason: expected 'r2' to be 'r1' // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:148:11
       }
       if (filter.from && entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
+      if (true)
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:152:11
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
         return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
+      if (true)
         return false;
       if (filter.tags && entry.metadata.tags) {
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:154:47
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
-        );
-        if (!hasTag) return false;
-      }
+      if (filter.tags && entry.metadata.tags) {}
       return true;
     });
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:154:11
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
-      if (filter.tags && entry.metadata.tags) {
+      if (true) {
         const hasTag = filter.tags.some((tag) =>
           entry.metadata.tags?.includes(tag),
killedBy: Ledger should filter queries
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
src/ledger/Ledger.ts:155:41
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
       if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
+        const hasTag = filter.tags.some(() => undefined,
         );
         if (!hasTag) return false;
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/ledger/Ledger.ts:155:24
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
       if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
-        );
+        const hasTag = filter.tags.every(tag => entry.metadata.tags?.includes(tag));
         if (!hasTag) return false;
       }
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Survived] OptionalChaining
src/ledger/Ledger.ts:156:11
         return false;
       if (filter.tags && entry.metadata.tags) {
         const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag),
+          entry.metadata.tags.includes(tag),
         );
         if (!hasTag) return false;

[Killed] ConditionalExpression
src/ledger/Ledger.ts:158:13
         const hasTag = filter.tags.some((tag) =>
           entry.metadata.tags?.includes(tag),
         );
-        if (!hasTag) return false;
+        if (false) return false;
       }
       return true;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/ledger/Ledger.ts:201:16
     const checksum = await generateHash({ entries: this.entries });
     return {
       version: SNAPSHOT_VERSION,
-      entries: [...this.entries],
+      entries: [],
       balance: this.getBalance(),
       currency: this.currency,
killedBy: Ledger should snapshot and restore (async)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:215:9
   static fromSnapshot(snapshot: LedgerSnapshot): Ledger {
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
-    if (!verifyChainSync(snapshot.entries)) {
+    if (false) {
       throw new Error("Ledger snapshot integrity check failed");
     }
killedBy: Ledger fromSnapshot should throw on invalid snapshot chain
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/ledger/Ledger.ts:229:9
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
     const isValid = await verifyChain(snapshot.entries);
-    if (!isValid) {
+    if (false) {
       throw new Error("Ledger snapshot integrity check failed");
     }
killedBy: Ledger fromSnapshotAsync should throw on invalid snapshot chain
statusReason: promise resolved "Ledger{ entries: [ { …(6) } ], …(1) }" instead of rejecting
