[Killed] BlockStatement
src/ledger/verification.ts:42:5
     typeof globalThis !== "undefined" &&
     globalThis.crypto &&
     globalThis.crypto.subtle
-  ) {
-    hashFunction = async (data: string): Promise<string> => {
-      const encoder = new TextEncoder();
-      const dataBuffer = encoder.encode(data);
-      const hashBuffer = await globalThis.crypto.subtle.digest(
-        "SHA-256",
-        dataBuffer,
-      );
-      const hashArray = Array.from(new Uint8Array(hashBuffer));
-      return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
-    };
-    return hashFunction;
-  }
+  ) {}
 
   // No crypto available
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: No cryptographic hash function available. Ensure you are running in Node.js or a browser with SubtleCrypto support.

[Killed] BlockStatement
src/ledger/verification.ts:43:61
     globalThis.crypto &&
     globalThis.crypto.subtle
   ) {
-    hashFunction = async (data: string): Promise<string> => {
-      const encoder = new TextEncoder();
-      const dataBuffer = encoder.encode(data);
-      const hashBuffer = await globalThis.crypto.subtle.digest(
-        "SHA-256",
-        dataBuffer,
-      );
-      const hashArray = Array.from(new Uint8Array(hashBuffer));
-      return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
-    };
+    hashFunction = async (data: string): Promise<string> => {};
     return hashFunction;
   }
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] StringLiteral
src/ledger/verification.ts:59:7
   // No crypto available
   throw new Error(
     "No cryptographic hash function available. " +
-      "Ensure you are running in Node.js or a browser with SubtleCrypto support.",
+      "",
   );
 }
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw error matching /No cryptographic hash function availa…/ but got 'No cryptographic hash function availa…'

[Killed] BlockStatement
src/ledger/verification.ts:68:9
  */
 export function setHashFunction(
   fn: (data: string) => string | Promise<string>,
-): void {
-  hashFunction = fn;
-}
+): void {}
 
 function serialize(data: unknown): string {
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: expected '015abd7f5cc57a2dd94b7590f04ad80842739…' to be 'HASH:{"a":1}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:113:57
  * @param data - The data to hash.
  * @returns The hash as a hex string.
  */
-export function generateHashSync(data: unknown): string {
-  const result = generateHash(data);
-  if (result instanceof Promise) {
-    throw new Error(
-      "Synchronous hashing not available in this environment. " +
-        "Use generateHash() with await instead.",
-    );
-  }
-  return result;
-}
+export function generateHashSync(data: unknown): string {}
 
 /**
killedBy: DoubleEntryLedger journal entry posting posts a balanced journal entry
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ledger/verification.ts:115:34
  */
 export function generateHashSync(data: unknown): string {
   const result = generateHash(data);
-  if (result instanceof Promise) {
-    throw new Error(
-      "Synchronous hashing not available in this environment. " +
-        "Use generateHash() with await instead.",
-    );
-  }
+  if (result instanceof Promise) {}
   return result;
 }
killedBy: Ledger Verification generateHashSync should throw when only async hashing is available
statusReason: expected [Function] to throw an error
