[Killed] BlockStatement
src/money/Converter.ts:49:57
     const fromRate = this.rates[money.currency.code];
     const toRate = this.rates[targetCurrency.code];
 
-    if (fromRate === undefined || toRate === undefined) {
-      throw new Error(
-        `Exchange rate missing for conversion from ${money.currency.code} to ${targetCurrency.code}`,
-      );
-    }
+    if (fromRate === undefined || toRate === undefined) {}
 
     // Calculate the exchange rate ratio
killedBy: Converter should throw error when exchange rate is missing
statusReason: expected [Function] to throw error including 'Exchange rate missing for conversion …' but got 'Cannot convert NaN to a BigInt'
