[Killed] BlockStatement
src/money/Money.ts:115:12
       rounding?: RoundingMode;
       suppressWarning?: boolean;
     },
-  ): Money {
-    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
-      console.warn(
-        "[monetra] Money.fromFloat() may lose precision. " +
-          'Consider using Money.fromMajor("' +
-          amount +
-          '", currency) instead.',
-      );
-    }
-    const resolvedCurrency = Money.resolveCurrency(currency);
-    const factor = 10 ** resolvedCurrency.decimals;
-    const minorUnits = Math.round(amount * factor);
-    return new Money(BigInt(minorUnits), resolvedCurrency);
-  }
+  ): Money {}
 
   /**
killedBy: Money Utilities fromFloat should create from float
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:116:77
       suppressWarning?: boolean;
     },
   ): Money {
-    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
-      console.warn(
-        "[monetra] Money.fromFloat() may lose precision. " +
-          'Consider using Money.fromMajor("' +
-          amount +
-          '", currency) instead.',
-      );
-    }
+    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {}
     const resolvedCurrency = Money.resolveCurrency(currency);
     const factor = 10 ** resolvedCurrency.decimals;
killedBy: Money should create from float and optionally warn
statusReason: expected "warn" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/money/Money.ts:118:9
   ): Money {
     if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
       console.warn(
-        "[monetra] Money.fromFloat() may lose precision. " +
+        "" +
           'Consider using Money.fromMajor("' +
           amount +
killedBy: Money Utilities fromFloat should warn about precision by default
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st warn call:

  [
-   StringContaining "may lose precision",

[Survived] StringLiteral
src/money/Money.ts:121:11
         "[monetra] Money.fromFloat() may lose precision. " +
           'Consider using Money.fromMajor("' +
           amount +
-          '", currency) instead.',
+          "",
       );
     }

[Killed] BlockStatement
src/money/Money.ts:217:12
   multiply(
     multiplier: string | number,
     options?: { rounding?: RoundingMode },
-  ): Money {
-    const result = multiply(this.minor, multiplier, options?.rounding);
-    return new Money(result, this.currency);
-  }
+  ): Money {}
 
   /**
killedBy: Money should multiply with rounding
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:234:12
   divide(
     divisor: number | string,
     options?: { rounding?: RoundingMode },
-  ): Money {
-    if (divisor === 0 || divisor === "0") {
-      throw new Error("Division by zero");
-    }
-    const result = divide(this.minor, divisor, options?.rounding);
-    return new Money(result, this.currency);
-  }
+  ): Money {}
 
   /**
killedBy: Money Utilities divide should divide correctly
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:246:16
    * Returns the absolute value of this Money.
    * @returns A new Money instance with the absolute value.
    */
-  abs(): Money {
-    return new Money(this.minor < 0n ? -this.minor : this.minor, this.currency);
-  }
+  abs(): Money {}
 
   /**
killedBy: Money Utilities abs & negate should return absolute value
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] ConditionalExpression
src/money/Money.ts:247:22
    * @returns A new Money instance with the absolute value.
    */
   abs(): Money {
-    return new Money(this.minor < 0n ? -this.minor : this.minor, this.currency);
+    return new Money(false ? -this.minor : this.minor, this.currency);
   }
 
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 1 tests
{ seed: 1305404613, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-1]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:247:22
    * @returns A new Money instance with the absolute value.
    */
   abs(): Money {
-    return new Money(this.minor < 0n ? -this.minor : this.minor, this.currency);
+    return new Money(this.minor >= 0n ? -this.minor : this.minor, this.currency);
   }
 
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 1 tests
{ seed: -87626316, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:295:7
   equals(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     return (
-      this.currency.code === otherMoney.currency.code &&
+      this.currency.code !== otherMoney.currency.code &&
       this.minor === otherMoney.minor
     );
killedBy: Money Property-Based Tests Addition Properties should be commutative: a + b = b + a
statusReason: Property failed after 1 tests
{ seed: -2049570442, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:310:12
   greaterThan(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor > otherMoney.minor;
+    return false;
   }
 
killedBy: Money Utilities min & max should find max
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:332:12
   greaterThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor >= otherMoney.minor;
+    return this.minor > otherMoney.minor;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:341:12
   lessThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor <= otherMoney.minor;
+    return false;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:348:12
    * Checks if this Money value is positive (greater than zero).
    */
   isPositive(): boolean {
-    return this.minor > 0n;
+    return this.minor >= 0n;
   }
 
killedBy: Money Utilities comparisons should check positive
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:348:12
    * Checks if this Money value is positive (greater than zero).
    */
   isPositive(): boolean {
-    return this.minor > 0n;
+    return true;
   }
 
killedBy: Money Utilities comparisons should check positive
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:358:9
   compare(other: Money | number | bigint | string): -1 | 0 | 1 {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    if (this.minor < otherMoney.minor) return -1;
+    if (this.minor >= otherMoney.minor) return -1;
     if (this.minor > otherMoney.minor) return 1;
     return 0;
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected -1 to be 1 // Object.is equality

[Killed] UnaryOperator
src/money/Money.ts:358:47
   compare(other: Money | number | bigint | string): -1 | 0 | 1 {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    if (this.minor < otherMoney.minor) return -1;
+    if (this.minor < otherMoney.minor) return +1;
     if (this.minor > otherMoney.minor) return 1;
     return 0;
killedBy: Money Property-Based Tests Comparison Properties compare should be consistent with greaterThan/lessThan
statusReason: Property failed after 1 tests
{ seed: -781299448, path: "0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:359:9
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
     if (this.minor < otherMoney.minor) return -1;
-    if (this.minor > otherMoney.minor) return 1;
+    if (this.minor <= otherMoney.minor) return 1;
     return 0;
   }
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:359:9
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
     if (this.minor < otherMoney.minor) return -1;
-    if (this.minor > otherMoney.minor) return 1;
+    if (true) return 1;
     return 0;
   }
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:371:12
   percentage(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN,
-  ): Money {
-    return this.multiply(percent / 100, { rounding });
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:383:12
   addPercent(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN,
-  ): Money {
-    return this.add(this.percentage(percent, rounding));
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:395:12
   subtractPercent(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN,
-  ): Money {
-    return this.subtract(this.percentage(percent, rounding));
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] ArrayDeclaration
src/money/Money.ts:404:20
    * @param parts - Number of parts.
    */
   split(parts: number): Money[] {
-    const ratios = Array(parts).fill(1);
+    const ratios = Array().fill(1);
     return this.allocate(ratios);
   }
killedBy: Money Property-Based Tests Allocation Properties split should preserve total
statusReason: Property failed after 1 tests
{ seed: 248185553, path: "0:0:0", endOnFailure: true }
Counterexample: [1,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:414:12
    * @returns True if the amount is zero.
    */
   isZero(): boolean {
-    return this.minor === 0n;
+    return false;
   }
 
killedBy: Account debits and credits starts with zero balance
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:443:9
     assertSameCurrency(this, min);
     assertSameCurrency(this, max);
 
-    if (min.greaterThan(max)) {
+    if (true) {
       throw new Error("Clamp min cannot be greater than max");
     }
killedBy: Money should clamp correctly
statusReason: Clamp min cannot be greater than max

[Killed] BlockStatement
src/money/Money.ts:447:29
       throw new Error("Clamp min cannot be greater than max");
     }
 
-    if (this.lessThan(min)) {
-      return new Money(min.minor, this.currency);
-    }
+    if (this.lessThan(min)) {}
     if (this.greaterThan(max)) {
       return new Money(max.minor, this.currency);
killedBy: Money should clamp correctly
statusReason: expected 1000n to be 5000n // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:450:9
     if (this.lessThan(min)) {
       return new Money(min.minor, this.currency);
     }
-    if (this.greaterThan(max)) {
+    if (false) {
       return new Money(max.minor, this.currency);
     }
killedBy: Money should clamp correctly
statusReason: expected 15000n to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:469:24
    */
   toDecimalString(): string {
     const decimals = this.currency.decimals;
-    const isNegative = this.minor < 0n;
+    const isNegative = false;
     const absMinor = isNegative ? -this.minor : this.minor;
 
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 7 tests
{ seed: -641644878, path: "6:1:0:0:0", endOnFailure: true }
Counterexample: [-1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:472:9
     const isNegative = this.minor < 0n;
     const absMinor = isNegative ? -this.minor : this.minor;
 
-    if (decimals === 0) {
+    if (false) {
       return isNegative ? `-${absMinor.toString()}` : absMinor.toString();
     }
killedBy: Money should return correct decimal string representation
statusReason: expected '150.0' to be '150' // Object.is equality

[Killed] ObjectLiteral
src/money/Money.ts:492:12
    * @returns An object with amount (string), currency (code), and precision.
    */
   toJSON(): { amount: string; currency: string; precision: number } {
-    return {
-      amount: this.minor.toString(),
-      currency: this.currency.code,
-      precision: this.currency.decimals,
-    };
+    return {};
   }
 
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: 272410312, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:512:56
    * const money = JSON.parse(json, Money.reviver);
    * // money is Money instance: $10.50
    */
-  static reviver(key: string, value: unknown): unknown {
-    if (
-      value !== null &&
-      typeof value === "object" &&
-      "amount" in value &&
-      "currency" in value &&
-      "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
-    ) {
-      const obj = value as {
-        amount: string;
-        currency: string;
-        precision: number;
-      };
-      return Money.fromMinor(BigInt(obj.amount), obj.currency);
-    }
-    return value;
-  }
+  static reviver(key: string, value: unknown): unknown {}
 
   /**
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: -509539302, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:514:7
    */
   static reviver(key: string, value: unknown): unknown {
     if (
-      value !== null &&
-      typeof value === "object" &&
-      "amount" in value &&
-      "currency" in value &&
-      "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
+      true &&
       typeof (value as Record<string, unknown>).precision === "number"
     ) {
killedBy: Money should revive Money objects from JSON
statusReason: expected Money{ minor: 1050n, …(1) } to deeply equal { amount: 1050, currency: 'USD', …(1) }

[Killed] StringLiteral
src/money/Money.ts:517:7
       value !== null &&
       typeof value === "object" &&
       "amount" in value &&
-      "currency" in value &&
+      "" in value &&
       "precision" in value &&
       typeof (value as Record<string, unknown>).amount === "string" &&
killedBy: Money should revive Money objects from JSON
statusReason: expected { amount: '1050', …(2) } to be an instance of Money

[Killed] BlockStatement
src/money/Money.ts:522:7
       typeof (value as Record<string, unknown>).amount === "string" &&
       typeof (value as Record<string, unknown>).currency === "string" &&
       typeof (value as Record<string, unknown>).precision === "number"
-    ) {
-      const obj = value as {
-        amount: string;
-        currency: string;
-        precision: number;
-      };
-      return Money.fromMinor(BigInt(obj.amount), obj.currency);
-    }
+    ) {}
     return value;
   }
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: 856078594, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
