[Killed] BlockStatement
src/money/MoneyBag.ts:48:43
    * @param currency The currency to retrieve.
    * @returns The Money amount in that currency (or zero if not present).
    */
-  get(currency: Currency | string): Money {
-    const code = typeof currency === "string" ? currency : currency.code;
-    return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency,
-      )
-    );
-  }
+  get(currency: Currency | string): Money {}
 
   /**
killedBy: MoneyBag should add money to bag
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] ConditionalExpression
src/money/MoneyBag.ts:51:7
   get(currency: Currency | string): Money {
     const code = typeof currency === "string" ? currency : currency.code;
     return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency,
-      )
+      false
     );
   }
killedBy: MoneyBag should add money to bag
statusReason: expected undefined to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:51:7
   get(currency: Currency | string): Money {
     const code = typeof currency === "string" ? currency : currency.code;
     return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency,
-      )
+      true
     );
   }
killedBy: Wallet Features should handle MoneyBag (Portfolio)
statusReason: expected undefined to be 1000n // Object.is equality

[Killed] EqualityOperator
src/money/MoneyBag.ts:53:9
     return (
       this.contents.get(code) ||
       Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency,
+        typeof currency !== "string" ? getCurrency(currency) : currency,
       )
     );
killedBy: MoneyBag should return zero for missing currencies
statusReason: Currency '[object Object]' not found in registry.

[Killed] ConditionalExpression
src/money/MoneyBag.ts:53:9
     return (
       this.contents.get(code) ||
       Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency,
+        true ? getCurrency(currency) : currency,
       )
     );
killedBy: MoneyBag should return zero for missing currencies
statusReason: Currency '[object Object]' not found in registry.
