[Killed] BlockStatement
src/money/arithmetic.ts:34:11
   amount: bigint,
   multiplier: string | number,
   rounding?: RoundingMode,
-): bigint {
-  const { numerator, denominator } = parseMultiplier(multiplier);
-
-  // result = amount * (numerator / denominator)
-  // result = (amount * numerator) / denominator
-
-  const product = amount * numerator;
-
-  if (product % denominator === 0n) {
-    return product / denominator;
-  }
-
-  if (!rounding) {
-    throw new RoundingRequiredError(
-      "multiply",
-      Number(product) / Number(denominator),
-    );
-  }
-
-  return divideWithRounding(product, denominator, rounding);
-}
+): bigint {}
 
 /**
killedBy: MoneyBag should total across currencies using a converter
statusReason: Cannot convert undefined to a BigInt

[Survived] ArithmeticOperator
src/money/arithmetic.ts:49:7
   if (!rounding) {
     throw new RoundingRequiredError(
       "multiply",
-      Number(product) / Number(denominator),
+      Number(product) * Number(denominator),
     );
   }

[Killed] BlockStatement
src/money/arithmetic.ts:69:11
   amount: bigint,
   divisor: string | number,
   rounding?: RoundingMode,
-): bigint {
-  const { numerator, denominator } = parseMultiplier(divisor);
-
-  // result = amount / (numerator / denominator)
-  // result = (amount * denominator) / numerator
-
-  const product = amount * denominator;
-
-  if (product % numerator === 0n) {
-    return product / numerator;
-  }
-
-  if (!rounding) {
-    throw new RoundingRequiredError(
-      "divide",
-      Number(product) / Number(numerator),
-    );
-  }
-
-  return divideWithRounding(product, numerator, rounding);
-}
+): bigint {}
 
 function parseMultiplier(multiplier: string | number): {
killedBy: Money Property-Based Tests Rounding Consistency division with rounding should produce integer minor units
statusReason: Property failed after 1 tests
{ seed: -1966092615, path: "0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/money/arithmetic.ts:84:7
   if (!rounding) {
     throw new RoundingRequiredError(
       "divide",
-      Number(product) / Number(numerator),
+      Number(product) * Number(numerator),
     );
   }

[Killed] BlockStatement
src/money/arithmetic.ts:103:25
   }
 
   const parts = s.split(".");
-  if (parts.length > 2) {
-    throw new Error("Invalid number format");
-  }
+  if (parts.length > 2) {}
 
   const integerPart = parts[0];
killedBy: Money should throw error for invalid number format in multiplier
statusReason: expected [Function] to throw an error
