[Killed] ConditionalExpression
src/rounding/index.ts:21:28
     return quotient;
   }
 
-  const isNegativeResult = numerator < 0n !== denominator < 0n;
+  const isNegativeResult = true;
   const isPositiveResult = !isNegativeResult;
 
killedBy: Money should multiply with rounding
statusReason: expected 54n to be 56n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:21:28
     return quotient;
   }
 
-  const isNegativeResult = numerator < 0n !== denominator < 0n;
+  const isNegativeResult = true !== denominator < 0n;
   const isPositiveResult = !isNegativeResult;
 
killedBy: Financial - Depreciation should clamp book value to salvage value when rounding causes overshoot
statusReason: expected '$3.33' to be '$3.34' // Object.is equality

[Killed] BooleanLiteral
src/rounding/index.ts:22:28
   }
 
   const isNegativeResult = numerator < 0n !== denominator < 0n;
-  const isPositiveResult = !isNegativeResult;
+  const isPositiveResult = isNegativeResult;
 
   const absRemainder = remainder < 0n ? -remainder : remainder;
killedBy: Financial - Investment should calculate NPV
statusReason: expected '$146.86' to be '$146.92' // Object.is equality
