[Killed] BlockStatement
src/money/allocation.ts:14:28
  * @throws {Error} If ratios are empty or total ratio is zero.
  */
 export function allocate(amount: bigint, ratios: number[]): bigint[] {
-  if (ratios.length === 0) {
-    throw new Error("Cannot allocate to empty ratios");
-  }
+  if (ratios.length === 0) {}
 
   // Scale ratios to integers
killedBy: Allocation should throw error for empty ratios array
statusReason: expected [Function] to throw error including 'Cannot allocate to empty ratios' but got 'Total ratio must be greater than zero'

[Killed] ConditionalExpression
src/money/allocation.ts:14:7
  * @throws {Error} If ratios are empty or total ratio is zero.
  */
 export function allocate(amount: bigint, ratios: number[]): bigint[] {
-  if (ratios.length === 0) {
+  if (false) {
     throw new Error("Cannot allocate to empty ratios");
   }
killedBy: Allocation should throw error for empty ratios array
statusReason: expected [Function] to throw error including 'Cannot allocate to empty ratios' but got 'Total ratio must be greater than zero'

[Killed] BlockStatement
src/money/allocation.ts:19:42
   }
 
   // Scale ratios to integers
-  const scaledRatios = ratios.map((r) => {
-    const s = r.toString();
-    if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
-    const parts = s.split(".");
-    const decimals = parts[1] ? parts[1].length : 0;
-    const value = BigInt(parts[0] + (parts[1] || ""));
-    return { value, decimals };
-  });
+  const scaledRatios = ratios.map((r) => {});
 
   const maxDecimals = Math.max(...scaledRatios.map((r) => r.decimals));
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 2094533245, path: "0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/allocation.ts:21:9
   // Scale ratios to integers
   const scaledRatios = ratios.map((r) => {
     const s = r.toString();
-    if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
+    if (true) throw new Error("Scientific notation not supported");
     const parts = s.split(".");
     const decimals = parts[1] ? parts[1].length : 0;
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -550454356, path: "0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/money/allocation.ts:21:9
   // Scale ratios to integers
   const scaledRatios = ratios.map((r) => {
     const s = r.toString();
-    if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
+    if (false) throw new Error("Scientific notation not supported");
     const parts = s.split(".");
     const decimals = parts[1] ? parts[1].length : 0;

[Killed] StringLiteral
src/money/allocation.ts:22:27
   const scaledRatios = ratios.map((r) => {
     const s = r.toString();
     if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
-    const parts = s.split(".");
+    const parts = s.split("");
     const decimals = parts[1] ? parts[1].length : 0;
     const value = BigInt(parts[0] + (parts[1] || ""));
killedBy: Allocation should handle decimal ratios correctly
statusReason: Cannot convert 0. to a BigInt

[Killed] LogicalOperator
src/money/allocation.ts:24:38
     if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
     const parts = s.split(".");
     const decimals = parts[1] ? parts[1].length : 0;
-    const value = BigInt(parts[0] + (parts[1] || ""));
+    const value = BigInt(parts[0] + (parts[1] && ""));
     return { value, decimals };
   });
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 985365021, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/allocation.ts:24:38
     if (/[eE]/.test(s)) throw new Error("Scientific notation not supported");
     const parts = s.split(".");
     const decimals = parts[1] ? parts[1].length : 0;
-    const value = BigInt(parts[0] + (parts[1] || ""));
+    const value = BigInt(parts[0] + (false));
     return { value, decimals };
   });
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -1305449018, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/money/allocation.ts:28:52
     return { value, decimals };
   });
 
-  const maxDecimals = Math.max(...scaledRatios.map((r) => r.decimals));
+  const maxDecimals = Math.max(...scaledRatios.map(() => undefined));
 
   const normalizedRatios = scaledRatios.map((r) => {
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -2046836488, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/money/allocation.ts:28:23
     return { value, decimals };
   });
 
-  const maxDecimals = Math.max(...scaledRatios.map((r) => r.decimals));
+  const maxDecimals = Math.min(...scaledRatios.map(r => r.decimals));
 
   const normalizedRatios = scaledRatios.map((r) => {

[Killed] BlockStatement
src/money/allocation.ts:30:52
 
   const maxDecimals = Math.max(...scaledRatios.map((r) => r.decimals));
 
-  const normalizedRatios = scaledRatios.map((r) => {
-    const factor = 10n ** BigInt(maxDecimals - r.decimals);
-    return r.value * factor;
-  });
+  const normalizedRatios = scaledRatios.map((r) => {});
 
   const total = normalizedRatios.reduce((sum, r) => sum + r, 0n);
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 1393792222, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/money/allocation.ts:31:34
   const maxDecimals = Math.max(...scaledRatios.map((r) => r.decimals));
 
   const normalizedRatios = scaledRatios.map((r) => {
-    const factor = 10n ** BigInt(maxDecimals - r.decimals);
+    const factor = 10n ** BigInt(maxDecimals + r.decimals);
     return r.value * factor;
   });

[Survived] ArithmeticOperator
src/money/allocation.ts:32:12
 
   const normalizedRatios = scaledRatios.map((r) => {
     const factor = 10n ** BigInt(maxDecimals - r.decimals);
-    return r.value * factor;
+    return r.value / factor;
   });
 

[Killed] ArrowFunction
src/money/allocation.ts:35:41
     return r.value * factor;
   });
 
-  const total = normalizedRatios.reduce((sum, r) => sum + r, 0n);
+  const total = normalizedRatios.reduce(() => undefined, 0n);
 
   if (total === 0n) {
killedBy: Allocation should allocate money
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/money/allocation.ts:35:53
     return r.value * factor;
   });
 
-  const total = normalizedRatios.reduce((sum, r) => sum + r, 0n);
+  const total = normalizedRatios.reduce((sum, r) => sum - r, 0n);
 
   if (total === 0n) {
killedBy: Allocation should allocate money
statusReason: Cannot read properties of undefined (reading 'share')

[Killed] ConditionalExpression
src/money/allocation.ts:37:7
 
   const total = normalizedRatios.reduce((sum, r) => sum + r, 0n);
 
-  if (total === 0n) {
+  if (true) {
     throw new Error("Total ratio must be greater than zero");
   }
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -596664571, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/allocation.ts:37:7
 
   const total = normalizedRatios.reduce((sum, r) => sum + r, 0n);
 
-  if (total === 0n) {
+  if (total !== 0n) {
     throw new Error("Total ratio must be greater than zero");
   }
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 1924219317, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrayDeclaration
src/money/allocation.ts:41:74
     throw new Error("Total ratio must be greater than zero");
   }
 
-  const results: { share: bigint; remainder: bigint; index: number }[] = [];
+  const results: { share: bigint; remainder: bigint; index: number }[] = ["Stryker was here"];
   let allocatedTotal = 0n;
 
killedBy: Allocation should allocate money
statusReason: expected undefined to be 5000n // Object.is equality

[Killed] UpdateOperator
src/money/allocation.ts:44:48
   const results: { share: bigint; remainder: bigint; index: number }[] = [];
   let allocatedTotal = 0n;
 
-  for (let i = 0; i < normalizedRatios.length; i++) {
+  for (let i = 0; i < normalizedRatios.length; i--) {
     const ratio = normalizedRatios[i];
     const share = (amount * ratio) / total;
killedBy: Allocation should allocate money
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] EqualityOperator
src/money/allocation.ts:44:19
   const results: { share: bigint; remainder: bigint; index: number }[] = [];
   let allocatedTotal = 0n;
 
-  for (let i = 0; i < normalizedRatios.length; i++) {
+  for (let i = 0; i <= normalizedRatios.length; i++) {
     const ratio = normalizedRatios[i];
     const share = (amount * ratio) / total;
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 1964317776, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/money/allocation.ts:46:20
 
   for (let i = 0; i < normalizedRatios.length; i++) {
     const ratio = normalizedRatios[i];
-    const share = (amount * ratio) / total;
+    const share = (amount / ratio) / total;
     const remainder = (amount * ratio) % total;
 
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -1476000688, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:0:0:1:0:1:0:0:2:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [2,[2]]
Shrunk 39 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/money/allocation.ts:46:19
 
   for (let i = 0; i < normalizedRatios.length; i++) {
     const ratio = normalizedRatios[i];
-    const share = (amount * ratio) / total;
+    const share = amount * ratio * total;
     const remainder = (amount * ratio) % total;
 
killedBy: Allocation should allocate money
statusReason: expected 20000n to be 5000n // Object.is equality

[Survived] ArithmeticOperator
src/money/allocation.ts:47:24
   for (let i = 0; i < normalizedRatios.length; i++) {
     const ratio = normalizedRatios[i];
     const share = (amount * ratio) / total;
-    const remainder = (amount * ratio) % total;
+    const remainder = (amount / ratio) % total;
 
     results.push({ share, remainder, index: i });

[Survived] ArithmeticOperator
src/money/allocation.ts:47:23
   for (let i = 0; i < normalizedRatios.length; i++) {
     const ratio = normalizedRatios[i];
     const share = (amount * ratio) / total;
-    const remainder = (amount * ratio) % total;
+    const remainder = amount * ratio * total;
 
     results.push({ share, remainder, index: i });

[Killed] ObjectLiteral
src/money/allocation.ts:49:18
     const share = (amount * ratio) / total;
     const remainder = (amount * ratio) % total;
 
-    results.push({ share, remainder, index: i });
+    results.push({});
     allocatedTotal += share;
   }
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -42880667, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
src/money/allocation.ts:50:5
     const remainder = (amount * ratio) % total;
 
     results.push({ share, remainder, index: i });
-    allocatedTotal += share;
+    allocatedTotal -= share;
   }
 
killedBy: Allocation should allocate money
statusReason: Cannot read properties of undefined (reading 'share')

[Killed] ArithmeticOperator
src/money/allocation.ts:53:18
     allocatedTotal += share;
   }
 
-  let leftOver = amount - allocatedTotal;
+  let leftOver = amount + allocatedTotal;
 
   // Distribute leftover to those with largest remainder
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 587961154, path: "0:3:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/money/allocation.ts:57:3
 
   // Distribute leftover to those with largest remainder
   // Sort by remainder desc
-  results.sort((a, b) => {
-    if (b.remainder > a.remainder) return 1;
-    if (b.remainder < a.remainder) return -1;
-    return 0;
-  });
+  results;
 
   for (let i = 0; i < Number(leftOver); i++) {

[Survived] BlockStatement
src/money/allocation.ts:57:26
 
   // Distribute leftover to those with largest remainder
   // Sort by remainder desc
-  results.sort((a, b) => {
-    if (b.remainder > a.remainder) return 1;
-    if (b.remainder < a.remainder) return -1;
-    return 0;
-  });
+  results.sort((a, b) => {});
 
   for (let i = 0; i < Number(leftOver); i++) {

[Survived] ConditionalExpression
src/money/allocation.ts:58:9
   // Distribute leftover to those with largest remainder
   // Sort by remainder desc
   results.sort((a, b) => {
-    if (b.remainder > a.remainder) return 1;
+    if (false) return 1;
     if (b.remainder < a.remainder) return -1;
     return 0;

[Survived] EqualityOperator
src/money/allocation.ts:58:9
   // Distribute leftover to those with largest remainder
   // Sort by remainder desc
   results.sort((a, b) => {
-    if (b.remainder > a.remainder) return 1;
+    if (b.remainder >= a.remainder) return 1;
     if (b.remainder < a.remainder) return -1;
     return 0;

[Killed] EqualityOperator
src/money/allocation.ts:59:9
   // Sort by remainder desc
   results.sort((a, b) => {
     if (b.remainder > a.remainder) return 1;
-    if (b.remainder < a.remainder) return -1;
+    if (b.remainder >= a.remainder) return -1;
     return 0;
   });
killedBy: Wallet Features should support financial helpers
statusReason: expected 3333n to be 3334n // Object.is equality

[Killed] ConditionalExpression
src/money/allocation.ts:59:9
   // Sort by remainder desc
   results.sort((a, b) => {
     if (b.remainder > a.remainder) return 1;
-    if (b.remainder < a.remainder) return -1;
+    if (true) return -1;
     return 0;
   });
killedBy: Wallet Features should support financial helpers
statusReason: expected 3333n to be 3334n // Object.is equality

[Killed] BlockStatement
src/money/allocation.ts:63:46
     return 0;
   });
 
-  for (let i = 0; i < Number(leftOver); i++) {
-    results[i].share += 1n;
-  }
+  for (let i = 0; i < Number(leftOver); i++) {}
 
   // Sort back by index
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 476069670, path: "0:0:1:1:1", endOnFailure: true }
Counterexample: [1,[1,1]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UpdateOperator
src/money/allocation.ts:63:41
     return 0;
   });
 
-  for (let i = 0; i < Number(leftOver); i++) {
+  for (let i = 0; i < Number(leftOver); i--) {
     results[i].share += 1n;
   }
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'share')

[Killed] AssignmentOperator
src/money/allocation.ts:64:5
   });
 
   for (let i = 0; i < Number(leftOver); i++) {
-    results[i].share += 1n;
+    results[i].share -= 1n;
   }
 
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: -1917726020, path: "0:0:1:0:1:1", endOnFailure: true }
Counterexample: [1,[1,1]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArrowFunction
src/money/allocation.ts:68:16
   }
 
   // Sort back by index
-  results.sort((a, b) => a.index - b.index);
+  results.sort(() => undefined);
 
   return results.map((r) => r.share);

[Survived] ArithmeticOperator
src/money/allocation.ts:68:26
   }
 
   // Sort back by index
-  results.sort((a, b) => a.index - b.index);
+  results.sort((a, b) => a.index + b.index);
 
   return results.map((r) => r.share);

[Killed] ArrowFunction
src/money/allocation.ts:70:22
   // Sort back by index
   results.sort((a, b) => a.index - b.index);
 
-  return results.map((r) => r.share);
+  return results.map(() => undefined);
 }
 
killedBy: Wallet Features should support financial helpers
statusReason: expected undefined to be 3334n // Object.is equality
