[Killed] BlockStatement
src/currency/registry.ts:9:60
  * Registers a currency in the global registry.
  * @param currency The currency to register.
  */
-export function registerCurrency(currency: Currency): void {
-  registry.set(currency.code, currency);
-}
+export function registerCurrency(currency: Currency): void {}
 
 /**
killedBy: Registry should register and retrieve currency
statusReason: Currency 'TEST' not found in registry.

[Killed] BlockStatement
src/currency/registry.ts:19:53
  * @returns The Currency object.
  * @throws Error if the currency is not found.
  */
-export function getCurrency(code: string): Currency {
-  const currency = registry.get(code);
-  if (!currency) {
-    throw new Error(`Currency '${code}' not found in registry.`);
-  }
-  return currency;
-}
+export function getCurrency(code: string): Currency {}
 
 /**
killedBy: Money Property-Based Tests Addition Properties should be commutative: a + b = b + a
statusReason: Property failed after 1 tests
{ seed: 786141847, path: "0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/currency/registry.ts:21:18
  */
 export function getCurrency(code: string): Currency {
   const currency = registry.get(code);
-  if (!currency) {
-    throw new Error(`Currency '${code}' not found in registry.`);
-  }
+  if (!currency) {}
   return currency;
 }
killedBy: Registry should throw error if currency not found
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/currency/registry.ts:21:7
  */
 export function getCurrency(code: string): Currency {
   const currency = registry.get(code);
-  if (!currency) {
+  if (false) {
     throw new Error(`Currency '${code}' not found in registry.`);
   }
killedBy: Registry should throw error if currency not found
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/currency/registry.ts:30:61
 /**
  * Checks if a currency is registered.
  */
-export function isCurrencyRegistered(code: string): boolean {
-  return registry.has(code);
-}
+export function isCurrencyRegistered(code: string): boolean {}
 
 /**
killedBy: Registry should check if currency is registered
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/currency/registry.ts:38:62
  * Returns all registered currencies as a map.
  * @internal Use for testing only.
  */
-export function getAllCurrencies(): Record<string, Currency> {
-  return Object.fromEntries(registry);
-}
+export function getAllCurrencies(): Record<string, Currency> {}
 
killedBy: Currency ISO4217 Definitions should be able to retrieve all registered currencies
statusReason: Cannot convert undefined or null to object
