[Killed] BlockStatement
src/errors/CurrencyMismatchError.ts:14:51
    */
   readonly received: string;
 
-  constructor(expected: string, received: string) {
-    super(
-      `Currency mismatch: expected ${expected}, received ${received}.\n` +
-        `💡 Tip: Use a Converter to convert between currencies:\n` +
-        `   const converter = new Converter('USD', { ${received}: rate });\n` +
-        `   const converted = converter.convert(money, '${expected}');`,
-      MonetraErrorCode.CURRENCY_MISMATCH
-    );
-    this.expected = expected;
-    this.received = received;
-  }
+  constructor(expected: string, received: string) {}
 }
 
killedBy: Financial - Depreciation should throw error for currency mismatch
statusReason: expected ReferenceError: Must call super construct… to be an instance of CurrencyMismatchError

[Killed] StringLiteral
src/errors/CurrencyMismatchError.ts:18:9
     super(
       `Currency mismatch: expected ${expected}, received ${received}.\n` +
         `💡 Tip: Use a Converter to convert between currencies:\n` +
-        `   const converter = new Converter('USD', { ${received}: rate });\n` +
+        `` +
         `   const converted = converter.convert(money, '${expected}');`,
       MonetraErrorCode.CURRENCY_MISMATCH
killedBy: CurrencyMismatchError should include helpful tip in the message
statusReason: expected 'Currency mismatch: expected USD, rece…' to contain 'const converter = new Converter(\'USD…'
