[Killed] BlockStatement
src/currency/precision.ts:3:66
 import { Currency } from "./Currency";
 
-export function getMinorUnitExponent(currency: Currency): bigint {
-  return 10n ** BigInt(currency.decimals);
-}
+export function getMinorUnitExponent(currency: Currency): bigint {}
 
killedBy: Precision should get precision for currency
statusReason: expected undefined to be 100n // Object.is equality
