[Killed] BlockStatement
src/errors/InsufficientFundsError.ts:4:33
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class InsufficientFundsError extends MonetraError {
-  constructor(message?: string) {
-    super(
-      message || "Insufficient funds for this operation.",
-      MonetraErrorCode.INSUFFICIENT_FUNDS
-    );
-  }
+  constructor(message?: string) {}
 }
 
killedBy: InsufficientFundsError should use default message when none provided
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
src/errors/InsufficientFundsError.ts:6:7
 export class InsufficientFundsError extends MonetraError {
   constructor(message?: string) {
     super(
-      message || "Insufficient funds for this operation.",
+      message && "Insufficient funds for this operation.",
       MonetraErrorCode.INSUFFICIENT_FUNDS
     );
killedBy: InsufficientFundsError should use default message when none provided
statusReason: expected '' to be 'Insufficient funds for this operation.' // Object.is equality

[Killed] ConditionalExpression
src/errors/InsufficientFundsError.ts:6:7
 export class InsufficientFundsError extends MonetraError {
   constructor(message?: string) {
     super(
-      message || "Insufficient funds for this operation.",
+      false,
       MonetraErrorCode.INSUFFICIENT_FUNDS
     );
killedBy: InsufficientFundsError should use default message when none provided
statusReason: expected 'false' to be 'Insufficient funds for this operation.' // Object.is equality
