[Killed] BlockStatement
src/errors/BaseError.ts:23:56
    */
   readonly code: MonetraErrorCode;
 
-  constructor(message: string, code: MonetraErrorCode) {
-    super(message);
-    this.name = this.constructor.name;
-    this.code = code;
-    Object.setPrototypeOf(this, new.target.prototype);
-  }
+  constructor(message: string, code: MonetraErrorCode) {}
 }
 
killedBy: Parser should reject precision exceeding currency decimals
statusReason: expected error to be instance of InvalidPrecisionError
