[Killed] BlockStatement
src/errors/OverflowError.ts:4:56
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class OverflowError extends MonetraError {
-  constructor(message: string = "Arithmetic overflow") {
-    super(message, MonetraErrorCode.OVERFLOW);
-  }
+  constructor(message: string = "Arithmetic overflow") {}
 }
 
killedBy: OverflowError should use default message when none provided
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/errors/OverflowError.ts:4:33
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class OverflowError extends MonetraError {
-  constructor(message: string = "Arithmetic overflow") {
+  constructor(message: string = "") {
     super(message, MonetraErrorCode.OVERFLOW);
   }
killedBy: OverflowError should use default message when none provided
statusReason: expected '' to be 'Arithmetic overflow' // Object.is equality
