[Killed] BlockStatement
src/errors/InvalidPrecisionError.ts:4:32
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class InvalidPrecisionError extends MonetraError {
-  constructor(message: string) {
-    super(message, MonetraErrorCode.INVALID_PRECISION);
-  }
+  constructor(message: string) {}
 }
 
killedBy: Parser should reject precision exceeding currency decimals
statusReason: expected error to be instance of InvalidPrecisionError
