[Killed] BlockStatement
src/errors/InvalidArgumentError.ts:4:32
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class InvalidArgumentError extends MonetraError {
-  constructor(message: string) {
-    super(message, MonetraErrorCode.INVALID_ARGUMENT);
-  }
+  constructor(message: string) {}
 }
 
killedBy: Financial - Depreciation should throw error for negative year
statusReason: expected error to be instance of InvalidArgumentError
