[Killed] BlockStatement
src/errors/RoundingRequiredError.ts:4:52
 import { MonetraError, MonetraErrorCode } from "./BaseError";
 
 export class RoundingRequiredError extends MonetraError {
-  constructor(operation?: string, result?: number) {
-    let message = "Rounding is required for this operation but was not provided.";
-    if (operation && result !== undefined) {
-      message =
-        `Rounding required for ${operation}: result ${result} is not an integer.\n` +
-        `💡 Tip: Provide a rounding mode:\n` +
-        `   money.${operation}(value, { rounding: RoundingMode.HALF_UP })\n` +
-        `   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE`;
-    }
-    super(message, MonetraErrorCode.ROUNDING_REQUIRED);
-  }
+  constructor(operation?: string, result?: number) {}
 }
 
killedBy: RoundingRequiredError should use simple message when no details provided
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/errors/RoundingRequiredError.ts:6:44
 export class RoundingRequiredError extends MonetraError {
   constructor(operation?: string, result?: number) {
     let message = "Rounding is required for this operation but was not provided.";
-    if (operation && result !== undefined) {
-      message =
-        `Rounding required for ${operation}: result ${result} is not an integer.\n` +
-        `💡 Tip: Provide a rounding mode:\n` +
-        `   money.${operation}(value, { rounding: RoundingMode.HALF_UP })\n` +
-        `   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE`;
-    }
+    if (operation && result !== undefined) {}
     super(message, MonetraErrorCode.ROUNDING_REQUIRED);
   }
killedBy: RoundingRequiredError should use detailed message with tip when operation/result provided
statusReason: expected 'Rounding is required for this operati…' to contain 'Rounding required for divide: result …'

[Killed] ConditionalExpression
src/errors/RoundingRequiredError.ts:6:22
 export class RoundingRequiredError extends MonetraError {
   constructor(operation?: string, result?: number) {
     let message = "Rounding is required for this operation but was not provided.";
-    if (operation && result !== undefined) {
+    if (operation && true) {
       message =
         `Rounding required for ${operation}: result ${result} is not an integer.\n` +
killedBy: RoundingRequiredError should handle mixed arguments gracefully (operation provided, result missing)
statusReason: expected 'Rounding required for divide: result …' to be 'Rounding is required for this operati…' // Object.is equality

[Killed] StringLiteral
src/errors/RoundingRequiredError.ts:9:9
     if (operation && result !== undefined) {
       message =
         `Rounding required for ${operation}: result ${result} is not an integer.\n` +
-        `💡 Tip: Provide a rounding mode:\n` +
+        ``+
         `   money.${operation}(value, { rounding: RoundingMode.HALF_UP })\n` +
         `   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE`;
killedBy: RoundingRequiredError should use detailed message with tip when operation/result provided
statusReason: expected 'Rounding required for divide: result …' to contain '💡 Tip: Provide a rounding mode:'

[Killed] StringLiteral
src/errors/RoundingRequiredError.ts:10:9
       message =
         `Rounding required for ${operation}: result ${result} is not an integer.\n` +
         `💡 Tip: Provide a rounding mode:\n` +
-        `   money.${operation}(value, { rounding: RoundingMode.HALF_UP })\n` +
+        `` +
         `   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE`;
     }
killedBy: RoundingRequiredError should use detailed message with tip when operation/result provided
statusReason: expected 'Rounding required for divide: result …' to contain 'money.divide(value, { rounding: Round…'

[Killed] StringLiteral
src/errors/RoundingRequiredError.ts:11:9
         `Rounding required for ${operation}: result ${result} is not an integer.\n` +
         `💡 Tip: Provide a rounding mode:\n` +
         `   money.${operation}(value, { rounding: RoundingMode.HALF_UP })\n` +
-        `   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE`;
+        ``;
     }
     super(message, MonetraErrorCode.ROUNDING_REQUIRED);
killedBy: RoundingRequiredError should use detailed message with tip when operation/result provided
statusReason: expected 'Rounding required for divide: result …' to contain 'Available modes: HALF_UP, HALF_DOWN, …'
