[Killed] BlockStatement
src/financial/compound.ts:18:10
 export function futureValue(
   presentValue: Money,
   options: CompoundOptions
-): Money {
-  const {
-    rate,
-    years,
-    compoundingPerYear = 12,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  const n = compoundingPerYear;
-  const t = years;
-  const multiplier = Math.pow(1 + rate / n, n * t);
-
-  return presentValue.multiply(multiplier, { rounding });
-}
+): Money {}
 
 /**
killedBy: Financial - Compound Interest should calculate future value
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] ArithmeticOperator
src/financial/compound.ts:28:45
 
   const n = compoundingPerYear;
   const t = years;
-  const multiplier = Math.pow(1 + rate / n, n * t);
+  const multiplier = Math.pow(1 + rate / n, n / t);
 
   return presentValue.multiply(multiplier, { rounding });
killedBy: Financial - Compound Interest should calculate future value
statusReason: expected '$1,004.89' to be '$1,628.89' // Object.is equality

[Killed] ArithmeticOperator
src/financial/compound.ts:28:35
 
   const n = compoundingPerYear;
   const t = years;
-  const multiplier = Math.pow(1 + rate / n, n * t);
+  const multiplier = Math.pow(1 + rate * n, n * t);
 
   return presentValue.multiply(multiplier, { rounding });
killedBy: Financial - Compound Interest should calculate future value with quarterly compounding
statusReason: expected '$4,797.85' to be '$1,125.51' // Object.is equality

[Killed] BlockStatement
src/financial/compound.ts:40:10
 export function presentValue(
   futureVal: Money,
   options: CompoundOptions
-): Money {
-  const {
-    rate,
-    years,
-    compoundingPerYear = 12,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  const n = compoundingPerYear;
-  const t = years;
-  const divisor = Math.pow(1 + rate / n, n * t);
-
-  return futureVal.divide(divisor, { rounding });
-}
+): Money {}
 
 // Alias for familiarity
killedBy: Financial - Compound Interest should calculate present value
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] ArithmeticOperator
src/financial/compound.ts:50:32
 
   const n = compoundingPerYear;
   const t = years;
-  const divisor = Math.pow(1 + rate / n, n * t);
+  const divisor = Math.pow(1 + rate * n, n * t);
 
   return futureVal.divide(divisor, { rounding });
killedBy: Financial - Compound Interest should calculate present value with monthly compounding
statusReason: expected '$234.59' to be '$1,000.00' // Object.is equality

[Killed] ArithmeticOperator
src/financial/compound.ts:50:42
 
   const n = compoundingPerYear;
   const t = years;
-  const divisor = Math.pow(1 + rate / n, n * t);
+  const divisor = Math.pow(1 + rate / n, n / t);
 
   return futureVal.divide(divisor, { rounding });
killedBy: Financial - Compound Interest should calculate present value
statusReason: expected '$1,620.96' to be '$1,000.00' // Object.is equality

[Killed] ObjectLiteral
src/financial/compound.ts:52:36
   const t = years;
   const divisor = Math.pow(1 + rate / n, n * t);
 
-  return futureVal.divide(divisor, { rounding });
+  return futureVal.divide(divisor, {});
 }
 
killedBy: Financial - Compound Interest should calculate present value
statusReason: Rounding required for divide: result 99999.71595600071 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE
