[Killed] ConditionalExpression
src/financial/depreciation.ts:34:7
 export function straightLineDepreciation(options: DepreciationOptions): DepreciationResult {
   const { cost, salvageValue, usefulLife, rounding = RoundingMode.HALF_EVEN } = options;
 
-  if (cost.currency.code !== salvageValue.currency.code) {
+  if (true) {
     throw new CurrencyMismatchError(cost.currency.code, salvageValue.currency.code);
   }
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] BlockStatement
src/financial/depreciation.ts:34:58
 export function straightLineDepreciation(options: DepreciationOptions): DepreciationResult {
   const { cost, salvageValue, usefulLife, rounding = RoundingMode.HALF_EVEN } = options;
 
-  if (cost.currency.code !== salvageValue.currency.code) {
-    throw new CurrencyMismatchError(cost.currency.code, salvageValue.currency.code);
-  }
+  if (cost.currency.code !== salvageValue.currency.code) {}
 
   if (usefulLife <= 0) {
killedBy: Financial - Depreciation should throw error for currency mismatch
statusReason: expected 'EUR' to be 'USD' // Object.is equality

[Killed] ConditionalExpression
src/financial/depreciation.ts:38:7
     throw new CurrencyMismatchError(cost.currency.code, salvageValue.currency.code);
   }
 
-  if (usefulLife <= 0) {
+  if (false) {
     throw new InvalidArgumentError("Useful life must be positive");
   }
killedBy: Financial - Depreciation should throw error for invalid useful life
statusReason: expected [Function] to throw error matching /Useful life must be positive/ but got 'Division by zero'

[Killed] EqualityOperator
src/financial/depreciation.ts:38:7
     throw new CurrencyMismatchError(cost.currency.code, salvageValue.currency.code);
   }
 
-  if (usefulLife <= 0) {
+  if (usefulLife > 0) {
     throw new InvalidArgumentError("Useful life must be positive");
   }
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: Useful life must be positive

[Killed] BlockStatement
src/financial/depreciation.ts:42:39
     throw new InvalidArgumentError("Useful life must be positive");
   }
 
-  if (salvageValue.greaterThan(cost)) {
-    throw new InvalidArgumentError("Salvage value cannot be greater than cost");
-  }
+  if (salvageValue.greaterThan(cost)) {}
 
   const depreciableAmount = cost.subtract(salvageValue);
killedBy: Financial - Depreciation should throw error if salvage value > cost
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/financial/depreciation.ts:42:7
     throw new InvalidArgumentError("Useful life must be positive");
   }
 
-  if (salvageValue.greaterThan(cost)) {
+  if (false) {
     throw new InvalidArgumentError("Salvage value cannot be greater than cost");
   }
killedBy: Financial - Depreciation should throw error if salvage value > cost
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/financial/depreciation.ts:47:67
   }
 
   const depreciableAmount = cost.subtract(salvageValue);
-  const annualDepreciation = depreciableAmount.divide(usefulLife, { rounding });
+  const annualDepreciation = depreciableAmount.divide(usefulLife, {});
 
   const result: DepreciationResult = {
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: Rounding required for divide: result 3333.3333333333335 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] BlockStatement
src/financial/depreciation.ts:52:42
   const result: DepreciationResult = {
     annualDepreciation,
 
-    bookValueAtYear(year: number): Money {
-      if (year < 0) {
-        throw new InvalidArgumentError("Year must be non-negative");
-      }
-      if (year === 0) return cost;
-
-      const totalDepreciation = annualDepreciation.multiply(year);
-      const bookValue = cost.subtract(totalDepreciation);
-
-      // Ensure book value doesn't drop below salvage value
-      if (bookValue.lessThan(salvageValue)) {
-        return salvageValue;
-      }
-      return bookValue;
-    },
+    bookValueAtYear(year: number): Money {},
 
     schedule(): { year: number; depreciation: Money; bookValue: Money }[] {
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/financial/depreciation.ts:53:21
     annualDepreciation,
 
     bookValueAtYear(year: number): Money {
-      if (year < 0) {
-        throw new InvalidArgumentError("Year must be non-negative");
-      }
+      if (year < 0) {}
       if (year === 0) return cost;
 
killedBy: Financial - Depreciation should throw error for negative year
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/financial/depreciation.ts:53:11
     annualDepreciation,
 
     bookValueAtYear(year: number): Money {
-      if (year < 0) {
+      if (false) {
         throw new InvalidArgumentError("Year must be non-negative");
       }
killedBy: Financial - Depreciation should throw error for negative year
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/financial/depreciation.ts:56:11
       if (year < 0) {
         throw new InvalidArgumentError("Year must be non-negative");
       }
-      if (year === 0) return cost;
+      if (true) return cost;
 
       const totalDepreciation = annualDepreciation.multiply(year);
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '$1,000.00' to be '$800.00' // Object.is equality

[Killed] EqualityOperator
src/financial/depreciation.ts:56:11
       if (year < 0) {
         throw new InvalidArgumentError("Year must be non-negative");
       }
-      if (year === 0) return cost;
+      if (year !== 0) return cost;
 
       const totalDepreciation = annualDepreciation.multiply(year);
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '$1,000.00' to be '$800.00' // Object.is equality

[Killed] BlockStatement
src/financial/depreciation.ts:62:45
       const bookValue = cost.subtract(totalDepreciation);
 
       // Ensure book value doesn't drop below salvage value
-      if (bookValue.lessThan(salvageValue)) {
-        return salvageValue;
-      }
+      if (bookValue.lessThan(salvageValue)) {}
       return bookValue;
     },
killedBy: Financial - Depreciation should clamp book value to salvage value when rounding causes overshoot
statusReason: expected '-$0.02' to be '$0.00' // Object.is equality

[Killed] ConditionalExpression
src/financial/depreciation.ts:62:11
       const bookValue = cost.subtract(totalDepreciation);
 
       // Ensure book value doesn't drop below salvage value
-      if (bookValue.lessThan(salvageValue)) {
+      if (false) {
         return salvageValue;
       }
killedBy: Financial - Depreciation should clamp book value to salvage value when rounding causes overshoot
statusReason: expected '-$0.02' to be '$0.00' // Object.is equality

[Killed] BlockStatement
src/financial/depreciation.ts:68:75
       return bookValue;
     },
 
-    schedule(): { year: number; depreciation: Money; bookValue: Money }[] {
-      const schedule = [];
-      let previousBookValue = cost;
-      const maxYears = Math.ceil(usefulLife);
-
-      for (let year = 1; year <= maxYears; year++) {
-        const currentBookValue = result.bookValueAtYear(year);
-        const depreciation = previousBookValue.subtract(currentBookValue);
-
-        schedule.push({
-          year,
-          depreciation,
-          bookValue: currentBookValue,
-        });
-
-        previousBookValue = currentBookValue;
-      }
-
-      return schedule;
-    },
+    schedule(): { year: number; depreciation: Money; bookValue: Money }[] {},
   };
 
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: Target cannot be null or undefined.

[Killed] UpdateOperator
src/financial/depreciation.ts:73:44
       let previousBookValue = cost;
       const maxYears = Math.ceil(usefulLife);
 
-      for (let year = 1; year <= maxYears; year++) {
+      for (let year = 1; year <= maxYears; year--) {
         const currentBookValue = result.bookValueAtYear(year);
         const depreciation = previousBookValue.subtract(currentBookValue);
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: Year must be non-negative

[Killed] EqualityOperator
src/financial/depreciation.ts:73:26
       let previousBookValue = cost;
       const maxYears = Math.ceil(usefulLife);
 
-      for (let year = 1; year <= maxYears; year++) {
+      for (let year = 1; year < maxYears; year++) {
         const currentBookValue = result.bookValueAtYear(year);
         const depreciation = previousBookValue.subtract(currentBookValue);
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: expected [ Array(2) ] to have a length of 3 but got 2
