[Killed] BlockStatement
src/financial/investment.ts:15:69
  * @returns The ROI as a decimal (e.g., 0.15 for 15%).
  * @throws {CurrencyMismatchError} If currencies differ.
  */
-export function roi(initialValue: Money, finalValue: Money): number {
-  if (initialValue.currency.code !== finalValue.currency.code) {
-    throw new CurrencyMismatchError(
-      initialValue.currency.code,
-      finalValue.currency.code
-    );
-  }
-
-  const gain = finalValue.subtract(initialValue);
-  return Number(gain.minor) / Number(initialValue.minor);
-}
+export function roi(initialValue: Money, finalValue: Money): number {}
 
 /**
killedBy: Financial - Investment should calculate ROI
statusReason: expected undefined to be 0.15 // Object.is equality

[Killed] EqualityOperator
src/financial/investment.ts:16:7
  * @throws {CurrencyMismatchError} If currencies differ.
  */
 export function roi(initialValue: Money, finalValue: Money): number {
-  if (initialValue.currency.code !== finalValue.currency.code) {
+  if (initialValue.currency.code === finalValue.currency.code) {
     throw new CurrencyMismatchError(
       initialValue.currency.code,
killedBy: Financial - Investment should calculate ROI
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] ConditionalExpression
src/financial/investment.ts:16:7
  * @throws {CurrencyMismatchError} If currencies differ.
  */
 export function roi(initialValue: Money, finalValue: Money): number {
-  if (initialValue.currency.code !== finalValue.currency.code) {
+  if (true) {
     throw new CurrencyMismatchError(
       initialValue.currency.code,
killedBy: Financial - Investment should calculate ROI
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] ArithmeticOperator
src/financial/investment.ts:24:10
   }
 
   const gain = finalValue.subtract(initialValue);
-  return Number(gain.minor) / Number(initialValue.minor);
+  return Number(gain.minor) * Number(initialValue.minor);
 }
 
killedBy: Financial - Investment should calculate ROI
statusReason: expected 1500000000 to be 0.15 // Object.is equality

[Killed] BlockStatement
src/financial/investment.ts:33:10
 export function npv(
   discountRate: number,
   cashFlows: Money[] // First is initial investment (usually negative)
-): Money {
-  if (cashFlows.length === 0) {
-    throw new Error("At least one cash flow required");
-  }
-
-  const currency = cashFlows[0].currency;
-
-  let total = Money.zero(currency);
-
-  for (let i = 0; i < cashFlows.length; i++) {
-    const discountFactor = Math.pow(1 + discountRate, i);
-    const discounted = cashFlows[i].divide(discountFactor, {
-      rounding: RoundingMode.HALF_EVEN,
-    });
-    total = total.add(discounted);
-  }
-
-  return total;
-}
+): Money {}
 
 /**
killedBy: Financial - Investment should calculate NPV
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] ConditionalExpression
src/financial/investment.ts:34:7
   discountRate: number,
   cashFlows: Money[] // First is initial investment (usually negative)
 ): Money {
-  if (cashFlows.length === 0) {
+  if (true) {
     throw new Error("At least one cash flow required");
   }
killedBy: Financial - Investment should calculate NPV
statusReason: At least one cash flow required

[Killed] ConditionalExpression
src/financial/investment.ts:34:7
   discountRate: number,
   cashFlows: Money[] // First is initial investment (usually negative)
 ): Money {
-  if (cashFlows.length === 0) {
+  if (false) {
     throw new Error("At least one cash flow required");
   }
killedBy: Financial - Investment should throw error for empty cash flows in NPV
statusReason: expected [Function] to throw error matching /At least one cash flow required/ but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/financial/investment.ts:42:19
 
   let total = Money.zero(currency);
 
-  for (let i = 0; i < cashFlows.length; i++) {
+  for (let i = 0; i >= cashFlows.length; i++) {
     const discountFactor = Math.pow(1 + discountRate, i);
     const discounted = cashFlows[i].divide(discountFactor, {
killedBy: Financial - Investment should calculate NPV
statusReason: expected '$0.00' to be '$146.92' // Object.is equality

[Killed] BlockStatement
src/financial/investment.ts:42:46
 
   let total = Money.zero(currency);
 
-  for (let i = 0; i < cashFlows.length; i++) {
-    const discountFactor = Math.pow(1 + discountRate, i);
-    const discounted = cashFlows[i].divide(discountFactor, {
-      rounding: RoundingMode.HALF_EVEN,
-    });
-    total = total.add(discounted);
-  }
+  for (let i = 0; i < cashFlows.length; i++) {}
 
   return total;
killedBy: Financial - Investment should calculate NPV
statusReason: expected '$0.00' to be '$146.92' // Object.is equality

[Killed] ArithmeticOperator
src/financial/investment.ts:43:37
   let total = Money.zero(currency);
 
   for (let i = 0; i < cashFlows.length; i++) {
-    const discountFactor = Math.pow(1 + discountRate, i);
+    const discountFactor = Math.pow(1 - discountRate, i);
     const discounted = cashFlows[i].divide(discountFactor, {
       rounding: RoundingMode.HALF_EVEN,
killedBy: Financial - Investment should calculate NPV
statusReason: expected '$1,040.54' to be '$146.92' // Object.is equality

[Killed] ObjectLiteral
src/financial/investment.ts:44:60
 
   for (let i = 0; i < cashFlows.length; i++) {
     const discountFactor = Math.pow(1 + discountRate, i);
-    const discounted = cashFlows[i].divide(discountFactor, {
-      rounding: RoundingMode.HALF_EVEN,
-    });
+    const discounted = cashFlows[i].divide(discountFactor, {});
     total = total.add(discounted);
   }
killedBy: Financial - Investment should calculate NPV
statusReason: Rounding required for divide: result 18181.81818181818 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] ArrowFunction
src/financial/investment.ts:58:32
  * @returns The IRR as a decimal (e.g., 0.12 for 12%)
  */
 export function irr(cashFlows: Money[], guess: number = 0.1): number {
-  const values = cashFlows.map((cf) => Number(cf.minor));
+  const values = cashFlows.map(() => undefined);
 
   const maxIterations = 100;
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] EqualityOperator
src/financial/investment.ts:68:21
     let npvValue = 0;
     let derivative = 0;
 
-    for (let j = 0; j < values.length; j++) {
+    for (let j = 0; j <= values.length; j++) {
       const denominator = Math.pow(1 + rate, j);
       npvValue += values[j] / denominator;
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] EqualityOperator
src/financial/investment.ts:68:21
     let npvValue = 0;
     let derivative = 0;
 
-    for (let j = 0; j < values.length; j++) {
+    for (let j = 0; j >= values.length; j++) {
       const denominator = Math.pow(1 + rate, j);
       npvValue += values[j] / denominator;
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] ArithmeticOperator
src/financial/investment.ts:69:36
     let derivative = 0;
 
     for (let j = 0; j < values.length; j++) {
-      const denominator = Math.pow(1 + rate, j);
+      const denominator = Math.pow(1 - rate, j);
       npvValue += values[j] / denominator;
 
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] ArithmeticOperator
src/financial/investment.ts:70:19
 
     for (let j = 0; j < values.length; j++) {
       const denominator = Math.pow(1 + rate, j);
-      npvValue += values[j] / denominator;
+      npvValue += values[j] * denominator;
 
       if (j > 0) {
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] AssignmentOperator
src/financial/investment.ts:70:7
 
     for (let j = 0; j < values.length; j++) {
       const denominator = Math.pow(1 + rate, j);
-      npvValue += values[j] / denominator;
+      npvValue -= values[j] / denominator;
 
       if (j > 0) {
killedBy: Financial - Investment should calculate IRR
statusReason: expected -0.9999998447714121 to be close to 0.23375, received difference is 1.2337498447714121, but expected 0.00005

[Killed] ConditionalExpression
src/financial/investment.ts:72:11
       const denominator = Math.pow(1 + rate, j);
       npvValue += values[j] / denominator;
 
-      if (j > 0) {
+      if (false) {
         derivative -= (j * values[j]) / Math.pow(1 + rate, j + 1);
       }
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] BlockStatement
src/financial/investment.ts:72:18
       const denominator = Math.pow(1 + rate, j);
       npvValue += values[j] / denominator;
 
-      if (j > 0) {
-        derivative -= (j * values[j]) / Math.pow(1 + rate, j + 1);
-      }
+      if (j > 0) {}
     }
 
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] ArithmeticOperator
src/financial/investment.ts:73:60
       npvValue += values[j] / denominator;
 
       if (j > 0) {
-        derivative -= (j * values[j]) / Math.pow(1 + rate, j + 1);
+        derivative -= (j * values[j]) / Math.pow(1 + rate, j - 1);
       }
     }
killedBy: Financial - Investment should calculate IRR
statusReason: expected 0.005525397791643627 to be close to +0, received difference is 0.005525397791643627, but expected 0.005

[Killed] ArithmeticOperator
src/financial/investment.ts:73:24
       npvValue += values[j] / denominator;
 
       if (j > 0) {
-        derivative -= (j * values[j]) / Math.pow(1 + rate, j + 1);
+        derivative -= (j / values[j]) / Math.pow(1 + rate, j + 1);
       }
     }
killedBy: Financial - Investment should calculate IRR
statusReason: IRR calculation did not converge

[Killed] ArithmeticOperator
src/financial/investment.ts:77:21
       }
     }
 
-    const newRate = rate - npvValue / derivative;
+    const newRate = rate + npvValue / derivative;
 
     if (Math.abs(newRate - rate) < tolerance) {
killedBy: Financial - Investment should calculate IRR
statusReason: expected -0.9999998447714121 to be close to 0.23375, received difference is 1.2337498447714121, but expected 0.00005

[Killed] ArithmeticOperator
src/financial/investment.ts:77:28
       }
     }
 
-    const newRate = rate - npvValue / derivative;
+    const newRate = rate - npvValue * derivative;
 
     if (Math.abs(newRate - rate) < tolerance) {
killedBy: Financial - Investment should calculate IRR
statusReason: expected 5328736531.431299 to be close to 0.23375, received difference is 5328736531.197549, but expected 0.00005

[Killed] ConditionalExpression
src/financial/investment.ts:79:9
 
     const newRate = rate - npvValue / derivative;
 
-    if (Math.abs(newRate - rate) < tolerance) {
+    if (true) {
       return newRate;
     }
killedBy: Financial - Investment should calculate IRR
statusReason: expected 0.2112012480499219 to be close to 0.23375, received difference is 0.022548751950078105, but expected 0.00005

[Killed] EqualityOperator
src/financial/investment.ts:79:9
 
     const newRate = rate - npvValue / derivative;
 
-    if (Math.abs(newRate - rate) < tolerance) {
+    if (Math.abs(newRate - rate) >= tolerance) {
       return newRate;
     }
killedBy: Financial - Investment should calculate IRR
statusReason: expected 0.2112012480499219 to be close to 0.23375, received difference is 0.022548751950078105, but expected 0.00005

[Killed] BlockStatement
src/financial/investment.ts:99:80
  * @throws {CurrencyMismatchError} If currencies differ.
  * @throws {InvalidArgumentError} If price is zero or negative.
  */
-export function currentYield(annualCoupon: Money, currentPrice: Money): number {
-  if (annualCoupon.currency.code !== currentPrice.currency.code) {
-    throw new CurrencyMismatchError(
-      annualCoupon.currency.code,
-      currentPrice.currency.code
-    );
-  }
-
-  if (currentPrice.minor <= 0n) {
-    throw new InvalidArgumentError("Current price must be positive");
-  }
-
-  return Number(annualCoupon.minor) / Number(currentPrice.minor);
-}
+export function currentYield(annualCoupon: Money, currentPrice: Money): number {}
 
killedBy: Financial - Investment should calculate current yield for bond at par
statusReason: expected undefined to be 0.05 // Object.is equality

[Killed] BlockStatement
src/financial/investment.ts:100:66
  * @throws {InvalidArgumentError} If price is zero or negative.
  */
 export function currentYield(annualCoupon: Money, currentPrice: Money): number {
-  if (annualCoupon.currency.code !== currentPrice.currency.code) {
-    throw new CurrencyMismatchError(
-      annualCoupon.currency.code,
-      currentPrice.currency.code
-    );
-  }
+  if (annualCoupon.currency.code !== currentPrice.currency.code) {}
 
   if (currentPrice.minor <= 0n) {
killedBy: Financial - Investment should throw error for currency mismatch in current yield
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/financial/investment.ts:100:7
  * @throws {InvalidArgumentError} If price is zero or negative.
  */
 export function currentYield(annualCoupon: Money, currentPrice: Money): number {
-  if (annualCoupon.currency.code !== currentPrice.currency.code) {
+  if (false) {
     throw new CurrencyMismatchError(
       annualCoupon.currency.code,
killedBy: Financial - Investment should throw error for currency mismatch in current yield
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/financial/investment.ts:107:7
     );
   }
 
-  if (currentPrice.minor <= 0n) {
+  if (true) {
     throw new InvalidArgumentError("Current price must be positive");
   }
killedBy: Financial - Investment should calculate current yield for bond at par
statusReason: Current price must be positive

[Killed] EqualityOperator
src/financial/investment.ts:107:7
     );
   }
 
-  if (currentPrice.minor <= 0n) {
+  if (currentPrice.minor > 0n) {
     throw new InvalidArgumentError("Current price must be positive");
   }
killedBy: Financial - Investment should calculate current yield for bond at par
statusReason: Current price must be positive

[Killed] ArithmeticOperator
src/financial/investment.ts:111:10
     throw new InvalidArgumentError("Current price must be positive");
   }
 
-  return Number(annualCoupon.minor) / Number(currentPrice.minor);
+  return Number(annualCoupon.minor) * Number(currentPrice.minor);
 }
 
killedBy: Financial - Investment should calculate current yield for bond at par
statusReason: expected 500000000 to be 0.05 // Object.is equality
