[Killed] BlockStatement
src/financial/leverage.ts:34:76
  * @returns The D/E ratio as a number
  * @throws {Error} If totalEquity is zero
  */
-export function debtToEquity(totalDebt: Money, totalEquity: Money): number {
-  assertSameCurrency(totalDebt, totalEquity);
-  if (totalEquity.isZero()) {
-    throw new Error("Total equity cannot be zero");
-  }
-  return Number(totalDebt.minor) / Number(totalEquity.minor);
-}
+export function debtToEquity(totalDebt: Money, totalEquity: Money): number {}
 
 /**
killedBy: Financial - Leverage Ratios should calculate Debt-to-Equity ratio correctly
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/financial/leverage.ts:36:7
  */
 export function debtToEquity(totalDebt: Money, totalEquity: Money): number {
   assertSameCurrency(totalDebt, totalEquity);
-  if (totalEquity.isZero()) {
+  if (false) {
     throw new Error("Total equity cannot be zero");
   }
killedBy: Financial - Leverage Ratios should throw if total equity is zero
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/financial/leverage.ts:36:29
  */
 export function debtToEquity(totalDebt: Money, totalEquity: Money): number {
   assertSameCurrency(totalDebt, totalEquity);
-  if (totalEquity.isZero()) {
-    throw new Error("Total equity cannot be zero");
-  }
+  if (totalEquity.isZero()) {}
   return Number(totalDebt.minor) / Number(totalEquity.minor);
 }
killedBy: Financial - Leverage Ratios should throw if total equity is zero
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/financial/leverage.ts:39:10
   if (totalEquity.isZero()) {
     throw new Error("Total equity cannot be zero");
   }
-  return Number(totalDebt.minor) / Number(totalEquity.minor);
+  return Number(totalDebt.minor) * Number(totalEquity.minor);
 }
 
killedBy: Financial - Leverage Ratios should calculate Debt-to-Equity ratio correctly
statusReason: expected 2000000000000 to be 2 // Object.is equality

[Killed] BlockStatement
src/financial/leverage.ts:51:76
  * @returns The Debt-to-Assets ratio as a number
  * @throws {Error} If totalAssets is zero
  */
-export function debtToAssets(totalDebt: Money, totalAssets: Money): number {
-  assertSameCurrency(totalDebt, totalAssets);
-  if (totalAssets.isZero()) {
-    throw new Error("Total assets cannot be zero");
-  }
-  return Number(totalDebt.minor) / Number(totalAssets.minor);
-}
+export function debtToAssets(totalDebt: Money, totalAssets: Money): number {}
 
 /**
killedBy: Financial - Leverage Ratios should calculate Debt-to-Assets ratio correctly
statusReason: expected undefined to be close to 0.6666666, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/financial/leverage.ts:53:7
  */
 export function debtToAssets(totalDebt: Money, totalAssets: Money): number {
   assertSameCurrency(totalDebt, totalAssets);
-  if (totalAssets.isZero()) {
+  if (true) {
     throw new Error("Total assets cannot be zero");
   }
killedBy: Financial - Leverage Ratios should calculate Debt-to-Assets ratio correctly
statusReason: Total assets cannot be zero

[Killed] ConditionalExpression
src/financial/leverage.ts:53:7
  */
 export function debtToAssets(totalDebt: Money, totalAssets: Money): number {
   assertSameCurrency(totalDebt, totalAssets);
-  if (totalAssets.isZero()) {
+  if (false) {
     throw new Error("Total assets cannot be zero");
   }
killedBy: Financial - Leverage Ratios should throw if total assets is zero
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/financial/leverage.ts:54:21
 export function debtToAssets(totalDebt: Money, totalAssets: Money): number {
   assertSameCurrency(totalDebt, totalAssets);
   if (totalAssets.isZero()) {
-    throw new Error("Total assets cannot be zero");
+    throw new Error("");
   }
   return Number(totalDebt.minor) / Number(totalAssets.minor);
killedBy: Financial - Leverage Ratios should throw if total assets is zero
statusReason: expected [Function] to throw error matching /Total assets cannot be zero/ but got ''

[Killed] ArithmeticOperator
src/financial/leverage.ts:56:10
   if (totalAssets.isZero()) {
     throw new Error("Total assets cannot be zero");
   }
-  return Number(totalDebt.minor) / Number(totalAssets.minor);
+  return Number(totalDebt.minor) * Number(totalAssets.minor);
 }
 
killedBy: Financial - Leverage Ratios should calculate Debt-to-Assets ratio correctly
statusReason: expected 6000000000000 to be close to 0.6666666, received difference is 5999999999999.333, but expected 0.000005

[Killed] BlockStatement
src/financial/leverage.ts:67:79
  * @param interestExpense - Total interest expense
  * @returns The Interest Coverage ratio. Returns Infinity if interest expense is zero
  */
-export function interestCoverage(ebit: Money, interestExpense: Money): number {
-  assertSameCurrency(ebit, interestExpense);
-  if (interestExpense.isZero()) {
-    return Infinity;
-  }
-  return Number(ebit.minor) / Number(interestExpense.minor);
-}
+export function interestCoverage(ebit: Money, interestExpense: Money): number {}
 
 /**
killedBy: Financial - Leverage Ratios should calculate Infinity for zero interest expense
statusReason: expected undefined to be Infinity // Object.is equality

[Killed] ConditionalExpression
src/financial/leverage.ts:69:7
  */
 export function interestCoverage(ebit: Money, interestExpense: Money): number {
   assertSameCurrency(ebit, interestExpense);
-  if (interestExpense.isZero()) {
+  if (true) {
     return Infinity;
   }
killedBy: Financial - Leverage Ratios should calculate all ratios using bundled function
statusReason: expected Infinity to be 5 // Object.is equality

[Survived] ConditionalExpression
src/financial/leverage.ts:69:7
  */
 export function interestCoverage(ebit: Money, interestExpense: Money): number {
   assertSameCurrency(ebit, interestExpense);
-  if (interestExpense.isZero()) {
+  if (false) {
     return Infinity;
   }

[Killed] ArithmeticOperator
src/financial/leverage.ts:72:10
   if (interestExpense.isZero()) {
     return Infinity;
   }
-  return Number(ebit.minor) / Number(interestExpense.minor);
+  return Number(ebit.minor) * Number(interestExpense.minor);
 }
 
killedBy: Financial - Leverage Ratios should calculate all ratios using bundled function
statusReason: expected 5000000000000 to be 5 // Object.is equality

[Killed] BlockStatement
src/financial/leverage.ts:87:11
 export function equityMultiplier(
   totalAssets: Money,
   totalEquity: Money
-): number {
-  assertSameCurrency(totalAssets, totalEquity);
-  if (totalEquity.isZero()) {
-    throw new Error("Total equity cannot be zero");
-  }
-  return Number(totalAssets.minor) / Number(totalEquity.minor);
-}
+): number {}
 
 /**
killedBy: Financial - Leverage Ratios should calculate Equity Multiplier correctly
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
src/financial/leverage.ts:89:7
   totalEquity: Money
 ): number {
   assertSameCurrency(totalAssets, totalEquity);
-  if (totalEquity.isZero()) {
+  if (true) {
     throw new Error("Total equity cannot be zero");
   }
killedBy: Financial - Leverage Ratios should calculate Equity Multiplier correctly
statusReason: Total equity cannot be zero

[Killed] BlockStatement
src/financial/leverage.ts:89:29
   totalEquity: Money
 ): number {
   assertSameCurrency(totalAssets, totalEquity);
-  if (totalEquity.isZero()) {
-    throw new Error("Total equity cannot be zero");
-  }
+  if (totalEquity.isZero()) {}
   return Number(totalAssets.minor) / Number(totalEquity.minor);
 }
killedBy: Financial - Leverage Ratios should throw if total equity is zero for equity multiplier
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/financial/leverage.ts:92:10
   if (totalEquity.isZero()) {
     throw new Error("Total equity cannot be zero");
   }
-  return Number(totalAssets.minor) / Number(totalEquity.minor);
+  return Number(totalAssets.minor) * Number(totalEquity.minor);
 }
 
killedBy: Financial - Leverage Ratios should calculate Equity Multiplier correctly
statusReason: expected 3000000000000 to be 3 // Object.is equality

[Killed] BlockStatement
src/financial/leverage.ts:101:72
  * @param inputs - Object containing all necessary Money values
  * @returns An object with all calculated leverage ratios
  */
-export function leverageRatios(inputs: LeverageInputs): LeverageResult {
-  return {
-    debtToEquity: debtToEquity(inputs.totalDebt, inputs.totalEquity),
-    debtToAssets: debtToAssets(inputs.totalDebt, inputs.totalAssets),
-    interestCoverage: interestCoverage(inputs.ebit, inputs.interestExpense),
-    equityMultiplier: equityMultiplier(inputs.totalAssets, inputs.totalEquity),
-  };
-}
+export function leverageRatios(inputs: LeverageInputs): LeverageResult {}
 
killedBy: Financial - Leverage Ratios should calculate all ratios using bundled function
statusReason: Cannot read properties of undefined (reading 'debtToEquity')
