[Killed] ArithmeticOperator
src/financial/loan.ts:39:24
     rounding = RoundingMode.HALF_EVEN,
   } = options;
 
-  const periodicRate = annualRate / periodsPerYear;
+  const periodicRate = annualRate * periodsPerYear;
   let payment: Money;
 
killedBy: Financial - Loan should calculate PMT
statusReason: expected '$6,021.39' to be '$856.07' // Object.is equality

[Killed] BlockStatement
src/financial/loan.ts:42:25
   const periodicRate = annualRate / periodsPerYear;
   let payment: Money;
 
-  if (annualRate === 0) {
-    payment = principal.divide(periods, { rounding });
-  } else {
+  if (annualRate === 0) {} else {
     // PMT formula: P * (r(1+r)^n) / ((1+r)^n - 1)
     const r = periodicRate;
killedBy: Financial - Loan should calculate zero-interest loan payments using rounding
statusReason: Cannot read properties of undefined (reading 'subtract')

[Killed] ObjectLiteral
src/financial/loan.ts:43:41
   let payment: Money;
 
   if (annualRate === 0) {
-    payment = principal.divide(periods, { rounding });
+    payment = principal.divide(periods, {});
   } else {
     // PMT formula: P * (r(1+r)^n) / ((1+r)^n - 1)
killedBy: Financial - Loan should calculate zero-interest loan payments using rounding
statusReason: Rounding required for divide: result 5000.5 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] BlockStatement
src/financial/loan.ts:44:10
 
   if (annualRate === 0) {
     payment = principal.divide(periods, { rounding });
-  } else {
-    // PMT formula: P * (r(1+r)^n) / ((1+r)^n - 1)
-    const r = periodicRate;
-    const n = periods;
-    const numerator = r * Math.pow(1 + r, n);
-    const denominator = Math.pow(1 + r, n) - 1;
-    const pmtMultiplier = numerator / denominator;
-    payment = principal.multiply(pmtMultiplier, { rounding });
-  }
+  } else {}
 
   const schedule: LoanScheduleEntry[] = [];
killedBy: Financial - Loan should calculate loan schedule
statusReason: Cannot read properties of undefined (reading 'subtract')

[Killed] ArithmeticOperator
src/financial/loan.ts:48:36
     // PMT formula: P * (r(1+r)^n) / ((1+r)^n - 1)
     const r = periodicRate;
     const n = periods;
-    const numerator = r * Math.pow(1 + r, n);
+    const numerator = r * Math.pow(1 - r, n);
     const denominator = Math.pow(1 + r, n) - 1;
     const pmtMultiplier = numerator / denominator;
killedBy: Financial - Loan should calculate PMT
statusReason: expected '$774.61' to be '$856.07' // Object.is equality

[Killed] ArithmeticOperator
src/financial/loan.ts:48:23
     // PMT formula: P * (r(1+r)^n) / ((1+r)^n - 1)
     const r = periodicRate;
     const n = periods;
-    const numerator = r * Math.pow(1 + r, n);
+    const numerator = r / Math.pow(1 + r, n);
     const denominator = Math.pow(1 + r, n) - 1;
     const pmtMultiplier = numerator / denominator;
killedBy: Financial - Loan should calculate PMT
statusReason: expected '$774.77' to be '$856.07' // Object.is equality

[Killed] ArithmeticOperator
src/financial/loan.ts:49:34
     const r = periodicRate;
     const n = periods;
     const numerator = r * Math.pow(1 + r, n);
-    const denominator = Math.pow(1 + r, n) - 1;
+    const denominator = Math.pow(1 - r, n) - 1;
     const pmtMultiplier = numerator / denominator;
     payment = principal.multiply(pmtMultiplier, { rounding });
killedBy: Financial - Loan should calculate PMT
statusReason: expected '-$896.22' to be '$856.07' // Object.is equality

[Killed] ArithmeticOperator
src/financial/loan.ts:49:25
     const r = periodicRate;
     const n = periods;
     const numerator = r * Math.pow(1 + r, n);
-    const denominator = Math.pow(1 + r, n) - 1;
+    const denominator = Math.pow(1 + r, n) + 1;
     const pmtMultiplier = numerator / denominator;
     payment = principal.multiply(pmtMultiplier, { rounding });
killedBy: Financial - Loan should calculate PMT
statusReason: expected '$21.35' to be '$856.07' // Object.is equality

[Killed] ArithmeticOperator
src/financial/loan.ts:50:27
     const n = periods;
     const numerator = r * Math.pow(1 + r, n);
     const denominator = Math.pow(1 + r, n) - 1;
-    const pmtMultiplier = numerator / denominator;
+    const pmtMultiplier = numerator * denominator;
     payment = principal.multiply(pmtMultiplier, { rounding });
   }
killedBy: Financial - Loan should calculate PMT
statusReason: expected '$2.24' to be '$856.07' // Object.is equality

[Killed] ArrayDeclaration
src/financial/loan.ts:54:41
     payment = principal.multiply(pmtMultiplier, { rounding });
   }
 
-  const schedule: LoanScheduleEntry[] = [];
+  const schedule: LoanScheduleEntry[] = ["Stryker was here"];
   let balance = principal;
 
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected 13 to be 12 // Object.is equality

[Killed] EqualityOperator
src/financial/loan.ts:57:24
   const schedule: LoanScheduleEntry[] = [];
   let balance = principal;
 
-  for (let period = 1; period <= periods; period++) {
+  for (let period = 1; period < periods; period++) {
     const interest =
       annualRate === 0
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected 11 to be 12 // Object.is equality

[Killed] EqualityOperator
src/financial/loan.ts:57:24
   const schedule: LoanScheduleEntry[] = [];
   let balance = principal;
 
-  for (let period = 1; period <= periods; period++) {
+  for (let period = 1; period > periods; period++) {
     const interest =
       annualRate === 0
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected +0 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/financial/loan.ts:59:7
 
   for (let period = 1; period <= periods; period++) {
     const interest =
-      annualRate === 0
+      true
         ? Money.zero(principal.currency)
         : balance.multiply(periodicRate, { rounding });
killedBy: Financial - Loan should charge interest for non-zero interest loans
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/financial/loan.ts:59:7
 
   for (let period = 1; period <= periods; period++) {
     const interest =
-      annualRate === 0
+      annualRate !== 0
         ? Money.zero(principal.currency)
         : balance.multiply(periodicRate, { rounding });
killedBy: Financial - Loan should charge interest for non-zero interest loans
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/financial/loan.ts:61:42
     const interest =
       annualRate === 0
         ? Money.zero(principal.currency)
-        : balance.multiply(periodicRate, { rounding });
+        : balance.multiply(periodicRate, {});
 
     let principalPayment = payment.subtract(interest);
killedBy: Financial - Loan should calculate loan schedule
statusReason: Rounding required for multiply: result 4166.666666666667 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] ConditionalExpression
src/financial/loan.ts:71:9
     balance = balance.subtract(principalPayment);
 
     // Handle final period rounding adjustment
-    if (period === periods && !balance.isZero()) {
+    if (false) {
       const adjustedPrincipal = principalPayment.add(balance);
       schedule.push({
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/financial/loan.ts:71:50
     balance = balance.subtract(principalPayment);
 
     // Handle final period rounding adjustment
-    if (period === periods && !balance.isZero()) {
-      const adjustedPrincipal = principalPayment.add(balance);
-      schedule.push({
-        period,
-        payment: interest.add(adjustedPrincipal),
-        principal: adjustedPrincipal,
-        interest,
-        balance: Money.zero(principal.currency),
-      });
-    } else {
+    if (period === periods && !balance.isZero()) {} else {
       schedule.push({
         period,
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected 11 to be 12 // Object.is equality

[Killed] ObjectLiteral
src/financial/loan.ts:73:21
     // Handle final period rounding adjustment
     if (period === periods && !balance.isZero()) {
       const adjustedPrincipal = principalPayment.add(balance);
-      schedule.push({
-        period,
-        payment: interest.add(adjustedPrincipal),
-        principal: adjustedPrincipal,
-        interest,
-        balance: Money.zero(principal.currency),
-      });
+      schedule.push({});
     } else {
       schedule.push({
killedBy: Financial - Loan should calculate loan schedule
statusReason: Cannot convert undefined to a BigInt

[Killed] BlockStatement
src/financial/loan.ts:80:12
         interest,
         balance: Money.zero(principal.currency),
       });
-    } else {
-      schedule.push({
-        period,
-        payment,
-        principal: principalPayment,
-        interest,
-        balance: balance.isNegative()
-          ? Money.zero(principal.currency)
-          : balance,
-      });
-    }
+    } else {}
   }
 
killedBy: Financial - Loan should calculate loan schedule
statusReason: expected 1 to be 12 // Object.is equality

[Killed] ObjectLiteral
src/financial/loan.ts:81:21
         balance: Money.zero(principal.currency),
       });
     } else {
-      schedule.push({
-        period,
-        payment,
-        principal: principalPayment,
-        interest,
-        balance: balance.isNegative()
-          ? Money.zero(principal.currency)
-          : balance,
-      });
+      schedule.push({});
     }
   }
killedBy: Financial - Loan should calculate loan schedule
statusReason: Cannot convert undefined to a BigInt

[Killed] BlockStatement
src/financial/loan.ts:101:10
  */
 export function pmt(
   options: Omit<LoanOptions, "rounding"> & { rounding?: RoundingMode },
-): Money {
-  const schedule = loan(options);
-  return schedule[0].payment;
-}
+): Money {}
 
 /**
killedBy: Financial - Loan should calculate PMT
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] BlockStatement
src/financial/loan.ts:109:60
 /**
  * Calculates total interest over the life of the loan using the payment formula.
  */
-export function totalInterest(options: LoanOptions): Money {
-  const {
-    principal,
-    annualRate,
-    periods,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  if (annualRate === 0) {
-    return Money.zero(principal.currency);
-  }
-
-  const payment = pmt(options);
-  const totalPaid = payment.multiply(periods, { rounding });
-  return totalPaid.subtract(principal);
-}
+export function totalInterest(options: LoanOptions): Money {}
 
 /**
killedBy: Financial - Loan should calculate total interest using payment formula
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] BlockStatement
src/financial/loan.ts:117:25
     rounding = RoundingMode.HALF_EVEN,
   } = options;
 
-  if (annualRate === 0) {
-    return Money.zero(principal.currency);
-  }
+  if (annualRate === 0) {}
 
   const payment = pmt(options);
killedBy: Financial - Loan should return zero interest for zero-interest loans
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/financial/loan.ts:131:10
  */
 export function totalInterestFromSchedule(
   schedule: LoanScheduleEntry[],
-): Money {
-  if (schedule.length === 0) {
-    throw new Error("Schedule must have at least one entry");
-  }
-
-  const currency = schedule[0].interest.currency;
-  return schedule.reduce(
-    (sum, entry) => sum.add(entry.interest),
-    Money.zero(currency),
-  );
-}
+): Money {}
 
 /**
killedBy: Financial - Loan should calculate total interest from loan schedule
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/financial/loan.ts:132:30
 export function totalInterestFromSchedule(
   schedule: LoanScheduleEntry[],
 ): Money {
-  if (schedule.length === 0) {
-    throw new Error("Schedule must have at least one entry");
-  }
+  if (schedule.length === 0) {}
 
   const currency = schedule[0].interest.currency;
killedBy: Financial - Loan should throw error for empty schedule in totalInterestFromSchedule
statusReason: expected [Function] to throw error matching /Schedule must have at least one entry/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/financial/loan.ts:132:7
 export function totalInterestFromSchedule(
   schedule: LoanScheduleEntry[],
 ): Money {
-  if (schedule.length === 0) {
+  if (true) {
     throw new Error("Schedule must have at least one entry");
   }
killedBy: Financial - Loan should calculate total interest from loan schedule
statusReason: Schedule must have at least one entry

[Killed] ArrowFunction
src/financial/loan.ts:138:5
 
   const currency = schedule[0].interest.currency;
   return schedule.reduce(
-    (sum, entry) => sum.add(entry.interest),
+    () => undefined,
     Money.zero(currency),
   );
killedBy: Financial - Loan should calculate total interest from loan schedule
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/financial/loan.ts:169:74
  * // Returns $500.00 per month
  * ```
  */
-export function interestOnlyPayment(options: InterestOnlyOptions): Money {
-  const {
-    principal,
-    annualRate,
-    periodsPerYear = 12,
-    rounding = RoundingMode.HALF_EVEN,
-  } = options;
-
-  // If rate is zero, interest payment is zero
-  if (annualRate === 0) {
-    return Money.zero(principal.currency);
-  }
-
-  const periodicRate = annualRate / periodsPerYear;
-  return principal.multiply(periodicRate, { rounding });
-}
+export function interestOnlyPayment(options: InterestOnlyOptions): Money {}
 
 
killedBy: Financial - Loan Interest-Only Loans should calculate monthly interest-only payment
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] ConditionalExpression
src/financial/loan.ts:178:7
   } = options;
 
   // If rate is zero, interest payment is zero
-  if (annualRate === 0) {
+  if (true) {
     return Money.zero(principal.currency);
   }
killedBy: Financial - Loan Interest-Only Loans should calculate monthly interest-only payment
statusReason: expected '$0.00' to be '$500.00' // Object.is equality

[Killed] EqualityOperator
src/financial/loan.ts:178:7
   } = options;
 
   // If rate is zero, interest payment is zero
-  if (annualRate === 0) {
+  if (annualRate !== 0) {
     return Money.zero(principal.currency);
   }
killedBy: Financial - Loan Interest-Only Loans should calculate monthly interest-only payment
statusReason: expected '$0.00' to be '$500.00' // Object.is equality

[Killed] ObjectLiteral
src/financial/loan.ts:183:43
   }
 
   const periodicRate = annualRate / periodsPerYear;
-  return principal.multiply(periodicRate, { rounding });
+  return principal.multiply(periodicRate, {});
 }
 
killedBy: Financial - Loan Interest-Only Loans should handle commercial real estate example
statusReason: Rounding required for multiply: result 2291666.6666666665 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE
