[Killed] BlockStatement
src/financial/rate.ts:28:45
    */
   private static readonly SCALE = 10n ** 18n;
 
-  private constructor(decimalValue: bigint) {
-    this.decimalValue = decimalValue;
-  }
+  private constructor(decimalValue: bigint) {}
 
   /**
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot convert NaN to a BigInt

[Killed] BlockStatement
src/financial/rate.ts:40:50
    * @example
    * const rate = Rate.percent(5.5); // 5.5%
    */
-  static percent(percent: number | string): Rate {
-    const decimal = typeof percent === "string" ? parseFloat(percent) : percent;
-    const scaled = BigInt(Math.round((decimal / 100) * Number(Rate.SCALE)));
-    return new Rate(scaled);
-  }
+  static percent(percent: number | string): Rate {}
 
   /**
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot read properties of undefined (reading 'isZero')

[Killed] ConditionalExpression
src/financial/rate.ts:41:21
    * const rate = Rate.percent(5.5); // 5.5%
    */
   static percent(percent: number | string): Rate {
-    const decimal = typeof percent === "string" ? parseFloat(percent) : percent;
+    const decimal = false ? parseFloat(percent) : percent;
     const scaled = BigInt(Math.round((decimal / 100) * Number(Rate.SCALE)));
     return new Rate(scaled);
killedBy: Financial - Rate should parse percent strings with suffixes
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] EqualityOperator
src/financial/rate.ts:41:21
    * const rate = Rate.percent(5.5); // 5.5%
    */
   static percent(percent: number | string): Rate {
-    const decimal = typeof percent === "string" ? parseFloat(percent) : percent;
+    const decimal = typeof percent !== "string" ? parseFloat(percent) : percent;
     const scaled = BigInt(Math.round((decimal / 100) * Number(Rate.SCALE)));
     return new Rate(scaled);
killedBy: Financial - Rate should parse percent strings with suffixes
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
src/financial/rate.ts:42:38
    */
   static percent(percent: number | string): Rate {
     const decimal = typeof percent === "string" ? parseFloat(percent) : percent;
-    const scaled = BigInt(Math.round((decimal / 100) * Number(Rate.SCALE)));
+    const scaled = BigInt(Math.round(decimal / 100 / Number(Rate.SCALE)));
     return new Rate(scaled);
   }
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$0.00' to be '$100.00' // Object.is equality

[Killed] ArithmeticOperator
src/financial/rate.ts:42:39
    */
   static percent(percent: number | string): Rate {
     const decimal = typeof percent === "string" ? parseFloat(percent) : percent;
-    const scaled = BigInt(Math.round((decimal / 100) * Number(Rate.SCALE)));
+    const scaled = BigInt(Math.round((decimal * 100) * Number(Rate.SCALE)));
     return new Rate(scaled);
   }
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$1,000,000.00' to be '$100.00' // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:54:50
    * @example
    * const rate = Rate.decimal(0.055); // 5.5%
    */
-  static decimal(decimal: number | string): Rate {
-    const value = typeof decimal === "string" ? parseFloat(decimal) : decimal;
-    const scaled = BigInt(Math.round(value * Number(Rate.SCALE)));
-    return new Rate(scaled);
-  }
+  static decimal(decimal: number | string): Rate {}
 
   /**
killedBy: Financial - Simple Interest simpleInterest should respect rounding modes
statusReason: Cannot read properties of undefined (reading 'isZero')

[Killed] ConditionalExpression
src/financial/rate.ts:55:19
    * const rate = Rate.decimal(0.055); // 5.5%
    */
   static decimal(decimal: number | string): Rate {
-    const value = typeof decimal === "string" ? parseFloat(decimal) : decimal;
+    const value = false ? parseFloat(decimal) : decimal;
     const scaled = BigInt(Math.round(value * Number(Rate.SCALE)));
     return new Rate(scaled);
killedBy: Financial - Rate should parse decimal strings with suffixes
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] EqualityOperator
src/financial/rate.ts:55:19
    * const rate = Rate.decimal(0.055); // 5.5%
    */
   static decimal(decimal: number | string): Rate {
-    const value = typeof decimal === "string" ? parseFloat(decimal) : decimal;
+    const value = typeof decimal !== "string" ? parseFloat(decimal) : decimal;
     const scaled = BigInt(Math.round(value * Number(Rate.SCALE)));
     return new Rate(scaled);
killedBy: Financial - Rate should parse decimal strings with suffixes
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
src/financial/rate.ts:56:38
    */
   static decimal(decimal: number | string): Rate {
     const value = typeof decimal === "string" ? parseFloat(decimal) : decimal;
-    const scaled = BigInt(Math.round(value * Number(Rate.SCALE)));
+    const scaled = BigInt(Math.round(value / Number(Rate.SCALE)));
     return new Rate(scaled);
   }
killedBy: Financial - Simple Interest simpleInterest should respect rounding modes
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:65:23
    *
    * @returns A Rate of 0%.
    */
-  static zero(): Rate {
-    return new Rate(0n);
-  }
+  static zero(): Rate {}
 
   /**
killedBy: Financial - Simple Interest simpleInterest should handle zero rate
statusReason: Cannot read properties of undefined (reading 'isZero')

[Killed] BlockStatement
src/financial/rate.ts:74:23
    *
    * @returns The percentage value as a number.
    */
-  toPercent(): number {
-    return (Number(this.decimalValue) / Number(Rate.SCALE)) * 100;
-  }
+  toPercent(): number {}
 
   /**
killedBy: Financial - Rate should create from percent (number) and convert to decimal
statusReason: expected undefined to be close to 5, received difference is NaN, but expected 5e-13

[Killed] ArithmeticOperator
src/financial/rate.ts:75:13
    * @returns The percentage value as a number.
    */
   toPercent(): number {
-    return (Number(this.decimalValue) / Number(Rate.SCALE)) * 100;
+    return (Number(this.decimalValue) * Number(Rate.SCALE)) * 100;
   }
 
killedBy: Financial - Rate should create from percent (number) and convert to decimal
statusReason: expected 5e+36 to be close to 5, received difference is 5e+36, but expected 5e-13

[Killed] ArithmeticOperator
src/financial/rate.ts:75:12
    * @returns The percentage value as a number.
    */
   toPercent(): number {
-    return (Number(this.decimalValue) / Number(Rate.SCALE)) * 100;
+    return Number(this.decimalValue) / Number(Rate.SCALE) / 100;
   }
 
killedBy: Financial - Rate should create from percent (number) and convert to decimal
statusReason: expected 0.0005 to be close to 5, received difference is 4.9995, but expected 5e-13

[Killed] BlockStatement
src/financial/rate.ts:83:23
    *
    * @returns The decimal value as a number.
    */
-  toDecimal(): number {
-    return Number(this.decimalValue) / Number(Rate.SCALE);
-  }
+  toDecimal(): number {}
 
   /**
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot convert NaN to a BigInt

[Killed] ArithmeticOperator
src/financial/rate.ts:84:12
    * @returns The decimal value as a number.
    */
   toDecimal(): number {
-    return Number(this.decimalValue) / Number(Rate.SCALE);
+    return Number(this.decimalValue) * Number(Rate.SCALE);
   }
 
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Scientific notation not supported

[Killed] BlockStatement
src/financial/rate.ts:93:26
    * @param other - The rate to add.
    * @returns A new Rate representing the sum.
    */
-  add(other: Rate): Rate {
-    return new Rate(this.decimalValue + other.decimalValue);
-  }
+  add(other: Rate): Rate {}
 
   /**
killedBy: Financial - Rate should support add and subtract
statusReason: Cannot read properties of undefined (reading 'toPercent')

[Killed] ArithmeticOperator
src/financial/rate.ts:94:21
    * @returns A new Rate representing the sum.
    */
   add(other: Rate): Rate {
-    return new Rate(this.decimalValue + other.decimalValue);
+    return new Rate(this.decimalValue - other.decimalValue);
   }
 
killedBy: Financial - Rate should support add and subtract
statusReason: expected 3 to be close to 7, received difference is 4, but expected 5e-13

[Killed] BlockStatement
src/financial/rate.ts:103:31
    * @param other - The rate to subtract.
    * @returns A new Rate representing the difference.
    */
-  subtract(other: Rate): Rate {
-    return new Rate(this.decimalValue - other.decimalValue);
-  }
+  subtract(other: Rate): Rate {}
 
   /**
killedBy: Financial - Rate should support add and subtract
statusReason: Cannot read properties of undefined (reading 'toPercent')

[Killed] ArithmeticOperator
src/financial/rate.ts:104:21
    * @returns A new Rate representing the difference.
    */
   subtract(other: Rate): Rate {
-    return new Rate(this.decimalValue - other.decimalValue);
+    return new Rate(this.decimalValue + other.decimalValue);
   }
 
killedBy: Financial - Rate should support add and subtract
statusReason: expected 7.000000000000001 to be close to 3, received difference is 4.000000000000001, but expected 5e-13

[Killed] BlockStatement
src/financial/rate.ts:113:38
    * @param multiplier - The number to multiply by.
    * @returns A new Rate representing the product.
    */
-  multiply(multiplier: number): Rate {
-    const scaled = BigInt(Math.round(multiplier * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * scaled) / Rate.SCALE);
-  }
+  multiply(multiplier: number): Rate {}
 
   /**
killedBy: Financial - Rate should support multiply and divide
statusReason: Cannot read properties of undefined (reading 'toPercent')

[Killed] ArithmeticOperator
src/financial/rate.ts:114:38
    * @returns A new Rate representing the product.
    */
   multiply(multiplier: number): Rate {
-    const scaled = BigInt(Math.round(multiplier * Number(Rate.SCALE)));
+    const scaled = BigInt(Math.round(multiplier / Number(Rate.SCALE)));
     return new Rate((this.decimalValue * scaled) / Rate.SCALE);
   }
killedBy: Financial - Rate should support multiply and divide
statusReason: expected +0 to be close to 20, received difference is 20, but expected 5e-11

[Killed] ArithmeticOperator
src/financial/rate.ts:115:22
    */
   multiply(multiplier: number): Rate {
     const scaled = BigInt(Math.round(multiplier * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * scaled) / Rate.SCALE);
+    return new Rate((this.decimalValue / scaled) / Rate.SCALE);
   }
 
killedBy: Financial - Rate should support multiply and divide
statusReason: expected +0 to be close to 20, received difference is 20, but expected 5e-11

[Killed] ArithmeticOperator
src/financial/rate.ts:115:21
    */
   multiply(multiplier: number): Rate {
     const scaled = BigInt(Math.round(multiplier * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * scaled) / Rate.SCALE);
+    return new Rate(this.decimalValue * scaled * Rate.SCALE);
   }
 
killedBy: Financial - Rate should support multiply and divide
statusReason: expected 2e+37 to be close to 20, received difference is 2e+37, but expected 5e-11

[Killed] BlockStatement
src/financial/rate.ts:124:33
    * @param divisor - The number to divide by.
    * @returns A new Rate representing the quotient.
    */
-  divide(divisor: number): Rate {
-    const scaled = BigInt(Math.round(divisor * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * Rate.SCALE) / scaled);
-  }
+  divide(divisor: number): Rate {}
 
   /**
killedBy: Financial - Rate should support multiply and divide
statusReason: Cannot read properties of undefined (reading 'toPercent')

[Killed] ArithmeticOperator
src/financial/rate.ts:125:38
    * @returns A new Rate representing the quotient.
    */
   divide(divisor: number): Rate {
-    const scaled = BigInt(Math.round(divisor * Number(Rate.SCALE)));
+    const scaled = BigInt(Math.round(divisor / Number(Rate.SCALE)));
     return new Rate((this.decimalValue * Rate.SCALE) / scaled);
   }
killedBy: Financial - Rate should support multiply and divide
statusReason: Division by zero

[Killed] ArithmeticOperator
src/financial/rate.ts:126:21
    */
   divide(divisor: number): Rate {
     const scaled = BigInt(Math.round(divisor * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * Rate.SCALE) / scaled);
+    return new Rate(this.decimalValue * Rate.SCALE * scaled);
   }
 
killedBy: Financial - Rate should support multiply and divide
statusReason: expected 2e+37 to be close to 5, received difference is 2e+37, but expected 5e-11

[Killed] ArithmeticOperator
src/financial/rate.ts:126:22
    */
   divide(divisor: number): Rate {
     const scaled = BigInt(Math.round(divisor * Number(Rate.SCALE)));
-    return new Rate((this.decimalValue * Rate.SCALE) / scaled);
+    return new Rate((this.decimalValue / Rate.SCALE) / scaled);
   }
 
killedBy: Financial - Rate should support multiply and divide
statusReason: expected +0 to be close to 5, received difference is 5, but expected 5e-11

[Killed] BlockStatement
src/financial/rate.ts:135:32
    * @param other - The rate to compare.
    * @returns True if the rates are equal.
    */
-  equals(other: Rate): boolean {
-    return this.decimalValue === other.decimalValue;
-  }
+  equals(other: Rate): boolean {}
 
   /**
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/financial/rate.ts:136:12
    * @returns True if the rates are equal.
    */
   equals(other: Rate): boolean {
-    return this.decimalValue === other.decimalValue;
+    return true;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:136:12
    * @returns True if the rates are equal.
    */
   equals(other: Rate): boolean {
-    return this.decimalValue === other.decimalValue;
+    return this.decimalValue !== other.decimalValue;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:145:37
    * @param other - The rate to compare.
    * @returns True if this rate is greater.
    */
-  greaterThan(other: Rate): boolean {
-    return this.decimalValue > other.decimalValue;
-  }
+  greaterThan(other: Rate): boolean {}
 
   /**
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:146:12
    * @returns True if this rate is greater.
    */
   greaterThan(other: Rate): boolean {
-    return this.decimalValue > other.decimalValue;
+    return this.decimalValue <= other.decimalValue;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/financial/rate.ts:146:12
    * @returns True if this rate is greater.
    */
   greaterThan(other: Rate): boolean {
-    return this.decimalValue > other.decimalValue;
+    return true;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:155:34
    * @param other - The rate to compare.
    * @returns True if this rate is less.
    */
-  lessThan(other: Rate): boolean {
-    return this.decimalValue < other.decimalValue;
-  }
+  lessThan(other: Rate): boolean {}
 
   /**
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:156:12
    * @returns True if this rate is less.
    */
   lessThan(other: Rate): boolean {
-    return this.decimalValue < other.decimalValue;
+    return this.decimalValue >= other.decimalValue;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:156:12
    * @returns True if this rate is less.
    */
   lessThan(other: Rate): boolean {
-    return this.decimalValue < other.decimalValue;
+    return this.decimalValue <= other.decimalValue;
   }
 
killedBy: Financial - Rate should support comparisons and equality
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:164:21
    *
    * @returns True if the rate is 0%.
    */
-  isZero(): boolean {
-    return this.decimalValue === 0n;
-  }
+  isZero(): boolean {}
 
   /**
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:165:12
    * @returns True if the rate is 0%.
    */
   isZero(): boolean {
-    return this.decimalValue === 0n;
+    return this.decimalValue !== 0n;
   }
 
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/financial/rate.ts:165:12
    * @returns True if the rate is 0%.
    */
   isZero(): boolean {
-    return this.decimalValue === 0n;
+    return false;
   }
 
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:173:25
    *
    * @returns True if the rate is negative.
    */
-  isNegative(): boolean {
-    return this.decimalValue < 0n;
-  }
+  isNegative(): boolean {}
 
   /**
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/financial/rate.ts:174:12
    * @returns True if the rate is negative.
    */
   isNegative(): boolean {
-    return this.decimalValue < 0n;
+    return this.decimalValue >= 0n;
   }
 
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/financial/rate.ts:174:12
    * @returns True if the rate is negative.
    */
   isNegative(): boolean {
-    return this.decimalValue < 0n;
+    return false;
   }
 
killedBy: Financial - Rate should detect zero and negative rates
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:182:22
    *
    * @returns The rate as a percentage string (e.g., "5.5%").
    */
-  toString(): string {
-    return `${this.toPercent()}%`;
-  }
+  toString(): string {}
 
   /**
killedBy: Financial - Rate should format as percent string
statusReason: expected undefined to be '5%' // Object.is equality

[Killed] StringLiteral
src/financial/rate.ts:183:12
    * @returns The rate as a percentage string (e.g., "5.5%").
    */
   toString(): string {
-    return `${this.toPercent()}%`;
+    return ``;
   }
 
killedBy: Financial - Rate should format as percent string
statusReason: expected '' to be '5%' // Object.is equality

[Killed] BlockStatement
src/financial/rate.ts:194:43
    * @example
    * Rate.percent(10).compoundFactor(3); // (1.10)^3 = 1.331
    */
-  compoundFactor(periods: number): number {
-    return Math.pow(1 + this.toDecimal(), periods);
-  }
+  compoundFactor(periods: number): number {}
 
   /**
killedBy: Financial - Rate should compute compound factor
statusReason: expected undefined to be close to 1.331, received difference is NaN, but expected 5e-7

[Killed] ArithmeticOperator
src/financial/rate.ts:195:21
    * Rate.percent(10).compoundFactor(3); // (1.10)^3 = 1.331
    */
   compoundFactor(periods: number): number {
-    return Math.pow(1 + this.toDecimal(), periods);
+    return Math.pow(1 - this.toDecimal(), periods);
   }
 
killedBy: Financial - Rate should compute compound factor
statusReason: expected 0.7290000000000001 to be close to 1.331, received difference is 0.6019999999999999, but expected 5e-7

[Killed] BlockStatement
src/financial/rate.ts:206:42
    * @example
    * Rate.percent(12).periodic(12); // 1% monthly
    */
-  periodic(periodsPerYear: number): Rate {
-    return this.divide(periodsPerYear);
-  }
+  periodic(periodsPerYear: number): Rate {}
 
   /**
killedBy: Financial - Rate should compute periodic rate
statusReason: Cannot read properties of undefined (reading 'toPercent')

[Killed] BlockStatement
src/financial/rate.ts:216:43
    * @param periodsPerYear - Number of compounding periods per year.
    * @returns The nominal annual rate.
    */
-  toNominal(periodsPerYear: number): Rate {
-    const effectiveDecimal = this.toDecimal();
-    const nominalDecimal =
-      periodsPerYear * (Math.pow(1 + effectiveDecimal, 1 / periodsPerYear) - 1);
-    return Rate.decimal(nominalDecimal);
-  }
+  toNominal(periodsPerYear: number): Rate {}
 
   /**
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: Cannot read properties of undefined (reading 'toEffective')

[Killed] ArithmeticOperator
src/financial/rate.ts:219:34
   toNominal(periodsPerYear: number): Rate {
     const effectiveDecimal = this.toDecimal();
     const nominalDecimal =
-      periodsPerYear * (Math.pow(1 + effectiveDecimal, 1 / periodsPerYear) - 1);
+      periodsPerYear * (Math.pow(1 - effectiveDecimal, 1 / periodsPerYear) - 1);
     return Rate.decimal(nominalDecimal);
   }
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: expected -0.11999999999999977 to be close to 0.12, received difference is 0.23999999999999977, but expected 5e-9

[Killed] ArithmeticOperator
src/financial/rate.ts:219:56
   toNominal(periodsPerYear: number): Rate {
     const effectiveDecimal = this.toDecimal();
     const nominalDecimal =
-      periodsPerYear * (Math.pow(1 + effectiveDecimal, 1 / periodsPerYear) - 1);
+      periodsPerYear * (Math.pow(1 + effectiveDecimal, 1 * periodsPerYear) - 1);
     return Rate.decimal(nominalDecimal);
   }
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: expected 12229120.630690925 to be close to 0.12, received difference is 12229120.510690926, but expected 5e-9

[Killed] BlockStatement
src/financial/rate.ts:229:45
    * @param periodsPerYear - Number of compounding periods per year.
    * @returns The effective annual rate.
    */
-  toEffective(periodsPerYear: number): Rate {
-    const nominalDecimal = this.toDecimal();
-    const effectiveDecimal =
-      Math.pow(1 + nominalDecimal / periodsPerYear, periodsPerYear) - 1;
-    return Rate.decimal(effectiveDecimal);
-  }
+  toEffective(periodsPerYear: number): Rate {}
 
   /**
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: Cannot read properties of undefined (reading 'toDecimal')

[Killed] ArithmeticOperator
src/financial/rate.ts:232:20
   toEffective(periodsPerYear: number): Rate {
     const nominalDecimal = this.toDecimal();
     const effectiveDecimal =
-      Math.pow(1 + nominalDecimal / periodsPerYear, periodsPerYear) - 1;
+      Math.pow(1 + nominalDecimal * periodsPerYear, periodsPerYear) - 1;
     return Rate.decimal(effectiveDecimal);
   }
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: expected 30832.82829256086 to be close to 0.12, received difference is 30832.70829256086, but expected 5e-9

[Killed] ArithmeticOperator
src/financial/rate.ts:232:7
   toEffective(periodsPerYear: number): Rate {
     const nominalDecimal = this.toDecimal();
     const effectiveDecimal =
-      Math.pow(1 + nominalDecimal / periodsPerYear, periodsPerYear) - 1;
+      Math.pow(1 + nominalDecimal / periodsPerYear, periodsPerYear) + 1;
     return Rate.decimal(effectiveDecimal);
   }
killedBy: Financial - Rate should convert effective <-> nominal
statusReason: expected 2.120000000000001 to be close to 0.12, received difference is 2.000000000000001, but expected 5e-9

[Killed] BlockStatement
src/financial/rate.ts:239:50
   /**
    * Returns a JSON representation.
    */
-  toJSON(): { percent: number; decimal: number } {
-    return {
-      percent: this.toPercent(),
-      decimal: this.toDecimal(),
-    };
-  }
+  toJSON(): { percent: number; decimal: number } {}
 }
 
killedBy: Financial - Rate should produce JSON
statusReason: Cannot read properties of undefined (reading 'percent')
