[Killed] BlockStatement
src/financial/simple.ts:40:10
 export function simpleInterest(
   principal: Money,
   options: SimpleInterestOptions
-): Money {
-  const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
-  
-  // Handle edge cases
-  if (rate.isZero() || years === 0) {
-    return Money.zero(principal.currency);
-  }
-  
-  // Simple Interest = Principal × Rate × Time
-  const interestMultiplier = rate.toDecimal() * years;
-  
-  return principal.multiply(interestMultiplier, { rounding });
-}
+): Money {}
 
 /**
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] EqualityOperator
src/financial/simple.ts:44:24
   const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
   
   // Handle edge cases
-  if (rate.isZero() || years === 0) {
+  if (rate.isZero() || years !== 0) {
     return Money.zero(principal.currency);
   }
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$0.00' to be '$100.00' // Object.is equality

[Killed] ConditionalExpression
src/financial/simple.ts:44:7
   const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
   
   // Handle edge cases
-  if (rate.isZero() || years === 0) {
+  if (true) {
     return Money.zero(principal.currency);
   }
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$0.00' to be '$100.00' // Object.is equality

[Killed] ArithmeticOperator
src/financial/simple.ts:49:30
   }
   
   // Simple Interest = Principal × Rate × Time
-  const interestMultiplier = rate.toDecimal() * years;
+  const interestMultiplier = rate.toDecimal() / years;
   
   return principal.multiply(interestMultiplier, { rounding });
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$25.00' to be '$100.00' // Object.is equality

[Killed] ObjectLiteral
src/financial/simple.ts:51:49
   // Simple Interest = Principal × Rate × Time
   const interestMultiplier = rate.toDecimal() * years;
   
-  return principal.multiply(interestMultiplier, { rounding });
+  return principal.multiply(interestMultiplier, {});
 }
 
killedBy: Financial - Simple Interest simpleInterest should respect rounding modes
statusReason: Rounding required for multiply: result 0.3333333333333333 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] BlockStatement
src/financial/simple.ts:81:10
 export function simpleInterestTotal(
   principal: Money,
   options: SimpleInterestOptions
-): Money {
-  const { rate, years, rounding = RoundingMode.HALF_EVEN } = options;
-  
-  // Handle edge cases
-  if (rate.isZero() || years === 0) {
-    return principal;
-  }
-  
-  // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + (rate.toDecimal() * years);
-  
-  return principal.multiply(totalMultiplier, { rounding });
-}
+): Money {}
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: Cannot read properties of undefined (reading 'format')

[Killed] ArithmeticOperator
src/financial/simple.ts:90:32
   }
   
   // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + (rate.toDecimal() * years);
+  const totalMultiplier = 1 + (rate.toDecimal() / years);
   
   return principal.multiply(totalMultiplier, { rounding });
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: expected '$1,025.00' to be '$1,100.00' // Object.is equality

[Killed] ArithmeticOperator
src/financial/simple.ts:90:27
   }
   
   // Total Amount = Principal × (1 + rate × time)
-  const totalMultiplier = 1 + (rate.toDecimal() * years);
+  const totalMultiplier = 1 - rate.toDecimal() * years;
   
   return principal.multiply(totalMultiplier, { rounding });
killedBy: Financial - Simple Interest simpleInterestTotal should calculate total amount with known values
statusReason: expected '$900.00' to be '$1,100.00' // Object.is equality
