[Killed] LogicalOperator
src/format/formatter.ts:48:18
  * @returns The formatted string.
  */
 export function format(money: Money, options?: FormatOptions): string {
-  const locale = options?.locale || money.currency.locale || "en-US";
+  const locale = (options?.locale || money.currency.locale) && "en-US";
   const showSymbol = options?.symbol ?? true;
   const display = options?.display || "symbol";
killedBy: Financial - Simple Interest simpleInterest should handle different currencies
statusReason: expected '€40.00' to be '40,00 €' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:48:18
  * @returns The formatted string.
  */
 export function format(money: Money, options?: FormatOptions): string {
-  const locale = options?.locale || money.currency.locale || "en-US";
+  const locale = true;
   const showSymbol = options?.symbol ?? true;
   const display = options?.display || "symbol";
killedBy: Financial - Simple Interest simpleInterest should handle different currencies
statusReason: expected '€40.00' to be '40,00 €' // Object.is equality

[Killed] OptionalChaining
src/format/formatter.ts:49:22
  */
 export function format(money: Money, options?: FormatOptions): string {
   const locale = options?.locale || money.currency.locale || "en-US";
-  const showSymbol = options?.symbol ?? true;
+  const showSymbol = options.symbol ?? true;
   const display = options?.display || "symbol";
   const useAccounting = options?.accounting ?? false;
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot read properties of undefined (reading 'symbol')

[Killed] LogicalOperator
src/format/formatter.ts:49:22
  */
 export function format(money: Money, options?: FormatOptions): string {
   const locale = options?.locale || money.currency.locale || "en-US";
-  const showSymbol = options?.symbol ?? true;
+  const showSymbol = options?.symbol && true;
   const display = options?.display || "symbol";
   const useAccounting = options?.accounting ?? false;
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '200.00' to be '$200.00' // Object.is equality

[Killed] LogicalOperator
src/format/formatter.ts:50:19
 export function format(money: Money, options?: FormatOptions): string {
   const locale = options?.locale || money.currency.locale || "en-US";
   const showSymbol = options?.symbol ?? true;
-  const display = options?.display || "symbol";
+  const display = options?.display && "symbol";
   const useAccounting = options?.accounting ?? false;
 
killedBy: Formatter should support display=code
statusReason: expected '$1.00' to contain 'USD'

[Killed] ConditionalExpression
src/format/formatter.ts:50:19
 export function format(money: Money, options?: FormatOptions): string {
   const locale = options?.locale || money.currency.locale || "en-US";
   const showSymbol = options?.symbol ?? true;
-  const display = options?.display || "symbol";
+  const display = true;
   const useAccounting = options?.accounting ?? false;
 
killedBy: Financial - Loan should calculate PMT
statusReason: expected 'USD856.07' to be '$856.07' // Object.is equality

[Killed] BooleanLiteral
src/format/formatter.ts:51:48
   const locale = options?.locale || money.currency.locale || "en-US";
   const showSymbol = options?.symbol ?? true;
   const display = options?.display || "symbol";
-  const useAccounting = options?.accounting ?? false;
+  const useAccounting = options?.accounting ?? true;
 
   const decimals = money.currency.decimals;
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected '(?1,234.56)' to be '-?1,234.56' // Object.is equality

[Killed] OptionalChaining
src/format/formatter.ts:51:25
   const locale = options?.locale || money.currency.locale || "en-US";
   const showSymbol = options?.symbol ?? true;
   const display = options?.display || "symbol";
-  const useAccounting = options?.accounting ?? false;
+  const useAccounting = options.accounting ?? false;
 
   const decimals = money.currency.decimals;
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot read properties of undefined (reading 'accounting')

[Killed] ConditionalExpression
src/format/formatter.ts:55:22
 
   const decimals = money.currency.decimals;
   const minor = money.minor;
-  const isNegative = minor < 0n;
+  const isNegative = true;
   const absMinor = isNegative ? -minor : minor;
 
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '-$-100.00' to be '$100.00' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:55:22
 
   const decimals = money.currency.decimals;
   const minor = money.minor;
-  const isNegative = minor < 0n;
+  const isNegative = false;
   const absMinor = isNegative ? -minor : minor;
 
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected '$-1,234.-56' to be '-$1,234.56' // Object.is equality

[Killed] UnaryOperator
src/format/formatter.ts:56:33
   const decimals = money.currency.decimals;
   const minor = money.minor;
   const isNegative = minor < 0n;
-  const absMinor = isNegative ? -minor : minor;
+  const absMinor = isNegative ? +minor : minor;
 
   const divisor = 10n ** BigInt(decimals);
killedBy: Formatter should format negative with symbol without accounting
statusReason: Cannot convert a BigInt value to a number

[Killed] ArithmeticOperator
src/format/formatter.ts:59:23
   const absMinor = isNegative ? -minor : minor;
 
   const divisor = 10n ** BigInt(decimals);
-  const integerPart = absMinor / divisor;
+  const integerPart = absMinor * divisor;
   const fractionalPart = absMinor % divisor;
 
killedBy: Tokens - defineToken should work with Money
statusReason: expected 'Ξ 1,500,000,000,000,000,000,000,000,0…' to be 'Ξ 1.500000000000000000' // Object.is equality

[Killed] ArithmeticOperator
src/format/formatter.ts:60:26
 
   const divisor = 10n ** BigInt(decimals);
   const integerPart = absMinor / divisor;
-  const fractionalPart = absMinor % divisor;
+  const fractionalPart = absMinor * divisor;
 
   // Pad fractional
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '$200.2000000' to be '$200.00' // Object.is equality

[Killed] OptionalChaining
src/format/formatter.ts:73:5
   }).formatToParts(1.1);
 
   const decimalSeparator =
-    parts.find((p) => p.type === "decimal")?.value || ".";
+    parts.find(p => p.type === "decimal").value || ".";
 
   // Format integer part with grouping using Intl (supports BigInt)
killedBy: Formatter should pass Intl options when deriving separators and grouping
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/format/formatter.ts:73:5
   }).formatToParts(1.1);
 
   const decimalSeparator =
-    parts.find((p) => p.type === "decimal")?.value || ".";
+    false;
 
   // Format integer part with grouping using Intl (supports BigInt)
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '$100false00' to be '$100.00' // Object.is equality

[Killed] BooleanLiteral
src/format/formatter.ts:78:18
   // Format integer part with grouping using Intl (supports BigInt)
   const integerFormatted = new Intl.NumberFormat(locale, {
     style: "decimal",
-    useGrouping: true,
+    useGrouping: false,
   }).format(integerPart);
 
killedBy: Financial - Simple Interest simpleInterest should handle large principal amounts
statusReason: expected '$11000.00' to be '$11,000.00' // Object.is equality

[Killed] EqualityOperator
src/format/formatter.ts:82:5
   }).format(integerPart);
 
   const absString =
-    decimals > 0
+    decimals >= 0
       ? `${integerFormatted}${decimalSeparator}${fractionalStr}`
       : integerFormatted;
killedBy: Formatter should format currencies with 0 decimals
statusReason: expected '¥1,234.0' not to contain '.'

[Killed] ConditionalExpression
src/format/formatter.ts:82:5
   }).format(integerPart);
 
   const absString =
-    decimals > 0
+    false
       ? `${integerFormatted}${decimalSeparator}${fractionalStr}`
       : integerFormatted;
killedBy: Formatter should format money correctly
statusReason: expected '$1,234' to be '$1,234.56' // Object.is equality

[Killed] StringLiteral
src/format/formatter.ts:83:9
 
   const absString =
     decimals > 0
-      ? `${integerFormatted}${decimalSeparator}${fractionalStr}`
+      ? ``
       : integerFormatted;
 
killedBy: Financial - Compound Interest should calculate future value
statusReason: expected '$' to be '$1,628.89' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:86:20
       ? `${integerFormatted}${decimalSeparator}${fractionalStr}`
       : integerFormatted;
 
-  if (!showSymbol) {
-    if (isNegative) {
-      return useAccounting ? `(${absString})` : `-${absString}`;
-    }
-    return absString;
-  }
+  if (!showSymbol) {}
 
   // Use formatToParts to get the template (sign position, currency position)
killedBy: Formatter should format without currency symbol
statusReason: expected '$1,234.56' to be '1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:86:7
       ? `${integerFormatted}${decimalSeparator}${fractionalStr}`
       : integerFormatted;
 
-  if (!showSymbol) {
+  if (true) {
     if (isNegative) {
       return useAccounting ? `(${absString})` : `-${absString}`;
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: expected '100.00' to be '$100.00' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:87:9
       : integerFormatted;
 
   if (!showSymbol) {
-    if (isNegative) {
+    if (false) {
       return useAccounting ? `(${absString})` : `-${absString}`;
     }
killedBy: Formatter should format negative without symbol and without accounting
statusReason: expected '1,234.56' to be '-1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:87:21
       : integerFormatted;
 
   if (!showSymbol) {
-    if (isNegative) {
-      return useAccounting ? `(${absString})` : `-${absString}`;
-    }
+    if (isNegative) {}
     return absString;
   }
killedBy: Formatter should format negative without symbol and without accounting
statusReason: expected '1,234.56' to be '-1,234.56' // Object.is equality

[Killed] StringLiteral
src/format/formatter.ts:88:49
 
   if (!showSymbol) {
     if (isNegative) {
-      return useAccounting ? `(${absString})` : `-${absString}`;
+      return useAccounting ? `(${absString})` : ``;
     }
     return absString;
killedBy: Formatter should format negative without symbol and without accounting
statusReason: expected '' to be '-1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:95:7
 
   // Use formatToParts to get the template (sign position, currency position)
   let templateParts: Intl.NumberFormatPart[];
-  try {
-    templateParts = new Intl.NumberFormat(locale, {
-      style: "currency",
-      currency: money.currency.code,
-      currencyDisplay: display,
-    }).formatToParts(isNegative ? -1234.5 : 1234.5);
-  } catch (e) {
+  try {} catch (e) {
     // Fallback for custom currencies or invalid codes
     const symbol =
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: templateParts is not iterable

[Killed] UnaryOperator
src/format/formatter.ts:100:35
       style: "currency",
       currency: money.currency.code,
       currencyDisplay: display,
-    }).formatToParts(isNegative ? -1234.5 : 1234.5);
+    }).formatToParts(isNegative ? +1234.5 : 1234.5);
   } catch (e) {
     // Fallback for custom currencies or invalid codes
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected '$1,234.56' to be '-$1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:101:15
       currency: money.currency.code,
       currencyDisplay: display,
     }).formatToParts(isNegative ? -1234.5 : 1234.5);
-  } catch (e) {
-    // Fallback for custom currencies or invalid codes
-    const symbol =
-      display === "symbol" ? money.currency.symbol : money.currency.code;
-    if (isNegative) {
-      return useAccounting
-        ? `(${symbol}${absString})`
-        : `-${symbol}${absString}`;
-    }
-    return `${symbol}${absString}`;
-  }
+  } catch (e) {}
 
   let result = "";
killedBy: Formatter should fall back for invalid currency codes
statusReason: templateParts is not iterable

[Killed] EqualityOperator
src/format/formatter.ts:104:7
   } catch (e) {
     // Fallback for custom currencies or invalid codes
     const symbol =
-      display === "symbol" ? money.currency.symbol : money.currency.code;
+      display !== "symbol" ? money.currency.symbol : money.currency.code;
     if (isNegative) {
       return useAccounting
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected 'US1,234.56' to be '?1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:104:7
   } catch (e) {
     // Fallback for custom currencies or invalid codes
     const symbol =
-      display === "symbol" ? money.currency.symbol : money.currency.code;
+      true ? money.currency.symbol : money.currency.code;
     if (isNegative) {
       return useAccounting
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected '?1,234.56' to be 'US1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:105:21
     // Fallback for custom currencies or invalid codes
     const symbol =
       display === "symbol" ? money.currency.symbol : money.currency.code;
-    if (isNegative) {
-      return useAccounting
-        ? `(${symbol}${absString})`
-        : `-${symbol}${absString}`;
-    }
+    if (isNegative) {}
     return `${symbol}${absString}`;
   }
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected '?1,234.56' to be '-?1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:105:9
     // Fallback for custom currencies or invalid codes
     const symbol =
       display === "symbol" ? money.currency.symbol : money.currency.code;
-    if (isNegative) {
+    if (false) {
       return useAccounting
         ? `(${symbol}${absString})`
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected '?1,234.56' to be '-?1,234.56' // Object.is equality

[Killed] StringLiteral
src/format/formatter.ts:107:11
       display === "symbol" ? money.currency.symbol : money.currency.code;
     if (isNegative) {
       return useAccounting
-        ? `(${symbol}${absString})`
+        ? ``
         : `-${symbol}${absString}`;
     }
killedBy: Formatter should fall back for invalid currency codes
statusReason: expected '' to be '(?1,234.56)' // Object.is equality

[Killed] BooleanLiteral
src/format/formatter.ts:114:24
   }
 
   let result = "";
-  let numberInserted = false;
+  let numberInserted = true;
 
   for (const part of templateParts) {
killedBy: Formatter should format money correctly
statusReason: expected '$' to be '$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:118:7
 
   for (const part of templateParts) {
     switch (part.type) {
-      case "minusSign": {
-        // Skip the minus sign, we'll handle it later for accounting format
-        if (!useAccounting) {
-          result += part.value;
-        }
-        break;
-      }
+      case "minusSign":
 
       case "integer": {
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected '1,234.56$' to be '-$1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:118:25
 
   for (const part of templateParts) {
     switch (part.type) {
-      case "minusSign": {
-        // Skip the minus sign, we'll handle it later for accounting format
-        if (!useAccounting) {
-          result += part.value;
-        }
-        break;
-      }
+      case "minusSign": {}
 
       case "integer": {
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected '1,234.56$' to be '-$1,234.56' // Object.is equality

[Killed] BooleanLiteral
src/format/formatter.ts:120:13
     switch (part.type) {
       case "minusSign": {
         // Skip the minus sign, we'll handle it later for accounting format
-        if (!useAccounting) {
+        if (useAccounting) {
           result += part.value;
         }
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected '$1,234.56' to be '-$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:120:13
     switch (part.type) {
       case "minusSign": {
         // Skip the minus sign, we'll handle it later for accounting format
-        if (!useAccounting) {
+        if (true) {
           result += part.value;
         }
killedBy: Formatter should trim template whitespace when using accounting format
statusReason: expected '(-$1.00)' to be '($1.00)' // Object.is equality

[Killed] AssignmentOperator
src/format/formatter.ts:121:11
       case "minusSign": {
         // Skip the minus sign, we'll handle it later for accounting format
         if (!useAccounting) {
-          result += part.value;
+          result -= part.value;
         }
         break;
killedBy: Formatter should format negative with symbol without accounting
statusReason: expected 'NaN$1,234.56' to be '-$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:126:7
         break;
       }
 
-      case "integer": {
-        if (!numberInserted) {
-          result += absString;
-          numberInserted = true;
-        }
-        break;
-      }
+      case "integer":
+
+// Skip the remaining numeric parts, since we already inserted the full number string.
 
       // Skip the remaining numeric parts, since we already inserted the full number string.
killedBy: Formatter should format money correctly
statusReason: expected '$' to be '$1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:126:23
         break;
       }
 
-      case "integer": {
-        if (!numberInserted) {
-          result += absString;
-          numberInserted = true;
-        }
-        break;
-      }
+      case "integer": {}
 
       // Skip the remaining numeric parts, since we already inserted the full number string.
killedBy: Formatter should format money correctly
statusReason: expected '$' to be '$1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:127:30
       }
 
       case "integer": {
-        if (!numberInserted) {
-          result += absString;
-          numberInserted = true;
-        }
+        if (!numberInserted) {}
         break;
       }
killedBy: Formatter should format money correctly
statusReason: expected '$' to be '$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:127:13
       }
 
       case "integer": {
-        if (!numberInserted) {
+        if (true) {
           result += absString;
           numberInserted = true;
killedBy: Formatter should format money correctly
statusReason: expected '$1,234.561,234.56' to be '$1,234.56' // Object.is equality

[Killed] AssignmentOperator
src/format/formatter.ts:128:11
 
       case "integer": {
         if (!numberInserted) {
-          result += absString;
+          result -= absString;
           numberInserted = true;
         }
killedBy: Formatter should format money correctly
statusReason: expected NaN to be '$1,234.56' // Object.is equality

[Killed] BooleanLiteral
src/format/formatter.ts:129:28
       case "integer": {
         if (!numberInserted) {
           result += absString;
-          numberInserted = true;
+          numberInserted = false;
         }
         break;
killedBy: Formatter should format money correctly
statusReason: expected '$1,234.561,234.56' to be '$1,234.56' // Object.is equality

[Killed] StringLiteral
src/format/formatter.ts:136:12
 
       // Skip the remaining numeric parts, since we already inserted the full number string.
       case "group":
-      case "decimal":
+      case "":
       case "fraction": {
         break;
killedBy: Financial - Compound Interest should calculate future value
statusReason: expected '$1,628.89.' to be '$1,628.89' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:137:24
       // Skip the remaining numeric parts, since we already inserted the full number string.
       case "group":
       case "decimal":
-      case "fraction": {
-        break;
-      }
+      case "fraction": {}
 
       case "currency": {
killedBy: Formatter should format money correctly
statusReason: expected '$1,234.56$$$' to be '$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:137:7
       // Skip the remaining numeric parts, since we already inserted the full number string.
       case "group":
       case "decimal":
-      case "fraction": {
-        break;
-      }
+      case "fraction":
 
       case "currency": {
killedBy: Formatter should format money correctly
statusReason: expected '$1,234.56$$$' to be '$1,234.56' // Object.is equality

[Killed] ConditionalExpression
src/format/formatter.ts:141:7
         break;
       }
 
-      case "currency": {
-        if (display === "symbol" && money.currency.symbol) {
-          result += money.currency.symbol;
-        } else {
-          result += part.value;
-        }
-        break;
-      }
+      case "currency":
 
       default: {
killedBy: Formatter should format currencies with 0 decimals
statusReason: expected '￥1,234' to contain '¥'

[Killed] BlockStatement
src/format/formatter.ts:141:24
         break;
       }
 
-      case "currency": {
-        if (display === "symbol" && money.currency.symbol) {
-          result += money.currency.symbol;
-        } else {
-          result += part.value;
-        }
-        break;
-      }
+      case "currency": {}
 
       default: {
killedBy: Formatter should format currencies with 0 decimals
statusReason: expected '￥1,234' to contain '¥'

[Killed] ConditionalExpression
src/format/formatter.ts:142:13
       }
 
       case "currency": {
-        if (display === "symbol" && money.currency.symbol) {
+        if (false) {
           result += money.currency.symbol;
         } else {
killedBy: Formatter should format currencies with 0 decimals
statusReason: expected '￥1,234' to contain '¥'

[Killed] LogicalOperator
src/format/formatter.ts:142:13
       }
 
       case "currency": {
-        if (display === "symbol" && money.currency.symbol) {
+        if (display === "symbol" || money.currency.symbol) {
           result += money.currency.symbol;
         } else {
killedBy: Formatter should support display=code
statusReason: expected '$ 1.00' to contain 'USD'

[Killed] AssignmentOperator
src/format/formatter.ts:143:11
 
       case "currency": {
         if (display === "symbol" && money.currency.symbol) {
-          result += money.currency.symbol;
+          result -= money.currency.symbol;
         } else {
           result += part.value;
killedBy: Financial - Compound Interest should calculate future value
statusReason: expected 'NaN1,628.89' to be '$1,628.89' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:144:16
       case "currency": {
         if (display === "symbol" && money.currency.symbol) {
           result += money.currency.symbol;
-        } else {
-          result += part.value;
-        }
+        } else {}
         break;
       }
killedBy: Formatter should support display=code
statusReason: expected ' 1.00' to contain 'USD'

[Killed] AssignmentOperator
src/format/formatter.ts:145:11
         if (display === "symbol" && money.currency.symbol) {
           result += money.currency.symbol;
         } else {
-          result += part.value;
+          result -= part.value;
         }
         break;
killedBy: Formatter should support display=code
statusReason: expected 'NaN 1.00' to contain 'USD'

[Killed] ConditionalExpression
src/format/formatter.ts:150:7
         break;
       }
 
-      default: {
-        result += part.value; // literals, parentheses, etc.
-        break;
-      }
+      default:
     }
   }
killedBy: Financial - Simple Interest simpleInterest should handle different currencies
statusReason: expected '40,00€' to be '40,00 €' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:150:16
         break;
       }
 
-      default: {
-        result += part.value; // literals, parentheses, etc.
-        break;
-      }
+      default: {}
     }
   }
killedBy: Tokens - defineToken should work with Money
statusReason: expected 'Ξ1.500000000000000000' to be 'Ξ 1.500000000000000000' // Object.is equality

[Killed] AssignmentOperator
src/format/formatter.ts:151:9
       }
 
       default: {
-        result += part.value; // literals, parentheses, etc.
+        result -= part.value; // literals, parentheses, etc.
         break;
       }
killedBy: Formatter should support display=code
statusReason: expected 'NaN1.00' to contain 'USD'

[Killed] ConditionalExpression
src/format/formatter.ts:158:7
   }
 
   // Apply accounting format if negative
-  if (useAccounting && isNegative) {
+  if (true) {
     return `(${result.trim()})`;
   }
killedBy: Formatter should format money correctly
statusReason: expected '($1,234.56)' to be '$1,234.56' // Object.is equality

[Killed] BlockStatement
src/format/formatter.ts:158:36
   }
 
   // Apply accounting format if negative
-  if (useAccounting && isNegative) {
-    return `(${result.trim()})`;
-  }
+  if (useAccounting && isNegative) {}
 
   return result;
killedBy: Formatter should format negative with accounting (parentheses)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/format/formatter.ts:159:16
 
   // Apply accounting format if negative
   if (useAccounting && isNegative) {
-    return `(${result.trim()})`;
+    return `(${result})`;
   }
 
killedBy: Formatter should trim template whitespace when using accounting format
statusReason: expected '( $1.00 )' to be '($1.00)' // Object.is equality
