[Killed] BooleanLiteral
src/format/parser.ts:36:18
   const parts = new Intl.NumberFormat(options.locale, {
     style: "decimal",
     minimumFractionDigits: 1,
-    useGrouping: true,
+    useGrouping: false,
   }).formatToParts(1234.5);
 
killedBy: Parser should parse locale-formatted strings (de-DE)
statusReason: Invalid locale configuration: group and decimal separators are the same for locale de-DE

[Killed] BlockStatement
src/format/parser.ts:42:29
   let decimalSeparator = ".";
   let groupSeparator = ",";
 
-  for (const part of parts) {
-    if (part.type === "decimal") {
-      decimalSeparator = part.value;
-    } else if (part.type === "group") {
-      groupSeparator = part.value;
-    }
-  }
+  for (const part of parts) {}
 
   // Handle the case where group and decimal separators are the same
killedBy: Parser should parse locale-formatted strings (de-DE)
statusReason: expected '1.23456' to be '1234.56' // Object.is equality

[Killed] BlockStatement
src/format/parser.ts:43:34
   let groupSeparator = ",";
 
   for (const part of parts) {
-    if (part.type === "decimal") {
-      decimalSeparator = part.value;
-    } else if (part.type === "group") {
+    if (part.type === "decimal") {} else if (part.type === "group") {
       groupSeparator = part.value;
     }
killedBy: Parser should parse locale-formatted strings (de-DE)
statusReason: Invalid locale configuration: group and decimal separators are the same for locale de-DE

[Killed] ConditionalExpression
src/format/parser.ts:43:9
   let groupSeparator = ",";
 
   for (const part of parts) {
-    if (part.type === "decimal") {
+    if (true) {
       decimalSeparator = part.value;
     } else if (part.type === "group") {
killedBy: Parser should parse valid money strings
statusReason: Invalid format: multiple decimal points

[Killed] ConditionalExpression
src/format/parser.ts:45:16
   for (const part of parts) {
     if (part.type === "decimal") {
       decimalSeparator = part.value;
-    } else if (part.type === "group") {
+    } else if (true) {
       groupSeparator = part.value;
     }
killedBy: Parser should parse valid money strings
statusReason: Invalid characters in amount

[Killed] EqualityOperator
src/format/parser.ts:45:16
   for (const part of parts) {
     if (part.type === "decimal") {
       decimalSeparator = part.value;
-    } else if (part.type === "group") {
+    } else if (part.type !== "group") {
       groupSeparator = part.value;
     }
killedBy: Parser should parse valid money strings
statusReason: Invalid characters in amount

[Killed] ConditionalExpression
src/format/parser.ts:52:7
 
   // Handle the case where group and decimal separators are the same
   // (shouldn't happen, but be defensive)
-  if (groupSeparator === decimalSeparator) {
+  if (true) {
     throw new Error(
       `Invalid locale configuration: group and decimal separators are the same for locale ${options.locale}`
killedBy: Parser should parse valid money strings
statusReason: Invalid locale configuration: group and decimal separators are the same for locale en-US

[Killed] BlockStatement
src/format/parser.ts:52:44
 
   // Handle the case where group and decimal separators are the same
   // (shouldn't happen, but be defensive)
-  if (groupSeparator === decimalSeparator) {
-    throw new Error(
-      `Invalid locale configuration: group and decimal separators are the same for locale ${options.locale}`
-    );
-  }
+  if (groupSeparator === decimalSeparator) {}
 
   // Remove currency symbols and whitespace
killedBy: Parser should throw when Intl reports invalid locale separators (defensive)
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/format/parser.ts:59:20
   }
 
   // Remove currency symbols and whitespace
-  let normalized = amount.replace(/[^\d.,\-\s]/g, "").trim();
+  let normalized = amount.replace(/[^\d.,\-\s]/g, "");
 
   // Handle negative sign
killedBy: Parser should parse valid money strings with surrounding whitespace
statusReason: Invalid characters in amount

[Killed] StringLiteral
src/format/parser.ts:59:51
   }
 
   // Remove currency symbols and whitespace
-  let normalized = amount.replace(/[^\d.,\-\s]/g, "").trim();
+  let normalized = amount.replace(/[^\d.,\-\s]/g, "Stryker was here!").trim();
 
   // Handle negative sign
killedBy: Parser should parse valid money strings
statusReason: Scientific notation not supported

[Killed] MethodExpression
src/format/parser.ts:62:22
   let normalized = amount.replace(/[^\d.,\-\s]/g, "").trim();
 
   // Handle negative sign
-  const isNegative = normalized.startsWith("-") || amount.includes("(");
+  const isNegative = normalized.endsWith("-") || amount.includes("(");
   normalized = normalized.replace(/[-()]/g, "");
 
killedBy: Parser should parse negative amounts with minus sign
statusReason: expected 123456n to be -123456n // Object.is equality

[Killed] LogicalOperator
src/format/parser.ts:62:22
   let normalized = amount.replace(/[^\d.,\-\s]/g, "").trim();
 
   // Handle negative sign
-  const isNegative = normalized.startsWith("-") || amount.includes("(");
+  const isNegative = normalized.startsWith("-") && amount.includes("(");
   normalized = normalized.replace(/[-()]/g, "");
 
killedBy: Parser should parse negative amounts with minus sign
statusReason: expected 123456n to be -123456n // Object.is equality

[Killed] Regex
src/format/parser.ts:63:35
 
   // Handle negative sign
   const isNegative = normalized.startsWith("-") || amount.includes("(");
-  normalized = normalized.replace(/[-()]/g, "");
+  normalized = normalized.replace(/[^-()]/g, "");
 
   // Remove all grouping separators
killedBy: Parser should parse valid money strings
statusReason: Invalid format

[Killed] StringLiteral
src/format/parser.ts:63:45
 
   // Handle negative sign
   const isNegative = normalized.startsWith("-") || amount.includes("(");
-  normalized = normalized.replace(/[-()]/g, "");
+  normalized = normalized.replace(/[-()]/g, "Stryker was here!");
 
   // Remove all grouping separators
killedBy: Parser should parse negative amounts with minus sign
statusReason: Scientific notation not supported

[Killed] StringLiteral
src/format/parser.ts:71:23
   // Replace locale decimal separator with standard period
   normalized = normalized.split(decimalSeparator).join(".");
 
-  return isNegative ? `-${normalized}` : normalized;
+  return isNegative ? `` : normalized;
 }
 
killedBy: Parser should parse negative amounts with minus sign
statusReason: Invalid format

[Killed] BlockStatement
src/format/parser.ts:91:11
   amount: string,
   currency: Currency,
   options: LocaleParseOptions
-): bigint {
-  const normalized = parseLocaleString(amount, options);
-  return parseToMinor(normalized, currency);
-}
+): bigint {}
 
 /**
killedBy: Parser should parse valid money strings
statusReason: expected undefined to be 123456n // Object.is equality

[Killed] ConditionalExpression
src/format/parser.ts:111:7
  */
 export function parseToMinor(amount: string, currency: Currency): bigint {
   // Validate format
-  if (/[eE]/.test(amount)) {
+  if (false) {
     throw new Error("Scientific notation not supported");
   }
killedBy: Parser should reject scientific notation
statusReason: expected [Function] to throw error matching /Scientific notation not supported/ but got 'Invalid characters in amount'

[Killed] ConditionalExpression
src/format/parser.ts:111:7
  */
 export function parseToMinor(amount: string, currency: Currency): bigint {
   // Validate format
-  if (/[eE]/.test(amount)) {
+  if (true) {
     throw new Error("Scientific notation not supported");
   }
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 1 tests
{ seed: 1932775495, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/format/parser.ts:116:7
   }
 
   // Reject ambiguous separators (commas, spaces, etc.)
-  if (/[^0-9.-]/.test(amount)) {
+  if (true) {
     throw new Error("Invalid characters in amount");
   }
killedBy: Formatter should format money correctly
statusReason: Invalid characters in amount

[Killed] BlockStatement
src/format/parser.ts:116:32
   }
 
   // Reject ambiguous separators (commas, spaces, etc.)
-  if (/[^0-9.-]/.test(amount)) {
-    throw new Error("Invalid characters in amount");
-  }
+  if (/[^0-9.-]/.test(amount)) {}
 
   // Reject inputs with no digits (e.g. "-" or "")
killedBy: Parser should reject invalid characters
statusReason: expected [Function] to throw error matching /Invalid characters in amount/ but got 'Cannot convert 1,23456 to a BigInt'

[Killed] StringLiteral
src/format/parser.ts:117:21
 
   // Reject ambiguous separators (commas, spaces, etc.)
   if (/[^0-9.-]/.test(amount)) {
-    throw new Error("Invalid characters in amount");
+    throw new Error("");
   }
 
killedBy: Parser should reject invalid characters
statusReason: expected [Function] to throw error matching /Invalid characters in amount/ but got ''

[Killed] ConditionalExpression
src/format/parser.ts:121:7
   }
 
   // Reject inputs with no digits (e.g. "-" or "")
-  if (!/[0-9]/.test(amount)) {
+  if (false) {
     throw new Error("Invalid format");
   }
killedBy: Parser should reject invalid format '-' for decimal currencies
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/format/parser.ts:121:7
   }
 
   // Reject inputs with no digits (e.g. "-" or "")
-  if (!/[0-9]/.test(amount)) {
+  if (true) {
     throw new Error("Invalid format");
   }
killedBy: Parser should parse valid money strings
statusReason: Invalid format

[Killed] StringLiteral
src/format/parser.ts:125:30
     throw new Error("Invalid format");
   }
 
-  const parts = amount.split(".");
+  const parts = amount.split("");
   if (parts.length > 2) {
     throw new Error("Invalid format: multiple decimal points");
killedBy: Parser should parse valid money strings
statusReason: Invalid format: multiple decimal points

[Killed] EqualityOperator
src/format/parser.ts:126:7
   }
 
   const parts = amount.split(".");
-  if (parts.length > 2) {
+  if (parts.length >= 2) {
     throw new Error("Invalid format: multiple decimal points");
   }
killedBy: Parser should parse valid money strings
statusReason: Invalid format: multiple decimal points

[Killed] ConditionalExpression
src/format/parser.ts:126:7
   }
 
   const parts = amount.split(".");
-  if (parts.length > 2) {
+  if (true) {
     throw new Error("Invalid format: multiple decimal points");
   }
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Invalid format: multiple decim…' was thrown

[Killed] StringLiteral
src/format/parser.ts:127:21
 
   const parts = amount.split(".");
   if (parts.length > 2) {
-    throw new Error("Invalid format: multiple decimal points");
+    throw new Error("");
   }
 
killedBy: Parser should reject multiple decimal points
statusReason: expected [Function] to throw error matching /Invalid format: multiple decimal poin…/ but got ''

[Killed] LogicalOperator
src/format/parser.ts:131:26
   }
 
   const integerPart = parts[0];
-  const fractionalPart = parts[1] || "";
+  const fractionalPart = parts[1] && "";
 
   if (fractionalPart.length > currency.decimals) {
killedBy: Parser should parse valid money strings
statusReason: expected 123400n to be 123456n // Object.is equality

[Killed] ConditionalExpression
src/format/parser.ts:131:26
   }
 
   const integerPart = parts[0];
-  const fractionalPart = parts[1] || "";
+  const fractionalPart = false;
 
   if (fractionalPart.length > currency.decimals) {
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 1 tests
{ seed: -901116783, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/format/parser.ts:133:50
   const integerPart = parts[0];
   const fractionalPart = parts[1] || "";
 
-  if (fractionalPart.length > currency.decimals) {
-    throw new InvalidPrecisionError(
-      `Precision ${fractionalPart.length} exceeds currency decimals ${currency.decimals}`
-    );
-  }
+  if (fractionalPart.length > currency.decimals) {}
 
   // Pad fractional part
killedBy: Parser should reject precision exceeding currency decimals
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/format/parser.ts:133:7
   const integerPart = parts[0];
   const fractionalPart = parts[1] || "";
 
-  if (fractionalPart.length > currency.decimals) {
+  if (fractionalPart.length <= currency.decimals) {
     throw new InvalidPrecisionError(
       `Precision ${fractionalPart.length} exceeds currency decimals ${currency.decimals}`
killedBy: Formatter should format money correctly
statusReason: Precision 2 exceeds currency decimals 2

[Killed] StringLiteral
src/format/parser.ts:140:69
   }
 
   // Pad fractional part
-  const paddedFractional = fractionalPart.padEnd(currency.decimals, "0");
+  const paddedFractional = fractionalPart.padEnd(currency.decimals, "");
 
   const combined = integerPart + paddedFractional;
killedBy: Tokens - defineToken should work with Money
statusReason: expected '15' to be '1500000000000000000' // Object.is equality

[Killed] ArithmeticOperator
src/format/parser.ts:142:20
   // Pad fractional part
   const paddedFractional = fractionalPart.padEnd(currency.decimals, "0");
 
-  const combined = integerPart + paddedFractional;
+  const combined = integerPart - paddedFractional;
 
   return BigInt(combined);
killedBy: Parser should parse valid money strings
statusReason: expected 1178n to be 123456n // Object.is equality
