[Killed] BlockStatement
src/ledger/Ledger.ts:27:44
   private entries: Entry[] = [];
   private currency: string;
 
-  constructor(currency: string | Currency) {
-    this.currency = typeof currency === "string" ? currency : currency.code;
-  }
+  constructor(currency: string | Currency) {}
 
   /**
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'CurrencyMismatchError: Currency misma…' was thrown

[Killed] ConditionalExpression
src/ledger/Ledger.ts:28:21
   private currency: string;
 
   constructor(currency: string | Currency) {
-    this.currency = typeof currency === "string" ? currency : currency.code;
+    this.currency = true ? currency : currency.code;
   }
 
killedBy: Ledger Error Handling should fail verification if history is tampered with
statusReason: Currency mismatch: expected [object Object], received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, '[object Object]');

[Killed] EqualityOperator
src/ledger/Ledger.ts:28:21
   private currency: string;
 
   constructor(currency: string | Currency) {
-    this.currency = typeof currency === "string" ? currency : currency.code;
+    this.currency = typeof currency !== "string" ? currency : currency.code;
   }
 
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'CurrencyMismatchError: Currency misma…' was thrown

[Killed] ConditionalExpression
src/ledger/Ledger.ts:37:9
    * Note: This is the synchronous version for Node.js. Use recordAsync for browser support.
    */
   record(money: Money, metadata: TransactionMetadata): Entry {
-    if (money.currency.code !== this.currency) {
+    if (false) {
       throw new CurrencyMismatchError(this.currency, money.currency.code);
     }
killedBy: Ledger should throw on currency mismatch (sync)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/ledger/Ledger.ts:37:9
    * Note: This is the synchronous version for Node.js. Use recordAsync for browser support.
    */
   record(money: Money, metadata: TransactionMetadata): Entry {
-    if (money.currency.code !== this.currency) {
+    if (money.currency.code === this.currency) {
       throw new CurrencyMismatchError(this.currency, money.currency.code);
     }
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'CurrencyMismatchError: Currency misma…' was thrown

[Killed] ConditionalExpression
src/ledger/Ledger.ts:42:7
     }
 
     const previousHash =
-      this.entries.length > 0
+      true
         ? this.entries[this.entries.length - 1].hash
         : null;
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] EqualityOperator
src/ledger/Ledger.ts:42:7
     }
 
     const previousHash =
-      this.entries.length > 0
+      this.entries.length <= 0
         ? this.entries[this.entries.length - 1].hash
         : null;
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ArithmeticOperator
src/ledger/Ledger.ts:43:24
 
     const previousHash =
       this.entries.length > 0
-        ? this.entries[this.entries.length - 1].hash
+        ? this.entries[this.entries.length + 1].hash
         : null;
 
killedBy: Ledger should maintain hash chain integrity
statusReason: Cannot read properties of undefined (reading 'hash')

[Killed] LogicalOperator
src/ledger/Ledger.ts:52:20
       money,
       metadata: Object.freeze({
         ...metadata,
-        timestamp: metadata.timestamp ?? new Date(),
+        timestamp: metadata.timestamp && new Date(),
       }),
       createdAt: new Date(),
killedBy: Ledger should default timestamp when not provided
statusReason: expected undefined to deeply equal 2025-01-01T00:00:00.000Z

[Killed] ObjectLiteral
src/ledger/Ledger.ts:62:26
     const hash = generateHashSync(content);
 
     // Create full entry
-    const entry: Entry = {
-      ...content,
-      hash,
-    };
+    const entry: Entry = {};
 
     this.entries.push(Object.freeze(entry)); // Immutable
killedBy: Ledger should record transactions
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] ConditionalExpression
src/ledger/Ledger.ts:77:9
    * Returns the created entry for reference.
    */
   async recordAsync(money: Money, metadata: TransactionMetadata): Promise<Entry> {
-    if (money.currency.code !== this.currency) {
+    if (true) {
       throw new CurrencyMismatchError(this.currency, money.currency.code);
     }
killedBy: Ledger should verify asynchronously
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] ConditionalExpression
src/ledger/Ledger.ts:77:9
    * Returns the created entry for reference.
    */
   async recordAsync(money: Money, metadata: TransactionMetadata): Promise<Entry> {
-    if (money.currency.code !== this.currency) {
+    if (false) {
       throw new CurrencyMismatchError(this.currency, money.currency.code);
     }
killedBy: Ledger should throw on currency mismatch (async)
statusReason: promise resolved "{ …(6) }" instead of rejecting

[Killed] BlockStatement
src/ledger/Ledger.ts:112:23
   /**
    * Gets the current balance.
    */
-  getBalance(): Money {
-    return this.entries.reduce(
-      (balance, entry) => balance.add(entry.money),
-      Money.zero(this.currency)
-    );
-  }
+  getBalance(): Money {}
 
   /**
killedBy: Ledger should record transactions
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] ArrowFunction
src/ledger/Ledger.ts:114:7
    */
   getBalance(): Money {
     return this.entries.reduce(
-      (balance, entry) => balance.add(entry.money),
+      () => undefined,
       Money.zero(this.currency)
     );
killedBy: Ledger should record transactions
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/ledger/Ledger.ts:122:38
   /**
    * Returns the complete transaction history.
    */
-  getHistory(): ReadonlyArray<Entry> {
-    return Object.freeze([...this.entries]);
-  }
+  getHistory(): ReadonlyArray<Entry> {}
 
   /**
killedBy: Ledger getHistory should include recorded entries
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/ledger/Ledger.ts:137:15
     minAmount?: Money;
     maxAmount?: Money;
     tags?: string[];
-  }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
-  }
+  }): Entry[] {}
 
   /**
killedBy: Ledger should filter queries
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/ledger/Ledger.ts:138:12
     maxAmount?: Money;
     tags?: string[];
   }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
+    return this.entries;
   }
 
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:138:43
     maxAmount?: Money;
     tags?: string[];
   }): Entry[] {
-    return this.entries.filter((entry) => {
-      if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
-      }
-      if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
-        );
-        if (!hasTag) return false;
-      }
-      return true;
-    });
+    return this.entries.filter((entry) => {});
   }
 
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:139:11
     tags?: string[];
   }): Entry[] {
     return this.entries.filter((entry) => {
-      if (filter.type) {
+      if (true) {
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:139:11
     tags?: string[];
   }): Entry[] {
     return this.entries.filter((entry) => {
-      if (filter.type) {
+      if (false) {
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/ledger/Ledger.ts:140:66
   }): Entry[] {
     return this.entries.filter((entry) => {
       if (filter.type) {
-        const types = Array.isArray(filter.type) ? filter.type : [filter.type];
+        const types = Array.isArray(filter.type) ? filter.type : [];
         if (!types.includes(entry.metadata.type)) return false;
       }
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:141:13
     return this.entries.filter((entry) => {
       if (filter.type) {
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
+        if (types.includes(entry.metadata.type)) return false;
       }
       if (filter.from && entry.createdAt < filter.from) return false;
killedBy: Ledger should filter queries
statusReason: expected 'withdrawal' to be 'deposit' // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:141:58
     return this.entries.filter((entry) => {
       if (filter.type) {
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
-        if (!types.includes(entry.metadata.type)) return false;
+        if (!types.includes(entry.metadata.type)) return true;
       }
       if (filter.from && entry.createdAt < filter.from) return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/ledger/Ledger.ts:143:11
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
       }
-      if (filter.from && entry.createdAt < filter.from) return false;
+      if (filter.from || entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/ledger/Ledger.ts:143:26
         const types = Array.isArray(filter.type) ? filter.type : [filter.type];
         if (!types.includes(entry.metadata.type)) return false;
       }
-      if (filter.from && entry.createdAt < filter.from) return false;
+      if (filter.from && entry.createdAt >= filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
killedBy: Ledger should filter queries
statusReason: expected 'r1' to be 'r2' // Object.is equality

[Killed] EqualityOperator
src/ledger/Ledger.ts:144:24
         if (!types.includes(entry.metadata.type)) return false;
       }
       if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
+      if (filter.to && entry.createdAt >= filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
killedBy: Ledger should filter queries
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:144:11
         if (!types.includes(entry.metadata.type)) return false;
       }
       if (filter.from && entry.createdAt < filter.from) return false;
-      if (filter.to && entry.createdAt > filter.to) return false;
+      if (false) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/ledger/Ledger.ts:145:11
       }
       if (filter.from && entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
+      if (filter.reference || entry.metadata.reference !== filter.reference)
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:145:31
       }
       if (filter.from && entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
-      if (filter.reference && entry.metadata.reference !== filter.reference)
+      if (filter.reference && true)
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:146:16
       if (filter.from && entry.createdAt < filter.from) return false;
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
-        return false;
+        return true;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
         return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/ledger/Ledger.ts:147:11
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
+      if (filter.minAmount || entry.money.lessThan(filter.minAmount))
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
killedBy: Ledger should filter queries
statusReason: Cannot convert undefined to a BigInt

[Killed] ConditionalExpression
src/ledger/Ledger.ts:147:11
       if (filter.to && entry.createdAt > filter.to) return false;
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
-      if (filter.minAmount && entry.money.lessThan(filter.minAmount))
+      if (false)
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:148:16
       if (filter.reference && entry.metadata.reference !== filter.reference)
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
-        return false;
+        return true;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:149:11
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
         return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
+      if (false)
         return false;
       if (filter.tags && entry.metadata.tags) {
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/ledger/Ledger.ts:149:11
         return false;
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
         return false;
-      if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
+      if (filter.maxAmount || entry.money.greaterThan(filter.maxAmount))
         return false;
       if (filter.tags && entry.metadata.tags) {
killedBy: Ledger should filter queries
statusReason: Cannot convert undefined to a BigInt

[Killed] BooleanLiteral
src/ledger/Ledger.ts:150:16
       if (filter.minAmount && entry.money.lessThan(filter.minAmount))
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
-        return false;
+        return true;
       if (filter.tags && entry.metadata.tags) {
         const hasTag = filter.tags.some((tag) =>
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:151:47
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
-      if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
-        );
-        if (!hasTag) return false;
-      }
+      if (filter.tags && entry.metadata.tags) {}
       return true;
     });
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/ledger/Ledger.ts:151:11
         return false;
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
-      if (filter.tags && entry.metadata.tags) {
+      if (false) {
         const hasTag = filter.tags.some((tag) =>
           entry.metadata.tags?.includes(tag)
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/ledger/Ledger.ts:152:41
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
       if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
+        const hasTag = filter.tags.some(() => undefined
         );
         if (!hasTag) return false;
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/ledger/Ledger.ts:152:24
       if (filter.maxAmount && entry.money.greaterThan(filter.maxAmount))
         return false;
       if (filter.tags && entry.metadata.tags) {
-        const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
-        );
+        const hasTag = filter.tags.every(tag => entry.metadata.tags?.includes(tag));
         if (!hasTag) return false;
       }
killedBy: Ledger should filter queries
statusReason: expected +0 to be 1 // Object.is equality

[Survived] OptionalChaining
src/ledger/Ledger.ts:153:11
         return false;
       if (filter.tags && entry.metadata.tags) {
         const hasTag = filter.tags.some((tag) =>
-          entry.metadata.tags?.includes(tag)
+          entry.metadata.tags.includes(tag)
         );
         if (!hasTag) return false;

[Killed] BooleanLiteral
src/ledger/Ledger.ts:155:13
         const hasTag = filter.tags.some((tag) =>
           entry.metadata.tags?.includes(tag)
         );
-        if (!hasTag) return false;
+        if (hasTag) return false;
       }
       return true;
killedBy: Ledger should filter queries
statusReason: expected 'r2' to be 'r1' // Object.is equality

[Killed] BooleanLiteral
src/ledger/Ledger.ts:155:29
         const hasTag = filter.tags.some((tag) =>
           entry.metadata.tags?.includes(tag)
         );
-        if (!hasTag) return false;
+        if (!hasTag) return true;
       }
       return true;
killedBy: Ledger should filter queries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:165:21
    * Verifies the integrity of the ledger using hash chain (sync version).
    * @returns true if all hashes are valid and chain is unbroken.
    */
-  verify(): boolean {
-    return verifyChainSync(this.entries);
-  }
+  verify(): boolean {}
 
   /**
killedBy: Ledger should maintain hash chain integrity
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:173:41
    * Verifies the integrity of the ledger using hash chain (async version for browsers).
    * @returns Promise resolving to true if all hashes are valid and chain is unbroken.
    */
-  async verifyAsync(): Promise<boolean> {
-    return verifyChain(this.entries);
-  }
+  async verifyAsync(): Promise<boolean> {}
 
   /**
killedBy: Ledger should verify asynchronously
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/ledger/Ledger.ts:180:30
   /**
    * Exports a snapshot for backup/audit purposes (sync version).
    */
-  snapshot(): LedgerSnapshot {
-    return {
-      version: SNAPSHOT_VERSION,
-      entries: [...this.entries],
-      balance: this.getBalance(),
-      currency: this.currency,
-      createdAt: new Date(),
-      checksum: generateHashSync({ entries: this.entries }),
-    };
-  }
+  snapshot(): LedgerSnapshot {}
 
   /**
killedBy: Ledger should snapshot and restore (sync)
statusReason: Cannot read properties of undefined (reading 'currency')

[Killed] ObjectLiteral
src/ledger/Ledger.ts:181:12
    * Exports a snapshot for backup/audit purposes (sync version).
    */
   snapshot(): LedgerSnapshot {
-    return {
-      version: SNAPSHOT_VERSION,
-      entries: [...this.entries],
-      balance: this.getBalance(),
-      currency: this.currency,
-      createdAt: new Date(),
-      checksum: generateHashSync({ entries: this.entries }),
-    };
+    return {};
   }
 
killedBy: Ledger should snapshot and restore (sync)
statusReason: expected undefined to be 'USD' // Object.is equality

[Killed] ObjectLiteral
src/ledger/Ledger.ts:187:34
       balance: this.getBalance(),
       currency: this.currency,
       createdAt: new Date(),
-      checksum: generateHashSync({ entries: this.entries }),
+      checksum: generateHashSync({}),
     };
   }
killedBy: Ledger snapshot checksum should be computed from entries
statusReason: missing entries in snapshot checksum input

[Killed] BlockStatement
src/ledger/Ledger.ts:194:50
   /**
    * Exports a snapshot for backup/audit purposes (async version for browsers).
    */
-  async snapshotAsync(): Promise<LedgerSnapshot> {
-    const checksum = await generateHash({ entries: this.entries });
-    return {
-      version: SNAPSHOT_VERSION,
-      entries: [...this.entries],
-      balance: this.getBalance(),
-      currency: this.currency,
-      createdAt: new Date(),
-      checksum,
-    };
-  }
+  async snapshotAsync(): Promise<LedgerSnapshot> {}
 
   /**
killedBy: Ledger should snapshot and restore (async)
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] ObjectLiteral
src/ledger/Ledger.ts:196:12
    */
   async snapshotAsync(): Promise<LedgerSnapshot> {
     const checksum = await generateHash({ entries: this.entries });
-    return {
-      version: SNAPSHOT_VERSION,
-      entries: [...this.entries],
-      balance: this.getBalance(),
-      currency: this.currency,
-      createdAt: new Date(),
-      checksum,
-    };
+    return {};
   }
 
killedBy: Ledger should snapshot and restore (async)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/ledger/Ledger.ts:209:57
   /**
    * Restores from a snapshot (sync version).
    */
-  static fromSnapshot(snapshot: LedgerSnapshot): Ledger {
-    const ledger = new Ledger(snapshot.currency);
-    // Verify integrity before restoring
-    if (!verifyChainSync(snapshot.entries)) {
-      throw new Error("Ledger snapshot integrity check failed");
-    }
-    ledger.entries = [...snapshot.entries];
-    return ledger;
-  }
+  static fromSnapshot(snapshot: LedgerSnapshot): Ledger {}
 
   /**
killedBy: Ledger should snapshot and restore (sync)
statusReason: Cannot read properties of undefined (reading 'getBalance')

[Killed] BlockStatement
src/ledger/Ledger.ts:212:45
   static fromSnapshot(snapshot: LedgerSnapshot): Ledger {
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
-    if (!verifyChainSync(snapshot.entries)) {
-      throw new Error("Ledger snapshot integrity check failed");
-    }
+    if (!verifyChainSync(snapshot.entries)) {}
     ledger.entries = [...snapshot.entries];
     return ledger;
killedBy: Ledger fromSnapshot should throw on invalid snapshot chain
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/ledger/Ledger.ts:212:9
   static fromSnapshot(snapshot: LedgerSnapshot): Ledger {
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
-    if (!verifyChainSync(snapshot.entries)) {
+    if (true) {
       throw new Error("Ledger snapshot integrity check failed");
     }
killedBy: Ledger should snapshot and restore (sync)
statusReason: Ledger snapshot integrity check failed

[Killed] BlockStatement
src/ledger/Ledger.ts:222:77
   /**
    * Restores from a snapshot (async version for browsers).
    */
-  static async fromSnapshotAsync(snapshot: LedgerSnapshot): Promise<Ledger> {
-    const ledger = new Ledger(snapshot.currency);
-    // Verify integrity before restoring
-    const isValid = await verifyChain(snapshot.entries);
-    if (!isValid) {
-      throw new Error("Ledger snapshot integrity check failed");
-    }
-    ledger.entries = [...snapshot.entries];
-    return ledger;
-  }
+  static async fromSnapshotAsync(snapshot: LedgerSnapshot): Promise<Ledger> {}
 }
 
killedBy: Ledger should snapshot and restore (async)
statusReason: Cannot read properties of undefined (reading 'getBalance')

[Killed] BooleanLiteral
src/ledger/Ledger.ts:226:9
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
     const isValid = await verifyChain(snapshot.entries);
-    if (!isValid) {
+    if (isValid) {
       throw new Error("Ledger snapshot integrity check failed");
     }
killedBy: Ledger should snapshot and restore (async)
statusReason: Ledger snapshot integrity check failed

[Killed] ConditionalExpression
src/ledger/Ledger.ts:226:9
     const ledger = new Ledger(snapshot.currency);
     // Verify integrity before restoring
     const isValid = await verifyChain(snapshot.entries);
-    if (!isValid) {
+    if (true) {
       throw new Error("Ledger snapshot integrity check failed");
     }
killedBy: Ledger should snapshot and restore (async)
statusReason: Ledger snapshot integrity check failed

[Killed] ArrayDeclaration
src/ledger/Ledger.ts:229:22
     if (!isValid) {
       throw new Error("Ledger snapshot integrity check failed");
     }
-    ledger.entries = [...snapshot.entries];
+    ledger.entries = [];
     return ledger;
   }
killedBy: Ledger should snapshot and restore (async)
statusReason: expected false to be true // Object.is equality
