[Killed] ConditionalExpression
src/ledger/verification.ts:13:7
  * Uses Node.js crypto if available, falls back to SubtleCrypto for browsers.
  */
 function getHashFunction(): (data: string) => string | Promise<string> {
-  if (hashFunction) return hashFunction;
+  if (false) return hashFunction;
 
   // Private escape hatch for tests to force the SubtleCrypto path.
killedBy: Ledger snapshot checksum should be computed from entries
statusReason: expected 'bb2ce906fb20c9928d87ad66582196ce08d39…' to be 'CHECK' // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:13:7
  * Uses Node.js crypto if available, falls back to SubtleCrypto for browsers.
  */
 function getHashFunction(): (data: string) => string | Promise<string> {
-  if (hashFunction) return hashFunction;
+  if (true) return hashFunction;
 
   // Private escape hatch for tests to force the SubtleCrypto path.
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'TypeError: fn is not a function' was thrown

[Killed] ConditionalExpression
src/ledger/verification.ts:18:5
   // Private escape hatch for tests to force the SubtleCrypto path.
   // This does not affect normal usage unless explicitly set.
   const disableNodeCrypto =
-    (globalThis as unknown as { __MONETRA_DISABLE_NODE_CRYPTO__?: boolean })
-      .__MONETRA_DISABLE_NODE_CRYPTO__ === true;
+    true;
 
   // Try Node.js crypto first
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Synchronous hashing not availa…' was thrown

[Killed] ConditionalExpression
src/ledger/verification.ts:18:5
   // Private escape hatch for tests to force the SubtleCrypto path.
   // This does not affect normal usage unless explicitly set.
   const disableNodeCrypto =
-    (globalThis as unknown as { __MONETRA_DISABLE_NODE_CRYPTO__?: boolean })
-      .__MONETRA_DISABLE_NODE_CRYPTO__ === true;
+    false;
 
   // Try Node.js crypto first
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/ledger/verification.ts:19:44
   // This does not affect normal usage unless explicitly set.
   const disableNodeCrypto =
     (globalThis as unknown as { __MONETRA_DISABLE_NODE_CRYPTO__?: boolean })
-      .__MONETRA_DISABLE_NODE_CRYPTO__ === true;
+      .__MONETRA_DISABLE_NODE_CRYPTO__ === false;
 
   // Try Node.js crypto first
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/ledger/verification.ts:22:7
       .__MONETRA_DISABLE_NODE_CRYPTO__ === true;
 
   // Try Node.js crypto first
-  if (!disableNodeCrypto && typeof globalThis !== "undefined") {
+  if (disableNodeCrypto && typeof globalThis !== "undefined") {
     try {
       // Dynamic import to avoid bundler issues
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Synchronous hashing not availa…' was thrown

[Killed] LogicalOperator
src/ledger/verification.ts:22:7
       .__MONETRA_DISABLE_NODE_CRYPTO__ === true;
 
   // Try Node.js crypto first
-  if (!disableNodeCrypto && typeof globalThis !== "undefined") {
+  if (!disableNodeCrypto || typeof globalThis !== "undefined") {
     try {
       // Dynamic import to avoid bundler issues
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ledger/verification.ts:23:9
 
   // Try Node.js crypto first
   if (!disableNodeCrypto && typeof globalThis !== "undefined") {
-    try {
-      // Dynamic import to avoid bundler issues
-      const nodeCrypto = require("crypto");
-      if (nodeCrypto && nodeCrypto.createHash) {
-        hashFunction = (data: string): string => {
-          return nodeCrypto.createHash("sha256").update(data).digest("hex");
-        };
-        return hashFunction;
-      }
-    } catch {
+    try {} catch {
       // Node crypto not available
     }
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Synchronous hashing not availa…' was thrown

[Killed] ConditionalExpression
src/ledger/verification.ts:26:11
     try {
       // Dynamic import to avoid bundler issues
       const nodeCrypto = require("crypto");
-      if (nodeCrypto && nodeCrypto.createHash) {
+      if (false) {
         hashFunction = (data: string): string => {
           return nodeCrypto.createHash("sha256").update(data).digest("hex");
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Synchronous hashing not availa…' was thrown

[Killed] BlockStatement
src/ledger/verification.ts:26:48
     try {
       // Dynamic import to avoid bundler issues
       const nodeCrypto = require("crypto");
-      if (nodeCrypto && nodeCrypto.createHash) {
-        hashFunction = (data: string): string => {
-          return nodeCrypto.createHash("sha256").update(data).digest("hex");
-        };
-        return hashFunction;
-      }
+      if (nodeCrypto && nodeCrypto.createHash) {}
     } catch {
       // Node crypto not available
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Synchronous hashing not availa…' was thrown

[Killed] BlockStatement
src/ledger/verification.ts:27:50
       // Dynamic import to avoid bundler issues
       const nodeCrypto = require("crypto");
       if (nodeCrypto && nodeCrypto.createHash) {
-        hashFunction = (data: string): string => {
-          return nodeCrypto.createHash("sha256").update(data).digest("hex");
-        };
+        hashFunction = (data: string): string => {};
         return hashFunction;
       }
killedBy: Ledger should snapshot and restore (sync)
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] StringLiteral
src/ledger/verification.ts:28:40
       const nodeCrypto = require("crypto");
       if (nodeCrypto && nodeCrypto.createHash) {
         hashFunction = (data: string): string => {
-          return nodeCrypto.createHash("sha256").update(data).digest("hex");
+          return nodeCrypto.createHash("").update(data).digest("hex");
         };
         return hashFunction;
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'Error: Digest method not supported' was thrown

[Killed] ConditionalExpression
src/ledger/verification.ts:39:5
 
   // Fall back to SubtleCrypto (browser)
   if (
-    typeof globalThis !== "undefined" &&
-    globalThis.crypto &&
-    globalThis.crypto.subtle
+    false
   ) {
     hashFunction = async (data: string): Promise<string> => {
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: No cryptographic hash function available. Ensure you are running in Node.js or a browser with SubtleCrypto support.

[Killed] LogicalOperator
src/ledger/verification.ts:39:5
 
   // Fall back to SubtleCrypto (browser)
   if (
-    typeof globalThis !== "undefined" &&
-    globalThis.crypto &&
+    typeof globalThis !== "undefined" || globalThis.crypto &&
     globalThis.crypto.subtle
   ) {
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw error matching /No cryptographic hash function availa…/ but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/ledger/verification.ts:42:5
     typeof globalThis !== "undefined" &&
     globalThis.crypto &&
     globalThis.crypto.subtle
-  ) {
-    hashFunction = async (data: string): Promise<string> => {
-      const encoder = new TextEncoder();
-      const dataBuffer = encoder.encode(data);
-      const hashBuffer = await globalThis.crypto.subtle.digest(
-        "SHA-256",
-        dataBuffer
-      );
-      const hashArray = Array.from(new Uint8Array(hashBuffer));
-      return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
-    };
-    return hashFunction;
-  }
+  ) {}
 
   // No crypto available
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: No cryptographic hash function available. Ensure you are running in Node.js or a browser with SubtleCrypto support.

[Killed] BlockStatement
src/ledger/verification.ts:43:61
     globalThis.crypto &&
     globalThis.crypto.subtle
   ) {
-    hashFunction = async (data: string): Promise<string> => {
-      const encoder = new TextEncoder();
-      const dataBuffer = encoder.encode(data);
-      const hashBuffer = await globalThis.crypto.subtle.digest(
-        "SHA-256",
-        dataBuffer
-      );
-      const hashArray = Array.from(new Uint8Array(hashBuffer));
-      return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
-    };
+    hashFunction = async (data: string): Promise<string> => {};
     return hashFunction;
   }
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] StringLiteral
src/ledger/verification.ts:51:62
         dataBuffer
       );
       const hashArray = Array.from(new Uint8Array(hashBuffer));
-      return hashArray.map((b) => b.toString(16).padStart(2, "0")).join("");
+      return hashArray.map((b) => b.toString(16).padStart(2, "")).join("");
     };
     return hashFunction;
killedBy: Ledger Verification should fall back to SubtleCrypto when node crypto createHash is unavailable
statusReason: expected '0123456789abcdef101112131415161718191…' to have a length of 64 but got 48

[Killed] StringLiteral
src/ledger/verification.ts:58:5
 
   // No crypto available
   throw new Error(
-    "No cryptographic hash function available. " +
+    "" +
       "Ensure you are running in Node.js or a browser with SubtleCrypto support."
   );
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw error matching /No cryptographic hash function availa…/ but got 'Ensure you are running in Node.js or …'

[Killed] StringLiteral
src/ledger/verification.ts:59:7
   // No crypto available
   throw new Error(
     "No cryptographic hash function available. " +
-      "Ensure you are running in Node.js or a browser with SubtleCrypto support."
+      ""
   );
 }
killedBy: Ledger Verification should throw a helpful error when no crypto is available
statusReason: expected [Function] to throw error matching /No cryptographic hash function availa…/ but got 'No cryptographic hash function availa…'

[Killed] BlockStatement
src/ledger/verification.ts:68:9
  */
 export function setHashFunction(
   fn: (data: string) => string | Promise<string>
-): void {
-  hashFunction = fn;
-}
+): void {}
 
 function serialize(data: unknown): string {
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: expected '015abd7f5cc57a2dd94b7590f04ad80842739…' to be 'HASH:{"a":1}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:72:43
   hashFunction = fn;
 }
 
-function serialize(data: unknown): string {
-  return JSON.stringify(data, (_key, value) => {
-    if (typeof value === "bigint") {
-      return value.toString();
-    }
-    // Handle Money objects if they are passed directly and not via toJSON
-    if (
-      value &&
-      typeof value === "object" &&
-      "minor" in value &&
-      "currency" in value
-    ) {
-      return {
-        minor: (value as { minor: bigint }).minor.toString(),
-        currency: (value as { currency: { code: string } }).currency.code,
-      };
-    }
-    return value;
-  });
-}
+function serialize(data: unknown): string {}
 
 /**
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: expected 'HASH:undefined' to be 'HASH:{"a":1}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:73:48
 }
 
 function serialize(data: unknown): string {
-  return JSON.stringify(data, (_key, value) => {
-    if (typeof value === "bigint") {
-      return value.toString();
-    }
-    // Handle Money objects if they are passed directly and not via toJSON
-    if (
-      value &&
-      typeof value === "object" &&
-      "minor" in value &&
-      "currency" in value
-    ) {
-      return {
-        minor: (value as { minor: bigint }).minor.toString(),
-        currency: (value as { currency: { code: string } }).currency.code,
-      };
-    }
-    return value;
-  });
+  return JSON.stringify(data, (_key, value) => {});
 }
 
killedBy: Ledger should accept currency as string
statusReason: expected [Function] to not throw an error but 'TypeError [ERR_INVALID_ARG_TYPE]: The…' was thrown

[Killed] BlockStatement
src/ledger/verification.ts:74:36
 
 function serialize(data: unknown): string {
   return JSON.stringify(data, (_key, value) => {
-    if (typeof value === "bigint") {
-      return value.toString();
-    }
+    if (typeof value === "bigint") {}
     // Handle Money objects if they are passed directly and not via toJSON
     if (
killedBy: Ledger Verification should serialize bigint values as strings
statusReason: Do not know how to serialize a BigInt

[Killed] EqualityOperator
src/ledger/verification.ts:74:9
 
 function serialize(data: unknown): string {
   return JSON.stringify(data, (_key, value) => {
-    if (typeof value === "bigint") {
+    if (typeof value !== "bigint") {
       return value.toString();
     }
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: expected 'HASH:"[object Object]"' to be 'HASH:{"a":1}' // Object.is equality

[Killed] LogicalOperator
src/ledger/verification.ts:79:7
     }
     // Handle Money objects if they are passed directly and not via toJSON
     if (
-      value &&
-      typeof value === "object" &&
-      "minor" in value &&
+      value && typeof value === "object" || "minor" in value &&
       "currency" in value
     ) {
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: Cannot use 'in' operator to search for 'minor' in 1

[Killed] ConditionalExpression
src/ledger/verification.ts:79:7
     }
     // Handle Money objects if they are passed directly and not via toJSON
     if (
-      value &&
-      typeof value === "object" &&
-      "minor" in value &&
-      "currency" in value
+      false
     ) {
       return {
killedBy: Ledger Verification should serialize Money objects when passed directly
statusReason: expected '{"minor":"123","currency":{"code":"US…' to be '{"minor":"123","currency":"USD"}' // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:80:7
     // Handle Money objects if they are passed directly and not via toJSON
     if (
       value &&
-      typeof value === "object" &&
+      true &&
       "minor" in value &&
       "currency" in value
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: Cannot use 'in' operator to search for 'minor' in 1

[Killed] EqualityOperator
src/ledger/verification.ts:80:7
     // Handle Money objects if they are passed directly and not via toJSON
     if (
       value &&
-      typeof value === "object" &&
+      typeof value !== "object" &&
       "minor" in value &&
       "currency" in value
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: Cannot use 'in' operator to search for 'minor' in 1

[Killed] StringLiteral
src/ledger/verification.ts:81:7
     if (
       value &&
       typeof value === "object" &&
-      "minor" in value &&
+      "" in value &&
       "currency" in value
     ) {
killedBy: Ledger Verification should serialize Money objects when passed directly
statusReason: expected '{"minor":"123","currency":{"code":"US…' to be '{"minor":"123","currency":"USD"}' // Object.is equality

[Killed] StringLiteral
src/ledger/verification.ts:82:7
       value &&
       typeof value === "object" &&
       "minor" in value &&
-      "currency" in value
+      "" in value
     ) {
       return {
killedBy: Ledger Verification should serialize Money objects when passed directly
statusReason: expected '{"minor":"123","currency":{"code":"US…' to be '{"minor":"123","currency":"USD"}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:83:7
       typeof value === "object" &&
       "minor" in value &&
       "currency" in value
-    ) {
-      return {
-        minor: (value as { minor: bigint }).minor.toString(),
-        currency: (value as { currency: { code: string } }).currency.code,
-      };
-    }
+    ) {}
     return value;
   });
killedBy: Ledger Verification should serialize Money objects when passed directly
statusReason: expected '{"minor":"123","currency":{"code":"US…' to be '{"minor":"123","currency":"USD"}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:100:71
  * @param data - The data to hash.
  * @returns The hash as a hex string (sync in Node.js, may be async in browser).
  */
-export function generateHash(data: unknown): string | Promise<string> {
-  const serialized = serialize(data);
-  const fn = getHashFunction();
-  return fn(serialized);
-}
+export function generateHash(data: unknown): string | Promise<string> {}
 
 /**
killedBy: Ledger should snapshot and restore (sync)
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:113:57
  * @param data - The data to hash.
  * @returns The hash as a hex string.
  */
-export function generateHashSync(data: unknown): string {
-  const result = generateHash(data);
-  if (result instanceof Promise) {
-    throw new Error(
-      "Synchronous hashing not available in this environment. " +
-        "Use generateHash() with await instead."
-    );
-  }
-  return result;
-}
+export function generateHashSync(data: unknown): string {}
 
 /**
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: expected undefined to be 'HASH:{"a":1}' // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:115:34
  */
 export function generateHashSync(data: unknown): string {
   const result = generateHash(data);
-  if (result instanceof Promise) {
-    throw new Error(
-      "Synchronous hashing not available in this environment. " +
-        "Use generateHash() with await instead."
-    );
-  }
+  if (result instanceof Promise) {}
   return result;
 }
killedBy: Ledger Verification generateHashSync should throw when only async hashing is available
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/ledger/verification.ts:115:7
  */
 export function generateHashSync(data: unknown): string {
   const result = generateHash(data);
-  if (result instanceof Promise) {
+  if (true) {
     throw new Error(
       "Synchronous hashing not available in this environment. " +
killedBy: Ledger Verification should use an injected hash function (sync) for deterministic output
statusReason: Synchronous hashing not available in this environment. Use generateHash() with await instead.

[Killed] BlockStatement
src/ledger/verification.ts:131:71
  * @param entries - The entries to verify.
  * @returns True if the chain is valid, false if tampered.
  */
-export async function verifyChain(entries: Entry[]): Promise<boolean> {
-  for (let i = 0; i < entries.length; i++) {
-    const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
-
-    // Check previous hash pointer
-    if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
-    } else {
-      if (entry.previousHash !== null) return false;
-    }
-
-    // Check integrity of current entry
-    const { hash, ...content } = entry;
-    const calculatedHash = await generateHash(content);
-
-    if (hash !== calculatedHash) return false;
-  }
-  return true;
-}
+export async function verifyChain(entries: Entry[]): Promise<boolean> {}
 
 /**
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:132:19
  * @returns True if the chain is valid, false if tampered.
  */
 export async function verifyChain(entries: Entry[]): Promise<boolean> {
-  for (let i = 0; i < entries.length; i++) {
+  for (let i = 0; i <= entries.length; i++) {
     const entry = entries[i];
     const previousEntry = i > 0 ? entries[i - 1] : null;
killedBy: Ledger should verify asynchronously
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BlockStatement
src/ledger/verification.ts:132:44
  * @returns True if the chain is valid, false if tampered.
  */
 export async function verifyChain(entries: Entry[]): Promise<boolean> {
-  for (let i = 0; i < entries.length; i++) {
-    const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
-
-    // Check previous hash pointer
-    if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
-    } else {
-      if (entry.previousHash !== null) return false;
-    }
-
-    // Check integrity of current entry
-    const { hash, ...content } = entry;
-    const calculatedHash = await generateHash(content);
-
-    if (hash !== calculatedHash) return false;
-  }
+  for (let i = 0; i < entries.length; i++) {}
   return true;
 }
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:134:27
 export async function verifyChain(entries: Entry[]): Promise<boolean> {
   for (let i = 0; i < entries.length; i++) {
     const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
+    const previousEntry = i <= 0 ? entries[i - 1] : null;
 
     // Check previous hash pointer
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/ledger/verification.ts:134:43
 export async function verifyChain(entries: Entry[]): Promise<boolean> {
   for (let i = 0; i < entries.length; i++) {
     const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
+    const previousEntry = i > 0 ? entries[i + 1] : null;
 
     // Check previous hash pointer
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:137:9
     const previousEntry = i > 0 ? entries[i - 1] : null;
 
     // Check previous hash pointer
-    if (previousEntry) {
+    if (true) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/ledger/verification.ts:137:9
     const previousEntry = i > 0 ? entries[i - 1] : null;
 
     // Check previous hash pointer
-    if (previousEntry) {
+    if (false) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:138:11
 
     // Check previous hash pointer
     if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
+      if (entry.previousHash === previousEntry.hash) return false;
     } else {
       if (entry.previousHash !== null) return false;
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/ledger/verification.ts:138:61
 
     // Check previous hash pointer
     if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
+      if (entry.previousHash !== previousEntry.hash) return true;
     } else {
       if (entry.previousHash !== null) return false;
killedBy: Ledger Verification verifyChain should detect previousHash mismatch in middle of chain
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:139:12
     // Check previous hash pointer
     if (previousEntry) {
       if (entry.previousHash !== previousEntry.hash) return false;
-    } else {
-      if (entry.previousHash !== null) return false;
-    }
+    } else {}
 
     // Check integrity of current entry
killedBy: Ledger Verification verifyChain (async) should detect when first entry has non-null previousHash
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/ledger/verification.ts:140:47
     if (previousEntry) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
-      if (entry.previousHash !== null) return false;
+      if (entry.previousHash !== null) return true;
     }
 
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:140:11
     if (previousEntry) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
-      if (entry.previousHash !== null) return false;
+      if (true) return false;
     }
 
killedBy: Ledger should verify asynchronously
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:147:9
     const { hash, ...content } = entry;
     const calculatedHash = await generateHash(content);
 
-    if (hash !== calculatedHash) return false;
+    if (true) return false;
   }
   return true;
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:147:9
     const { hash, ...content } = entry;
     const calculatedHash = await generateHash(content);
 
-    if (hash !== calculatedHash) return false;
+    if (hash === calculatedHash) return false;
   }
   return true;
killedBy: Ledger should verify asynchronously
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:158:60
  * @param entries - The entries to verify.
  * @returns True if the chain is valid.
  */
-export function verifyChainSync(entries: Entry[]): boolean {
-  for (let i = 0; i < entries.length; i++) {
-    const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
-
-    if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
-    } else {
-      if (entry.previousHash !== null) return false;
-    }
-
-    const { hash, ...content } = entry;
-    const calculatedHash = generateHashSync(content);
-
-    if (hash !== calculatedHash) return false;
-  }
-  return true;
-}
+export function verifyChainSync(entries: Entry[]): boolean {}
 
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:159:19
  * @returns True if the chain is valid.
  */
 export function verifyChainSync(entries: Entry[]): boolean {
-  for (let i = 0; i < entries.length; i++) {
+  for (let i = 0; i >= entries.length; i++) {
     const entry = entries[i];
     const previousEntry = i > 0 ? entries[i - 1] : null;
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ledger/verification.ts:159:44
  * @returns True if the chain is valid.
  */
 export function verifyChainSync(entries: Entry[]): boolean {
-  for (let i = 0; i < entries.length; i++) {
-    const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
-
-    if (previousEntry) {
-      if (entry.previousHash !== previousEntry.hash) return false;
-    } else {
-      if (entry.previousHash !== null) return false;
-    }
-
-    const { hash, ...content } = entry;
-    const calculatedHash = generateHashSync(content);
-
-    if (hash !== calculatedHash) return false;
-  }
+  for (let i = 0; i < entries.length; i++) {}
   return true;
 }
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:161:27
 export function verifyChainSync(entries: Entry[]): boolean {
   for (let i = 0; i < entries.length; i++) {
     const entry = entries[i];
-    const previousEntry = i > 0 ? entries[i - 1] : null;
+    const previousEntry = false ? entries[i - 1] : null;
 
     if (previousEntry) {
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected false to be true // Object.is equality
