[Killed] ConditionalExpression
src/ledger/verification.ts:163:9
     const entry = entries[i];
     const previousEntry = i > 0 ? entries[i - 1] : null;
 
-    if (previousEntry) {
+    if (true) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: Cannot read properties of null (reading 'hash')

[Killed] ConditionalExpression
src/ledger/verification.ts:163:9
     const entry = entries[i];
     const previousEntry = i > 0 ? entries[i - 1] : null;
 
-    if (previousEntry) {
+    if (false) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ledger/verification.ts:166:11
     if (previousEntry) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
-      if (entry.previousHash !== null) return false;
+      if (entry.previousHash === null) return false;
     }
 
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:166:11
     if (previousEntry) {
       if (entry.previousHash !== previousEntry.hash) return false;
     } else {
-      if (entry.previousHash !== null) return false;
+      if (false) return false;
     }
 
killedBy: Ledger Verification verifyChainSync should detect when first entry has non-null previousHash
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ledger/verification.ts:172:9
     const { hash, ...content } = entry;
     const calculatedHash = generateHashSync(content);
 
-    if (hash !== calculatedHash) return false;
+    if (false) return false;
   }
   return true;
killedBy: Ledger Verification verifyChainSync should detect tampering (hash mismatch)
statusReason: expected true to be false // Object.is equality
