[Killed] BlockStatement
src/money/Converter.ts:20:60
    * @param rates - A map of currency codes to exchange rates relative to the base.
    *                Example: { "EUR": 0.85, "GBP": 0.75 } (where 1 Base = 0.85 EUR).
    */
-  constructor(base: string, rates: Record<string, number>) {
-    this.base = base;
-    this.rates = { ...rates };
-
-    // Ensure base rate is 1
-    if (this.rates[base] === undefined) {
-      this.rates[base] = 1;
-    }
-  }
+  constructor(base: string, rates: Record<string, number>) {}
 
   /**
killedBy: Wallet Features should convert currency
statusReason: Cannot read properties of undefined (reading 'USD')

[Survived] BlockStatement
src/money/Converter.ts:25:41
     this.rates = { ...rates };
 
     // Ensure base rate is 1
-    if (this.rates[base] === undefined) {
-      this.rates[base] = 1;
-    }
+    if (this.rates[base] === undefined) {}
   }
 

[Survived] EqualityOperator
src/money/Converter.ts:25:9
     this.rates = { ...rates };
 
     // Ensure base rate is 1
-    if (this.rates[base] === undefined) {
+    if (this.rates[base] !== undefined) {
       this.rates[base] = 1;
     }

[Killed] EqualityOperator
src/money/Converter.ts:40:7
    */
   convert(money: Money, toCurrency: Currency | string): Money {
     const targetCurrency =
-      typeof toCurrency === "string" ? getCurrency(toCurrency) : toCurrency;
+      typeof toCurrency !== "string" ? getCurrency(toCurrency) : toCurrency;
 
     if (money.currency.code === targetCurrency.code) {
killedBy: Wallet Features should convert currency
statusReason: Exchange rate missing for conversion from USD to undefined

[Killed] ConditionalExpression
src/money/Converter.ts:40:7
    */
   convert(money: Money, toCurrency: Currency | string): Money {
     const targetCurrency =
-      typeof toCurrency === "string" ? getCurrency(toCurrency) : toCurrency;
+      false ? getCurrency(toCurrency) : toCurrency;
 
     if (money.currency.code === targetCurrency.code) {
killedBy: Wallet Features should convert currency
statusReason: Exchange rate missing for conversion from USD to undefined

[Killed] ConditionalExpression
src/money/Converter.ts:42:9
     const targetCurrency =
       typeof toCurrency === "string" ? getCurrency(toCurrency) : toCurrency;
 
-    if (money.currency.code === targetCurrency.code) {
+    if (true) {
       return money;
     }
killedBy: Wallet Features should convert currency
statusReason: expected 1000n to be 850n // Object.is equality

[Killed] BlockStatement
src/money/Converter.ts:42:54
     const targetCurrency =
       typeof toCurrency === "string" ? getCurrency(toCurrency) : toCurrency;
 
-    if (money.currency.code === targetCurrency.code) {
-      return money;
-    }
+    if (money.currency.code === targetCurrency.code) {}
 
     const fromRate = this.rates[money.currency.code];
killedBy: Converter should not convert when currencies are the same
statusReason: expected Money{ minor: 10000n, …(1) } to be Money{ minor: 10000n, …(1) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Money{ minor: 10000n, …(1) }
Received: serializes to the same string

[Killed] LogicalOperator
src/money/Converter.ts:49:9
     const fromRate = this.rates[money.currency.code];
     const toRate = this.rates[targetCurrency.code];
 
-    if (fromRate === undefined || toRate === undefined) {
+    if (fromRate === undefined && toRate === undefined) {
       throw new Error(
         `Exchange rate missing for conversion from ${money.currency.code} to ${targetCurrency.code}`
killedBy: Converter should throw error when exchange rate is missing
statusReason: expected [Function] to throw error including 'Exchange rate missing for conversion …' but got 'Cannot convert NaN to a BigInt'

[Killed] BlockStatement
src/money/Converter.ts:49:57
     const fromRate = this.rates[money.currency.code];
     const toRate = this.rates[targetCurrency.code];
 
-    if (fromRate === undefined || toRate === undefined) {
-      throw new Error(
-        `Exchange rate missing for conversion from ${money.currency.code} to ${targetCurrency.code}`
-      );
-    }
+    if (fromRate === undefined || toRate === undefined) {}
 
     // Calculate the exchange rate ratio
killedBy: Converter should throw error when exchange rate is missing
statusReason: expected [Function] to throw error including 'Exchange rate missing for conversion …' but got 'Cannot convert NaN to a BigInt'

[Killed] ArithmeticOperator
src/money/Converter.ts:56:19
     }
 
     // Calculate the exchange rate ratio
-    const ratio = toRate / fromRate;
+    const ratio = toRate * fromRate;
 
     // Adjust for difference in decimal places
killedBy: Wallet Features should handle MoneyBag (Portfolio)
statusReason: expected 2000n to be 5000n // Object.is equality

[Killed] ArithmeticOperator
src/money/Converter.ts:61:14
     // Adjust for difference in decimal places
     // targetMinor = sourceMinor * ratio * 10^(targetDecimals - sourceDecimals)
     const decimalAdjustment =
-      10 ** (targetCurrency.decimals - money.currency.decimals);
+      10 ** (targetCurrency.decimals + money.currency.decimals);
 
     // We use the multiply method of Money which handles rounding.
killedBy: Wallet Features should convert currency
statusReason: expected 8500000n to be 850n // Object.is equality

[Survived] ArithmeticOperator
src/money/Converter.ts:73:24
     // Let's pass a default rounding mode.
     // We need to import RoundingMode.
 
-    const multiplier = ratio * decimalAdjustment;
+    const multiplier = ratio / decimalAdjustment;
 
     // We need to access the internal multiply or use the public one.
