[Killed] BlockStatement
src/money/Money.ts:28:58
    */
   readonly currency: Currency;
 
-  private constructor(minor: bigint, currency: Currency) {
-    this.minor = minor;
-    this.currency = currency;
-  }
+  private constructor(minor: bigint, currency: Currency) {}
 
   private static resolveCurrency(currency: Currency | string): Currency {
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
src/money/Money.ts:33:73
     this.currency = currency;
   }
 
-  private static resolveCurrency(currency: Currency | string): Currency {
-    if (typeof currency === "string") {
-      return getCurrency(currency);
-    }
-    return currency;
-  }
+  private static resolveCurrency(currency: Currency | string): Currency {}
 
   /**
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: Cannot read properties of undefined (reading 'decimals')

[Killed] EqualityOperator
src/money/Money.ts:34:9
   }
 
   private static resolveCurrency(currency: Currency | string): Currency {
-    if (typeof currency === "string") {
+    if (typeof currency !== "string") {
       return getCurrency(currency);
     }
killedBy: Ledger Verification verifyChain should validate previousHash and content (async)
statusReason: Currency '[object Object]' not found in registry.

[Killed] BlockStatement
src/money/Money.ts:34:39
   }
 
   private static resolveCurrency(currency: Currency | string): Currency {
-    if (typeof currency === "string") {
-      return getCurrency(currency);
-    }
+    if (typeof currency === "string") {}
     return currency;
   }
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: -1533523310, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:50:80
    * const m = Money.fromMinor(100, USD); // $1.00
    * const m2 = Money.fromMinor(100, 'USD'); // $1.00
    */
-  static fromMinor(minor: bigint | number, currency: Currency | string): Money {
-    return new Money(BigInt(minor), Money.resolveCurrency(currency));
-  }
+  static fromMinor(minor: bigint | number, currency: Currency | string): Money {}
 
   /**
killedBy: Money Property-Based Tests Addition Properties should be commutative: a + b = b + a
statusReason: Property failed after 1 tests
{ seed: 412053190, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:63:80
    * @example
    * const m = Money.fromCents(100, 'USD'); // $1.00
    */
-  static fromCents(cents: bigint | number, currency: Currency | string): Money {
-    return Money.fromMinor(cents, currency);
-  }
+  static fromCents(cents: bigint | number, currency: Currency | string): Money {}
 
   /**
killedBy: Money should create from cents (alias) using currency string
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:77:72
    * @example
    * const m = Money.fromMajor("10.50", USD); // $10.50
    */
-  static fromMajor(amount: string, currency: Currency | string): Money {
-    const resolvedCurrency = Money.resolveCurrency(currency);
-    const minor = parseToMinor(amount, resolvedCurrency);
-    return new Money(minor, resolvedCurrency);
-  }
+  static fromMajor(amount: string, currency: Currency | string): Money {}
 
   /**
killedBy: Wallet Features should create money from major string using helper
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:93:74
    * @example
    * const m = Money.fromDecimal("10.50", 'USD'); // $10.50
    */
-  static fromDecimal(amount: string, currency: Currency | string): Money {
-    return Money.fromMajor(amount, currency);
-  }
+  static fromDecimal(amount: string, currency: Currency | string): Money {}
 
   /**
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 1 tests
{ seed: -943292930, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:115:12
       rounding?: RoundingMode;
       suppressWarning?: boolean;
     }
-  ): Money {
-    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
-      console.warn(
-        '[monetra] Money.fromFloat() may lose precision. ' +
-          'Consider using Money.fromMajor("' +
-          amount +
-          '", currency) instead.'
-      );
-    }
-    const resolvedCurrency = Money.resolveCurrency(currency);
-    const factor = 10 ** resolvedCurrency.decimals;
-    const minorUnits = Math.round(amount * factor);
-    return new Money(BigInt(minorUnits), resolvedCurrency);
-  }
+  ): Money {}
 
   /**
killedBy: Money Utilities fromFloat should create from float
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] LogicalOperator
src/money/Money.ts:116:9
       suppressWarning?: boolean;
     }
   ): Money {
-    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
+    if (!options?.suppressWarning || process.env.NODE_ENV !== "production") {
       console.warn(
         '[monetra] Money.fromFloat() may lose precision. ' +
killedBy: Money Utilities fromFloat should allow suppressing precision warning
statusReason: expected "warn" to not be called at all, but actually been called 1 times

Received: 

  1st warn call:

    Array [
      "[monetra] Money.fromFloat() may lose precision. Consider using Money.fromMajor("10.5", currency) instead.",

[Killed] BlockStatement
src/money/Money.ts:116:77
       suppressWarning?: boolean;
     }
   ): Money {
-    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
-      console.warn(
-        '[monetra] Money.fromFloat() may lose precision. ' +
-          'Consider using Money.fromMajor("' +
-          amount +
-          '", currency) instead.'
-      );
-    }
+    if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {}
     const resolvedCurrency = Money.resolveCurrency(currency);
     const factor = 10 ** resolvedCurrency.decimals;
killedBy: Money should create from float and optionally warn
statusReason: expected "warn" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/money/Money.ts:118:9
   ): Money {
     if (!options?.suppressWarning && process.env.NODE_ENV !== "production") {
       console.warn(
-        '[monetra] Money.fromFloat() may lose precision. ' +
+        "" +
           'Consider using Money.fromMajor("' +
           amount +
killedBy: Money Utilities fromFloat should warn about precision by default
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st warn call:

  [
-   StringContaining "may lose precision",

[Survived] StringLiteral
src/money/Money.ts:121:11
         '[monetra] Money.fromFloat() may lose precision. ' +
           'Consider using Money.fromMajor("' +
           amount +
-          '", currency) instead.'
+          ""
       );
     }

[Killed] ArithmeticOperator
src/money/Money.ts:126:35
     }
     const resolvedCurrency = Money.resolveCurrency(currency);
     const factor = 10 ** resolvedCurrency.decimals;
-    const minorUnits = Math.round(amount * factor);
+    const minorUnits = Math.round(amount / factor);
     return new Money(BigInt(minorUnits), resolvedCurrency);
   }
killedBy: Money Utilities fromFloat should create from float
statusReason: expected 0n to be 1050n // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:136:41
    * @returns The Money with the smallest amount.
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
-  static min(...values: Money[]): Money {
-    if (values.length === 0)
-      throw new Error("At least one Money value required");
-    return values.reduce((min, current) => {
-      assertSameCurrency(min, current);
-      return current.lessThan(min) ? current : min;
-    });
-  }
+  static min(...values: Money[]): Money {}
 
   /**
killedBy: Money should compute min/max and validate inputs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/money/Money.ts:137:9
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
   static min(...values: Money[]): Money {
-    if (values.length === 0)
+    if (values.length !== 0)
       throw new Error("At least one Money value required");
     return values.reduce((min, current) => {
killedBy: Money should compute min/max and validate inputs
statusReason: expected [Function] to throw error including 'At least one Money value required' but got 'Reduce of empty array with no initial…'

[Killed] ConditionalExpression
src/money/Money.ts:137:9
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
   static min(...values: Money[]): Money {
-    if (values.length === 0)
+    if (true)
       throw new Error("At least one Money value required");
     return values.reduce((min, current) => {
killedBy: Money should compute min/max and validate inputs
statusReason: At least one Money value required

[Killed] StringLiteral
src/money/Money.ts:138:23
    */
   static min(...values: Money[]): Money {
     if (values.length === 0)
-      throw new Error("At least one Money value required");
+      throw new Error("");
     return values.reduce((min, current) => {
       assertSameCurrency(min, current);
killedBy: Money should compute min/max and validate inputs
statusReason: expected [Function] to throw error including 'At least one Money value required' but got ''

[Killed] BlockStatement
src/money/Money.ts:139:44
   static min(...values: Money[]): Money {
     if (values.length === 0)
       throw new Error("At least one Money value required");
-    return values.reduce((min, current) => {
-      assertSameCurrency(min, current);
-      return current.lessThan(min) ? current : min;
-    });
+    return values.reduce((min, current) => {});
   }
 
killedBy: Money should compute min/max and validate inputs
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:151:41
    * @returns The Money with the largest amount.
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
-  static max(...values: Money[]): Money {
-    if (values.length === 0)
-      throw new Error("At least one Money value required");
-    return values.reduce((max, current) => {
-      assertSameCurrency(max, current);
-      return current.greaterThan(max) ? current : max;
-    });
-  }
+  static max(...values: Money[]): Money {}
 
   /**
killedBy: Money should compute min/max and validate inputs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/money/Money.ts:152:9
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
   static max(...values: Money[]): Money {
-    if (values.length === 0)
+    if (true)
       throw new Error("At least one Money value required");
     return values.reduce((max, current) => {
killedBy: Money should compute min/max and validate inputs
statusReason: At least one Money value required

[Killed] ConditionalExpression
src/money/Money.ts:152:9
    * @throws {CurrencyMismatchError} If currencies don't match.
    */
   static max(...values: Money[]): Money {
-    if (values.length === 0)
+    if (false)
       throw new Error("At least one Money value required");
     return values.reduce((max, current) => {
killedBy: Money should compute min/max and validate inputs
statusReason: expected [Function] to throw error including 'At least one Money value required' but got 'Reduce of empty array with no initial…'

[Killed] BlockStatement
src/money/Money.ts:154:44
   static max(...values: Money[]): Money {
     if (values.length === 0)
       throw new Error("At least one Money value required");
-    return values.reduce((max, current) => {
-      assertSameCurrency(max, current);
-      return current.greaterThan(max) ? current : max;
-    });
+    return values.reduce((max, current) => {});
   }
 
killedBy: Money Utilities min & max should find max
statusReason: Cannot read properties of undefined (reading 'equals')

[Killed] BlockStatement
src/money/Money.ts:166:51
    * @param currency - The currency.
    * @returns A new Money instance with value 0.
    */
-  static zero(currency: Currency | string): Money {
-    return new Money(0n, Money.resolveCurrency(currency));
-  }
+  static zero(currency: Currency | string): Money {}
 
   private resolveOther(other: Money | number | bigint | string): Money {
killedBy: Money Property-Based Tests Addition Properties should have identity element: a + 0 = a
statusReason: Property failed after 1 tests
{ seed: -333166883, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:170:72
     return new Money(0n, Money.resolveCurrency(currency));
   }
 
-  private resolveOther(other: Money | number | bigint | string): Money {
-    if (other instanceof Money) {
-      return other;
-    }
-    if (typeof other === "string") {
-      return Money.fromMajor(other, this.currency);
-    }
-    return Money.fromMinor(other, this.currency);
-  }
+  private resolveOther(other: Money | number | bigint | string): Money {}
 
   /**
killedBy: Converter should automatically set base rate to 1 when not provided
statusReason: Cannot read properties of undefined (reading 'currency')

[Killed] BlockStatement
src/money/Money.ts:171:33
   }
 
   private resolveOther(other: Money | number | bigint | string): Money {
-    if (other instanceof Money) {
-      return other;
-    }
+    if (other instanceof Money) {}
     if (typeof other === "string") {
       return Money.fromMajor(other, this.currency);
killedBy: Converter should automatically set base rate to 1 when not provided
statusReason: Cannot convert $100.00 to a BigInt

[Killed] ConditionalExpression
src/money/Money.ts:171:9
   }
 
   private resolveOther(other: Money | number | bigint | string): Money {
-    if (other instanceof Money) {
+    if (true) {
       return other;
     }
killedBy: Money should resolve other values from string and number
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/money/Money.ts:174:36
     if (other instanceof Money) {
       return other;
     }
-    if (typeof other === "string") {
-      return Money.fromMajor(other, this.currency);
-    }
+    if (typeof other === "string") {}
     return Money.fromMinor(other, this.currency);
   }
killedBy: Money should resolve other values from string and number
statusReason: Cannot convert 0.50 to a BigInt

[Killed] ConditionalExpression
src/money/Money.ts:174:9
     if (other instanceof Money) {
       return other;
     }
-    if (typeof other === "string") {
+    if (false) {
       return Money.fromMajor(other, this.currency);
     }
killedBy: Money should resolve other values from string and number
statusReason: Cannot convert 0.50 to a BigInt

[Killed] BlockStatement
src/money/Money.ts:187:55
    * @returns A new Money instance representing the sum.
    * @throws {CurrencyMismatchError} If the currencies do not match.
    */
-  add(other: Money | number | bigint | string): Money {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return new Money(add(this.minor, otherMoney.minor), this.currency);
-  }
+  add(other: Money | number | bigint | string): Money {}
 
   /**
killedBy: Money Property-Based Tests Addition Properties should be commutative: a + b = b + a
statusReason: Property failed after 1 tests
{ seed: -759174280, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:200:60
    * @returns A new Money instance representing the difference.
    * @throws {CurrencyMismatchError} If the currencies do not match.
    */
-  subtract(other: Money | number | bigint | string): Money {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return new Money(subtract(this.minor, otherMoney.minor), this.currency);
-  }
+  subtract(other: Money | number | bigint | string): Money {}
 
   /**
killedBy: Money should subtract correctly
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:217:12
   multiply(
     multiplier: string | number,
     options?: { rounding?: RoundingMode }
-  ): Money {
-    const result = multiply(this.minor, multiplier, options?.rounding);
-    return new Money(result, this.currency);
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should convert currency
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] OptionalChaining
src/money/Money.ts:218:53
     multiplier: string | number,
     options?: { rounding?: RoundingMode }
   ): Money {
-    const result = multiply(this.minor, multiplier, options?.rounding);
+    const result = multiply(this.minor, multiplier, options.rounding);
     return new Money(result, this.currency);
   }
killedBy: Money should multiply with rounding
statusReason: Cannot read properties of undefined (reading 'rounding')

[Killed] BlockStatement
src/money/Money.ts:234:12
   divide(
     divisor: number | string,
     options?: { rounding?: RoundingMode }
-  ): Money {
-    if (divisor === 0 || divisor === "0") {
-      throw new Error("Division by zero");
-    }
-    const result = divide(this.minor, divisor, options?.rounding);
-    return new Money(result, this.currency);
-  }
+  ): Money {}
 
   /**
killedBy: Money Property-Based Tests Rounding Consistency division with rounding should produce integer minor units
statusReason: Property failed after 1 tests
{ seed: -576951458, path: "0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:235:9
     divisor: number | string,
     options?: { rounding?: RoundingMode }
   ): Money {
-    if (divisor === 0 || divisor === "0") {
+    if (divisor !== 0 || divisor === "0") {
       throw new Error("Division by zero");
     }
killedBy: Money Property-Based Tests Rounding Consistency division with rounding should produce integer minor units
statusReason: Property failed after 1 tests
{ seed: -231487221, path: "0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:235:9
     divisor: number | string,
     options?: { rounding?: RoundingMode }
   ): Money {
-    if (divisor === 0 || divisor === "0") {
+    if (true) {
       throw new Error("Division by zero");
     }
killedBy: Money Property-Based Tests Rounding Consistency division with rounding should produce integer minor units
statusReason: Property failed after 1 tests
{ seed: 883375031, path: "0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/money/Money.ts:236:23
     options?: { rounding?: RoundingMode }
   ): Money {
     if (divisor === 0 || divisor === "0") {
-      throw new Error("Division by zero");
+      throw new Error("");
     }
     const result = divide(this.minor, divisor, options?.rounding);
killedBy: Money Utilities divide should throw on division by zero
statusReason: expected [Function] to throw error matching /Division by zero/ but got ''

[Killed] OptionalChaining
src/money/Money.ts:238:48
     if (divisor === 0 || divisor === "0") {
       throw new Error("Division by zero");
     }
-    const result = divide(this.minor, divisor, options?.rounding);
+    const result = divide(this.minor, divisor, options.rounding);
     return new Money(result, this.currency);
   }
killedBy: Money Utilities divide should divide correctly
statusReason: Cannot read properties of undefined (reading 'rounding')

[Killed] BlockStatement
src/money/Money.ts:246:16
    * Returns the absolute value of this Money.
    * @returns A new Money instance with the absolute value.
    */
-  abs(): Money {
-    return new Money(
-      this.minor < 0n ? -this.minor : this.minor,
-      this.currency
-    );
-  }
+  abs(): Money {}
 
   /**
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 1 tests
{ seed: -78789437, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UnaryOperator
src/money/Money.ts:248:25
    */
   abs(): Money {
     return new Money(
-      this.minor < 0n ? -this.minor : this.minor,
+      this.minor < 0n ? +this.minor : this.minor,
       this.currency
     );
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 4 tests
{ seed: 586654249, path: "3:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-1]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:248:7
    */
   abs(): Money {
     return new Money(
-      this.minor < 0n ? -this.minor : this.minor,
+      true ? -this.minor : this.minor,
       this.currency
     );
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 2 tests
{ seed: -1269430778, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 23 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:257:19
    * Returns the negated value of this Money.
    * @returns A new Money instance with the negated value.
    */
-  negate(): Money {
-    return new Money(-this.minor, this.currency);
-  }
+  negate(): Money {}
 
   /**
killedBy: Money Property-Based Tests Addition Properties should have inverse element: a + (-a) = 0
statusReason: Property failed after 1 tests
{ seed: -1182990574, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UnaryOperator
src/money/Money.ts:258:22
    * @returns A new Money instance with the negated value.
    */
   negate(): Money {
-    return new Money(-this.minor, this.currency);
+    return new Money(+this.minor, this.currency);
   }
 
killedBy: Money Utilities abs & negate should negate value
statusReason: Cannot convert a BigInt value to a number

[Killed] BlockStatement
src/money/Money.ts:270:39
    * @param ratios - A list of numbers representing the ratios to split by.
    * @returns An array of Money instances.
    */
-  allocate(ratios: number[]): Money[] {
-    const shares = allocate(this.minor, ratios);
-    return shares.map((share) => new Money(share, this.currency));
-  }
+  allocate(ratios: number[]): Money[] {}
 
   /**
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 731433649, path: "0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/money/Money.ts:272:23
    */
   allocate(ratios: number[]): Money[] {
     const shares = allocate(this.minor, ratios);
-    return shares.map((share) => new Money(share, this.currency));
+    return shares.map(() => undefined);
   }
 
killedBy: Money Property-Based Tests Allocation Properties should preserve total: sum of allocated parts = original
statusReason: Property failed after 1 tests
{ seed: 2054637129, path: "0:0:0:0", endOnFailure: true }
Counterexample: [1,[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:285:14
     locale?: string;
     symbol?: boolean;
     display?: "symbol" | "code" | "name";
-  }): string {
-    return format(this, options);
-  }
+  }): string {}
 
   /**
killedBy: Money should format correctly
statusReason: expected undefined to be '$1,234.56' // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:295:60
    * @param other - The other Money value (Money, minor units as number/bigint, or major units as string).
    * @returns True if amounts and currencies are equal.
    */
-  equals(other: Money | number | bigint | string): boolean {
-    const otherMoney = this.resolveOther(other);
-    return (
-      this.currency.code === otherMoney.currency.code &&
-      this.minor === otherMoney.minor
-    );
-  }
+  equals(other: Money | number | bigint | string): boolean {}
 
   /**
killedBy: Money Property-Based Tests Addition Properties should be commutative: a + b = b + a
statusReason: Property failed after 1 tests
{ seed: 666983409, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/money/Money.ts:298:7
   equals(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     return (
-      this.currency.code === otherMoney.currency.code &&
-      this.minor === otherMoney.minor
+      this.currency.code === otherMoney.currency.code || this.minor === otherMoney.minor
     );
   }
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:298:7
   equals(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     return (
-      this.currency.code === otherMoney.currency.code &&
-      this.minor === otherMoney.minor
+      true
     );
   }
killedBy: Financial - Simple Interest simpleInterest should respect rounding modes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:299:7
     const otherMoney = this.resolveOther(other);
     return (
       this.currency.code === otherMoney.currency.code &&
-      this.minor === otherMoney.minor
+      true
     );
   }
killedBy: Financial - Simple Interest simpleInterest should respect rounding modes
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:299:7
     const otherMoney = this.resolveOther(other);
     return (
       this.currency.code === otherMoney.currency.code &&
-      this.minor === otherMoney.minor
+      this.minor !== otherMoney.minor
     );
   }
killedBy: Money should enforce invariant a + b - b === a
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:310:65
    * @returns True if this value is greater.
    * @throws {CurrencyMismatchError} If the currencies do not match.
    */
-  greaterThan(other: Money | number | bigint | string): boolean {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return this.minor > otherMoney.minor;
-  }
+  greaterThan(other: Money | number | bigint | string): boolean {}
 
   /**
killedBy: Money Utilities min & max should find max
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:313:12
   greaterThan(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor > otherMoney.minor;
+    return true;
   }
 
killedBy: Money Property-Based Tests Clamp Properties should return min if value < min
statusReason: Property failed after 1 tests
{ seed: 1952945942, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,500000001]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:313:12
   greaterThan(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor > otherMoney.minor;
+    return this.minor <= otherMoney.minor;
   }
 
killedBy: Money should compute min/max and validate inputs
statusReason: expected 500n to be 1000n // Object.is equality
