[Killed] BlockStatement
src/money/Money.ts:323:62
    * @returns True if this value is less.
    * @throws {CurrencyMismatchError} If the currencies do not match.
    */
-  lessThan(other: Money | number | bigint | string): boolean {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return this.minor < otherMoney.minor;
-  }
+  lessThan(other: Money | number | bigint | string): boolean {}
 
   /**
killedBy: Money Utilities min & max should find min
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:326:12
   lessThan(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor < otherMoney.minor;
+    return false;
   }
 
killedBy: Money should compute min/max and validate inputs
statusReason: expected 1000n to be 500n // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:326:12
   lessThan(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor < otherMoney.minor;
+    return true;
   }
 
killedBy: Money Property-Based Tests Clamp Properties should return max if value > max
statusReason: Property failed after 1 tests
{ seed: -565667733, path: "0:0:0:0", endOnFailure: true }
Counterexample: [500000001,0,250000001]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:332:72
   /**
    * Checks if this Money value is greater than or equal to another.
    */
-  greaterThanOrEqual(other: Money | number | bigint | string): boolean {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return this.minor >= otherMoney.minor;
-  }
+  greaterThanOrEqual(other: Money | number | bigint | string): boolean {}
 
   /**
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:335:12
   greaterThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor >= otherMoney.minor;
+    return true;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:335:12
   greaterThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor >= otherMoney.minor;
+    return this.minor < otherMoney.minor;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:341:69
   /**
    * Checks if this Money value is less than or equal to another.
    */
-  lessThanOrEqual(other: Money | number | bigint | string): boolean {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    return this.minor <= otherMoney.minor;
-  }
+  lessThanOrEqual(other: Money | number | bigint | string): boolean {}
 
   /**
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:344:12
   lessThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor <= otherMoney.minor;
+    return this.minor < otherMoney.minor;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:344:12
   lessThanOrEqual(other: Money | number | bigint | string): boolean {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    return this.minor <= otherMoney.minor;
+    return true;
   }
 
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:350:25
   /**
    * Checks if this Money value is positive (greater than zero).
    */
-  isPositive(): boolean {
-    return this.minor > 0n;
-  }
+  isPositive(): boolean {}
 
   /**
killedBy: Money Utilities abs & negate should return absolute value
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:351:12
    * Checks if this Money value is positive (greater than zero).
    */
   isPositive(): boolean {
-    return this.minor > 0n;
+    return this.minor <= 0n;
   }
 
killedBy: Money Utilities abs & negate should return absolute value
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:351:12
    * Checks if this Money value is positive (greater than zero).
    */
   isPositive(): boolean {
-    return this.minor > 0n;
+    return false;
   }
 
killedBy: Money Utilities abs & negate should return absolute value
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:358:64
    * Compares this Money to another, returning -1, 0, or 1.
    * Useful for sorting.
    */
-  compare(other: Money | number | bigint | string): -1 | 0 | 1 {
-    const otherMoney = this.resolveOther(other);
-    assertSameCurrency(this, otherMoney);
-    if (this.minor < otherMoney.minor) return -1;
-    if (this.minor > otherMoney.minor) return 1;
-    return 0;
-  }
+  compare(other: Money | number | bigint | string): -1 | 0 | 1 {}
 
   /**
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:361:9
   compare(other: Money | number | bigint | string): -1 | 0 | 1 {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    if (this.minor < otherMoney.minor) return -1;
+    if (false) return -1;
     if (this.minor > otherMoney.minor) return 1;
     return 0;
killedBy: Money Property-Based Tests Comparison Properties compare should be consistent with greaterThan/lessThan
statusReason: Property failed after 5 tests
{ seed: -834727764, path: "4:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:361:9
   compare(other: Money | number | bigint | string): -1 | 0 | 1 {
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
-    if (this.minor < otherMoney.minor) return -1;
+    if (this.minor <= otherMoney.minor) return -1;
     if (this.minor > otherMoney.minor) return 1;
     return 0;
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected -1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:362:9
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
     if (this.minor < otherMoney.minor) return -1;
-    if (this.minor > otherMoney.minor) return 1;
+    if (this.minor >= otherMoney.minor) return 1;
     return 0;
   }
killedBy: Money Utilities comparisons should compare correctly
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:362:9
     const otherMoney = this.resolveOther(other);
     assertSameCurrency(this, otherMoney);
     if (this.minor < otherMoney.minor) return -1;
-    if (this.minor > otherMoney.minor) return 1;
+    if (false) return 1;
     return 0;
   }
killedBy: Money Property-Based Tests Comparison Properties compare should be consistent with greaterThan/lessThan
statusReason: Property failed after 4 tests
{ seed: 105083284, path: "3:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,-1]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:374:12
   percentage(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN
-  ): Money {
-    return this.multiply(percent / 100, { rounding });
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] ArithmeticOperator
src/money/Money.ts:375:26
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN
   ): Money {
-    return this.multiply(percent / 100, { rounding });
+    return this.multiply(percent * 100, { rounding });
   }
 
killedBy: Wallet Features should support financial helpers
statusReason: expected 10000000n to be 1000n // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:386:12
   addPercent(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN
-  ): Money {
-    return this.add(this.percentage(percent, rounding));
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:398:12
   subtractPercent(
     percent: number,
     rounding: RoundingMode = RoundingMode.HALF_EVEN
-  ): Money {
-    return this.subtract(this.percentage(percent, rounding));
-  }
+  ): Money {}
 
   /**
killedBy: Wallet Features should support financial helpers
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] BlockStatement
src/money/Money.ts:406:33
    * Splits the money into equal parts.
    * @param parts - Number of parts.
    */
-  split(parts: number): Money[] {
-    const ratios = Array(parts).fill(1);
-    return this.allocate(ratios);
-  }
+  split(parts: number): Money[] {}
 
   /**
killedBy: Money Property-Based Tests Allocation Properties split should preserve total
statusReason: Property failed after 1 tests
{ seed: 1092235498, path: "0:0:0", endOnFailure: true }
Counterexample: [1,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:416:21
    *
    * @returns True if the amount is zero.
    */
-  isZero(): boolean {
-    return this.minor === 0n;
-  }
+  isZero(): boolean {}
 
   /**
killedBy: Money Property-Based Tests Addition Properties should have inverse element: a + (-a) = 0
statusReason: Property failed after 1 tests
{ seed: 2136375189, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:417:12
    * @returns True if the amount is zero.
    */
   isZero(): boolean {
-    return this.minor === 0n;
+    return this.minor !== 0n;
   }
 
killedBy: Money Property-Based Tests Addition Properties should have inverse element: a + (-a) = 0
statusReason: Property failed after 1 tests
{ seed: -671886235, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:417:12
    * @returns True if the amount is zero.
    */
   isZero(): boolean {
-    return this.minor === 0n;
+    return true;
   }
 
killedBy: Financial - Leverage Ratios should calculate Debt-to-Equity ratio correctly
statusReason: Total equity cannot be zero

[Killed] BlockStatement
src/money/Money.ts:425:25
    *
    * @returns True if the amount is negative.
    */
-  isNegative(): boolean {
-    return this.minor < 0n;
-  }
+  isNegative(): boolean {}
 
   /**
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 1 tests
{ seed: -865628763, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:426:12
    * @returns True if the amount is negative.
    */
   isNegative(): boolean {
-    return this.minor < 0n;
+    return this.minor <= 0n;
   }
 
killedBy: Financial - Loan should handle edge case where balance might go negative in amortization
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/money/Money.ts:426:12
    * @returns True if the amount is negative.
    */
   isNegative(): boolean {
-    return this.minor < 0n;
+    return this.minor >= 0n;
   }
 
killedBy: Money Property-Based Tests Absolute Value and Negation Properties should satisfy: |a| >= 0
statusReason: Property failed after 1 tests
{ seed: 1567457004, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:442:40
    * const clamped = price.clamp(Money.fromMajor("50", 'USD'), Money.fromMajor("100", 'USD'));
    * // clamped is $100.00
    */
-  clamp(min: Money, max: Money): Money {
-    assertSameCurrency(this, min);
-    assertSameCurrency(this, max);
-
-    if (min.greaterThan(max)) {
-      throw new Error("Clamp min cannot be greater than max");
-    }
-
-    if (this.lessThan(min)) {
-      return new Money(min.minor, this.currency);
-    }
-    if (this.greaterThan(max)) {
-      return new Money(max.minor, this.currency);
-    }
-    return this;
-  }
+  clamp(min: Money, max: Money): Money {}
 
   /**
killedBy: Money should clamp correctly
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/money/Money.ts:446:31
     assertSameCurrency(this, min);
     assertSameCurrency(this, max);
 
-    if (min.greaterThan(max)) {
-      throw new Error("Clamp min cannot be greater than max");
-    }
+    if (min.greaterThan(max)) {}
 
     if (this.lessThan(min)) {
killedBy: Money should clamp correctly
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/money/Money.ts:446:9
     assertSameCurrency(this, min);
     assertSameCurrency(this, max);
 
-    if (min.greaterThan(max)) {
+    if (false) {
       throw new Error("Clamp min cannot be greater than max");
     }
killedBy: Money should clamp correctly
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/money/Money.ts:450:9
       throw new Error("Clamp min cannot be greater than max");
     }
 
-    if (this.lessThan(min)) {
+    if (false) {
       return new Money(min.minor, this.currency);
     }
killedBy: Money Property-Based Tests Clamp Properties should return min if value < min
statusReason: Property failed after 1 tests
{ seed: -886662740, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,500000001]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:450:9
       throw new Error("Clamp min cannot be greater than max");
     }
 
-    if (this.lessThan(min)) {
+    if (true) {
       return new Money(min.minor, this.currency);
     }
killedBy: Money should clamp correctly
statusReason: expected 5000n to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:453:9
     if (this.lessThan(min)) {
       return new Money(min.minor, this.currency);
     }
-    if (this.greaterThan(max)) {
+    if (true) {
       return new Money(max.minor, this.currency);
     }
killedBy: Money should clamp correctly
statusReason: expected Money{ minor: 10000n, …(1) } to be Money{ minor: 7500n, …(1) } // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:453:32
     if (this.lessThan(min)) {
       return new Money(min.minor, this.currency);
     }
-    if (this.greaterThan(max)) {
-      return new Money(max.minor, this.currency);
-    }
+    if (this.greaterThan(max)) {}
     return this;
   }
killedBy: Money should clamp correctly
statusReason: expected 15000n to be 10000n // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:470:29
    * const m = Money.fromMajor("1234.56", 'USD');
    * m.toDecimalString(); // "1234.56"
    */
-  toDecimalString(): string {
-    const decimals = this.currency.decimals;
-    const isNegative = this.minor < 0n;
-    const absMinor = isNegative ? -this.minor : this.minor;
-
-    if (decimals === 0) {
-      return isNegative ? `-${absMinor.toString()}` : absMinor.toString();
-    }
-
-    const divisor = 10n ** BigInt(decimals);
-    const integerPart = absMinor / divisor;
-    const fractionalPart = absMinor % divisor;
-
-    const fractionalStr = fractionalPart.toString().padStart(decimals, "0");
-    const result = `${integerPart}.${fractionalStr}`;
-
-    return isNegative ? `-${result}` : result;
-  }
+  toDecimalString(): string {}
 
   /**
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 1 tests
{ seed: -1891326325, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/money/Money.ts:472:24
    */
   toDecimalString(): string {
     const decimals = this.currency.decimals;
-    const isNegative = this.minor < 0n;
+    const isNegative = this.minor >= 0n;
     const absMinor = isNegative ? -this.minor : this.minor;
 
killedBy: Money Property-Based Tests Serialization Properties toDecimalString should be parseable back
statusReason: Property failed after 1 tests
{ seed: 1631961086, path: "0:1:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:472:24
    */
   toDecimalString(): string {
     const decimals = this.currency.decimals;
-    const isNegative = this.minor < 0n;
+    const isNegative = true;
     const absMinor = isNegative ? -this.minor : this.minor;
 
killedBy: Money should return correct decimal string representation
statusReason: expected '--1234.-56' to be '1234.56' // Object.is equality

[Killed] UnaryOperator
src/money/Money.ts:473:35
   toDecimalString(): string {
     const decimals = this.currency.decimals;
     const isNegative = this.minor < 0n;
-    const absMinor = isNegative ? -this.minor : this.minor;
+    const absMinor = isNegative ? +this.minor : this.minor;
 
     if (decimals === 0) {
killedBy: Money should return correct decimal string representation
statusReason: Cannot convert a BigInt value to a number

[Killed] EqualityOperator
src/money/Money.ts:475:9
     const isNegative = this.minor < 0n;
     const absMinor = isNegative ? -this.minor : this.minor;
 
-    if (decimals === 0) {
+    if (decimals !== 0) {
       return isNegative ? `-${absMinor.toString()}` : absMinor.toString();
     }
killedBy: Money should return correct decimal string representation
statusReason: expected '123456' to be '1234.56' // Object.is equality

[Killed] ConditionalExpression
src/money/Money.ts:475:9
     const isNegative = this.minor < 0n;
     const absMinor = isNegative ? -this.minor : this.minor;
 
-    if (decimals === 0) {
+    if (true) {
       return isNegative ? `-${absMinor.toString()}` : absMinor.toString();
     }
killedBy: Money should return correct decimal string representation
statusReason: expected '123456' to be '1234.56' // Object.is equality

[Killed] StringLiteral
src/money/Money.ts:476:27
     const absMinor = isNegative ? -this.minor : this.minor;
 
     if (decimals === 0) {
-      return isNegative ? `-${absMinor.toString()}` : absMinor.toString();
+      return isNegative ? `` : absMinor.toString();
     }
 
killedBy: Money should return correct decimal string representation
statusReason: expected '' to be '-150' // Object.is equality

[Killed] StringLiteral
src/money/Money.ts:484:20
     const fractionalPart = absMinor % divisor;
 
     const fractionalStr = fractionalPart.toString().padStart(decimals, "0");
-    const result = `${integerPart}.${fractionalStr}`;
+    const result = ``;
 
     return isNegative ? `-${result}` : result;
killedBy: Money should return correct decimal string representation
statusReason: expected '' to be '1234.56' // Object.is equality

[Killed] BlockStatement
src/money/Money.ts:494:69
    *
    * @returns An object with amount (string), currency (code), and precision.
    */
-  toJSON(): { amount: string; currency: string; precision: number } {
-    return {
-      amount: this.minor.toString(),
-      currency: this.currency.code,
-      precision: this.currency.decimals,
-    };
-  }
+  toJSON(): { amount: string; currency: string; precision: number } {}
 
   /**
killedBy: Wallet Features should serialize to JSON
statusReason: expected undefined to deeply equal { Object (amount, currency, ...) }

[Killed] BlockStatement
src/money/Money.ts:515:56
    * const money = JSON.parse(json, Money.reviver);
    * // money is Money instance: $10.50
    */
-  static reviver(key: string, value: unknown): unknown {
-    if (
-      value !== null &&
-      typeof value === "object" &&
-      "amount" in value &&
-      "currency" in value &&
-      "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
-    ) {
-      const obj = value as { amount: string; currency: string; precision: number };
-      return Money.fromMinor(BigInt(obj.amount), obj.currency);
-    }
-    return value;
-  }
+  static reviver(key: string, value: unknown): unknown {}
 
   /**
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: -1040661191, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/Money.ts:517:7
    */
   static reviver(key: string, value: unknown): unknown {
     if (
-      value !== null &&
-      typeof value === "object" &&
-      "amount" in value &&
-      "currency" in value &&
-      "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
+      false
     ) {
       const obj = value as { amount: string; currency: string; precision: number };
killedBy: Money should revive Money objects from JSON
statusReason: expected { amount: '1050', …(2) } to be an instance of Money

[Killed] ConditionalExpression
src/money/Money.ts:517:7
    */
   static reviver(key: string, value: unknown): unknown {
     if (
-      value !== null &&
-      typeof value === "object" &&
-      "amount" in value &&
-      "currency" in value &&
-      "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
+      true
     ) {
       const obj = value as { amount: string; currency: string; precision: number };
killedBy: Money should revive Money objects from JSON
statusReason: Cannot convert undefined to a BigInt

[Killed] ConditionalExpression
src/money/Money.ts:518:7
   static reviver(key: string, value: unknown): unknown {
     if (
       value !== null &&
-      typeof value === "object" &&
+      true &&
       "amount" in value &&
       "currency" in value &&
killedBy: Money should revive Money objects from JSON
statusReason: Cannot use 'in' operator to search for 'amount' in 1050

[Killed] EqualityOperator
src/money/Money.ts:518:7
   static reviver(key: string, value: unknown): unknown {
     if (
       value !== null &&
-      typeof value === "object" &&
+      typeof value !== "object" &&
       "amount" in value &&
       "currency" in value &&
killedBy: Money should revive Money objects from JSON
statusReason: Cannot use 'in' operator to search for 'amount' in 1050

[Killed] ConditionalExpression
src/money/Money.ts:522:7
       "amount" in value &&
       "currency" in value &&
       "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
+      true &&
       typeof (value as Record<string, unknown>).currency === "string" &&
       typeof (value as Record<string, unknown>).precision === "number"
killedBy: Money should revive Money objects from JSON
statusReason: expected Money{ minor: 1050n, …(1) } to deeply equal { amount: 1050, currency: 'USD', …(1) }

[Killed] EqualityOperator
src/money/Money.ts:522:7
       "amount" in value &&
       "currency" in value &&
       "precision" in value &&
-      typeof (value as Record<string, unknown>).amount === "string" &&
+      typeof (value as Record<string, unknown>).amount !== "string" &&
       typeof (value as Record<string, unknown>).currency === "string" &&
       typeof (value as Record<string, unknown>).precision === "number"
killedBy: Money should revive Money objects from JSON
statusReason: expected { amount: '1050', …(2) } to be an instance of Money

[Killed] EqualityOperator
src/money/Money.ts:523:7
       "currency" in value &&
       "precision" in value &&
       typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
+      typeof (value as Record<string, unknown>).currency !== "string" &&
       typeof (value as Record<string, unknown>).precision === "number"
     ) {
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: -2051215938, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/money/Money.ts:523:7
       "currency" in value &&
       "precision" in value &&
       typeof (value as Record<string, unknown>).amount === "string" &&
-      typeof (value as Record<string, unknown>).currency === "string" &&
+      true &&
       typeof (value as Record<string, unknown>).precision === "number"
     ) {

[Killed] EqualityOperator
src/money/Money.ts:524:7
       "precision" in value &&
       typeof (value as Record<string, unknown>).amount === "string" &&
       typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
+      typeof (value as Record<string, unknown>).precision !== "number"
     ) {
       const obj = value as { amount: string; currency: string; precision: number };
killedBy: Money should revive Money objects from JSON
statusReason: expected { amount: '1050', …(2) } to be an instance of Money

[Survived] ConditionalExpression
src/money/Money.ts:524:7
       "precision" in value &&
       typeof (value as Record<string, unknown>).amount === "string" &&
       typeof (value as Record<string, unknown>).currency === "string" &&
-      typeof (value as Record<string, unknown>).precision === "number"
+      true
     ) {
       const obj = value as { amount: string; currency: string; precision: number };

[Killed] BlockStatement
src/money/Money.ts:525:7
       typeof (value as Record<string, unknown>).amount === "string" &&
       typeof (value as Record<string, unknown>).currency === "string" &&
       typeof (value as Record<string, unknown>).precision === "number"
-    ) {
-      const obj = value as { amount: string; currency: string; precision: number };
-      return Money.fromMinor(BigInt(obj.amount), obj.currency);
-    }
+    ) {}
     return value;
   }
killedBy: Money Property-Based Tests Serialization Properties toJSON and reviver should round-trip correctly
statusReason: Property failed after 1 tests
{ seed: -657445857, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/Money.ts:535:22
   /**
    * Returns a string representation of the Money object (formatted).
    */
-  toString(): string {
-    return this.format();
-  }
+  toString(): string {}
 }
 
killedBy: Money should delegate to format for toString
statusReason: expected undefined to be '$10.00' // Object.is equality
