[Killed] BlockStatement
src/money/MoneyBag.ts:17:27
    * Adds a Money amount to the bag.
    * @param money The money to add.
    */
-  add(money: Money): void {
-    const code = money.currency.code;
-    const existing = this.contents.get(code);
-    if (existing) {
-      this.contents.set(code, existing.add(money));
-    } else {
-      this.contents.set(code, money);
-    }
-  }
+  add(money: Money): void {}
 
   /**
killedBy: MoneyBag should add money to bag
statusReason: expected 0n to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:20:9
   add(money: Money): void {
     const code = money.currency.code;
     const existing = this.contents.get(code);
-    if (existing) {
+    if (false) {
       this.contents.set(code, existing.add(money));
     } else {
killedBy: MoneyBag should add twice into existing currency bucket
statusReason: expected 250n to be 350n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:20:9
   add(money: Money): void {
     const code = money.currency.code;
     const existing = this.contents.get(code);
-    if (existing) {
+    if (true) {
       this.contents.set(code, existing.add(money));
     } else {
killedBy: MoneyBag should add money to bag
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
src/money/MoneyBag.ts:22:12
     const existing = this.contents.get(code);
     if (existing) {
       this.contents.set(code, existing.add(money));
-    } else {
-      this.contents.set(code, money);
-    }
+    } else {}
   }
 
killedBy: MoneyBag should add money to bag
statusReason: expected 0n to be 10000n // Object.is equality

[Killed] BlockStatement
src/money/MoneyBag.ts:31:32
    * Subtracts a Money amount from the bag.
    * @param money The money to subtract.
    */
-  subtract(money: Money): void {
-    const code = money.currency.code;
-    const existing = this.contents.get(code);
-    if (existing) {
-      this.contents.set(code, existing.subtract(money));
-    } else {
-      // If not present, we assume 0 - amount
-      const zero = Money.zero(money.currency);
-      this.contents.set(code, zero.subtract(money));
-    }
-  }
+  subtract(money: Money): void {}
 
   /**
killedBy: MoneyBag should subtract from an existing currency bucket
statusReason: expected 1000n to be 675n // Object.is equality

[Killed] BlockStatement
src/money/MoneyBag.ts:34:19
   subtract(money: Money): void {
     const code = money.currency.code;
     const existing = this.contents.get(code);
-    if (existing) {
-      this.contents.set(code, existing.subtract(money));
-    } else {
+    if (existing) {} else {
       // If not present, we assume 0 - amount
       const zero = Money.zero(money.currency);
killedBy: MoneyBag should subtract from an existing currency bucket
statusReason: expected 1000n to be 675n // Object.is equality

[Killed] BlockStatement
src/money/MoneyBag.ts:36:12
     const existing = this.contents.get(code);
     if (existing) {
       this.contents.set(code, existing.subtract(money));
-    } else {
-      // If not present, we assume 0 - amount
-      const zero = Money.zero(money.currency);
-      this.contents.set(code, zero.subtract(money));
-    }
+    } else {}
   }
 
killedBy: MoneyBag should subtract from a missing currency bucket by assuming zero
statusReason: expected 0n to be -200n // Object.is equality

[Killed] BlockStatement
src/money/MoneyBag.ts:48:43
    * @param currency The currency to retrieve.
    * @returns The Money amount in that currency (or zero if not present).
    */
-  get(currency: Currency | string): Money {
-    const code = typeof currency === "string" ? currency : currency.code;
-    return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency
-      )
-    );
-  }
+  get(currency: Currency | string): Money {}
 
   /**
killedBy: Wallet Features should handle MoneyBag (Portfolio)
statusReason: Cannot read properties of undefined (reading 'minor')

[Killed] EqualityOperator
src/money/MoneyBag.ts:49:18
    * @returns The Money amount in that currency (or zero if not present).
    */
   get(currency: Currency | string): Money {
-    const code = typeof currency === "string" ? currency : currency.code;
+    const code = typeof currency !== "string" ? currency : currency.code;
     return (
       this.contents.get(code) ||
killedBy: MoneyBag should add money to bag
statusReason: expected 0n to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:49:18
    * @returns The Money amount in that currency (or zero if not present).
    */
   get(currency: Currency | string): Money {
-    const code = typeof currency === "string" ? currency : currency.code;
+    const code = false ? currency : currency.code;
     return (
       this.contents.get(code) ||
killedBy: Wallet Features should handle MoneyBag (Portfolio)
statusReason: expected 0n to be 1000n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:51:7
   get(currency: Currency | string): Money {
     const code = typeof currency === "string" ? currency : currency.code;
     return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency
-      )
+      false
     );
   }
killedBy: MoneyBag should add money to bag
statusReason: expected undefined to be 10000n // Object.is equality

[Killed] ConditionalExpression
src/money/MoneyBag.ts:51:7
   get(currency: Currency | string): Money {
     const code = typeof currency === "string" ? currency : currency.code;
     return (
-      this.contents.get(code) ||
-      Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency
-      )
+      true
     );
   }
killedBy: MoneyBag should add money to bag
statusReason: expected undefined to be 10000n // Object.is equality

[Killed] EqualityOperator
src/money/MoneyBag.ts:53:9
     return (
       this.contents.get(code) ||
       Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency
+        typeof currency !== "string" ? getCurrency(currency) : currency
       )
     );
killedBy: MoneyBag should return zero for missing currencies
statusReason: Currency '[object Object]' not found in registry.

[Killed] ConditionalExpression
src/money/MoneyBag.ts:53:9
     return (
       this.contents.get(code) ||
       Money.zero(
-        typeof currency === "string" ? getCurrency(currency) : currency
+        true ? getCurrency(currency) : currency
       )
     );
killedBy: MoneyBag should return zero for missing currencies
statusReason: Currency '[object Object]' not found in registry.

[Killed] BlockStatement
src/money/MoneyBag.ts:65:73
    * @param converter The converter instance with exchange rates.
    * @returns The total amount in the target currency.
    */
-  total(targetCurrency: Currency | string, converter: Converter): Money {
-    const target =
-      typeof targetCurrency === "string"
-        ? getCurrency(targetCurrency)
-        : targetCurrency;
-    let total = Money.zero(target);
-
-    for (const money of this.contents.values()) {
-      const converted = converter.convert(money, target);
-      total = total.add(converted);
-    }
-
-    return total;
-  }
+  total(targetCurrency: Currency | string, converter: Converter): Money {}
 
   /**
killedBy: MoneyBag should total across currencies using a converter
statusReason: Cannot read properties of undefined (reading 'currency')

[Killed] EqualityOperator
src/money/MoneyBag.ts:67:7
    */
   total(targetCurrency: Currency | string, converter: Converter): Money {
     const target =
-      typeof targetCurrency === "string"
+      typeof targetCurrency !== "string"
         ? getCurrency(targetCurrency)
         : targetCurrency;
killedBy: MoneyBag should total across currencies using a converter
statusReason: Currency '[object Object]' not found in registry.

[Killed] ConditionalExpression
src/money/MoneyBag.ts:67:7
    */
   total(targetCurrency: Currency | string, converter: Converter): Money {
     const target =
-      typeof targetCurrency === "string"
+      true
         ? getCurrency(targetCurrency)
         : targetCurrency;
killedBy: MoneyBag should total across currencies using a converter
statusReason: Currency '[object Object]' not found in registry.

[Killed] BlockStatement
src/money/MoneyBag.ts:72:49
         : targetCurrency;
     let total = Money.zero(target);
 
-    for (const money of this.contents.values()) {
-      const converted = converter.convert(money, target);
-      total = total.add(converted);
-    }
+    for (const money of this.contents.values()) {}
 
     return total;
killedBy: MoneyBag should total across currencies using a converter
statusReason: expected 0n to be 200n // Object.is equality

[Killed] BlockStatement
src/money/MoneyBag.ts:83:21
   /**
    * Returns a list of all Money objects in the bag.
    */
-  getAll(): Money[] {
-    return Array.from(this.contents.values());
-  }
+  getAll(): Money[] {}
 
   /**
killedBy: MoneyBag should list all contents and serialize to JSON
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/money/MoneyBag.ts:90:71
   /**
    * Returns a JSON representation of the bag.
    */
-  toJSON(): { amount: string; currency: string; precision: number }[] {
-    return this.getAll().map((m) => m.toJSON());
-  }
+  toJSON(): { amount: string; currency: string; precision: number }[] {}
 }
 
killedBy: MoneyBag should list all contents and serialize to JSON
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/money/MoneyBag.ts:91:30
    * Returns a JSON representation of the bag.
    */
   toJSON(): { amount: string; currency: string; precision: number }[] {
-    return this.getAll().map((m) => m.toJSON());
+    return this.getAll().map(() => undefined);
   }
 }
killedBy: MoneyBag should list all contents and serialize to JSON
statusReason: Cannot read properties of undefined (reading 'currency')
