[Killed] BlockStatement
src/money/arithmetic.ts:7:51
 /**
  * Adds two BigInt values.
  */
-export function add(a: bigint, b: bigint): bigint {
-  return a + b;
-}
+export function add(a: bigint, b: bigint): bigint {}
 
 /**
killedBy: MoneyBag should add twice into existing currency bucket
statusReason: expected undefined to be 350n // Object.is equality

[Killed] ArithmeticOperator
src/money/arithmetic.ts:8:10
  * Adds two BigInt values.
  */
 export function add(a: bigint, b: bigint): bigint {
-  return a + b;
+  return a - b;
 }
 
killedBy: Money should add correctly
statusReason: expected 450n to be 1550n // Object.is equality

[Killed] BlockStatement
src/money/arithmetic.ts:14:56
 /**
  * Subtracts two BigInt values.
  */
-export function subtract(a: bigint, b: bigint): bigint {
-  return a - b;
-}
+export function subtract(a: bigint, b: bigint): bigint {}
 
 /**
killedBy: Wallet Features should support smart arithmetic
statusReason: expected undefined to be 800n // Object.is equality

[Killed] ArithmeticOperator
src/money/arithmetic.ts:15:10
  * Subtracts two BigInt values.
  */
 export function subtract(a: bigint, b: bigint): bigint {
-  return a - b;
+  return a + b;
 }
 
killedBy: Money Property-Based Tests Subtraction Properties should satisfy: a - b = a + (-b)
statusReason: Property failed after 1 tests
{ seed: 523234779, path: "0:0:1:0:0:0", endOnFailure: true }
Counterexample: [0,-1]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/money/arithmetic.ts:34:11
   amount: bigint,
   multiplier: string | number,
   rounding?: RoundingMode
-): bigint {
-  const { numerator, denominator } = parseMultiplier(multiplier);
-
-  // result = amount * (numerator / denominator)
-  // result = (amount * numerator) / denominator
-
-  const product = amount * numerator;
-
-  if (product % denominator === 0n) {
-    return product / denominator;
-  }
-
-  if (!rounding) {
-    throw new RoundingRequiredError(
-      "multiply",
-      Number(product) / Number(denominator)
-    );
-  }
-
-  return divideWithRounding(product, denominator, rounding);
-}
+): bigint {}
 
 /**
killedBy: Money Property-Based Tests Multiplication Properties should have identity element: a * 1 = a
statusReason: Property failed after 1 tests
{ seed: 853056883, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/money/arithmetic.ts:40:19
   // result = amount * (numerator / denominator)
   // result = (amount * numerator) / denominator
 
-  const product = amount * numerator;
+  const product = amount / numerator;
 
   if (product % denominator === 0n) {
killedBy: MoneyBag should total across currencies using a converter
statusReason: expected 104n to be 200n // Object.is equality

[Killed] ArithmeticOperator
src/money/arithmetic.ts:42:7
 
   const product = amount * numerator;
 
-  if (product % denominator === 0n) {
+  if (product * denominator === 0n) {
     return product / denominator;
   }
killedBy: Money Property-Based Tests Multiplication Properties should have identity element: a * 1 = a
statusReason: Property failed after 1 tests
{ seed: -595090139, path: "0:1:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/money/arithmetic.ts:42:7
 
   const product = amount * numerator;
 
-  if (product % denominator === 0n) {
+  if (false) {
     return product / denominator;
   }
killedBy: Money should multiply with rounding
statusReason: Rounding required for multiply: result 1500 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] ArithmeticOperator
src/money/arithmetic.ts:43:12
   const product = amount * numerator;
 
   if (product % denominator === 0n) {
-    return product / denominator;
+    return product * denominator;
   }
 
killedBy: Financial - Loan Interest-Only Loans should calculate monthly interest-only payment
statusReason: expected '$500,000,000.00' to be '$500.00' // Object.is equality

[Killed] ConditionalExpression
src/money/arithmetic.ts:46:7
     return product / denominator;
   }
 
-  if (!rounding) {
+  if (true) {
     throw new RoundingRequiredError(
       "multiply",
killedBy: Financial - Compound Interest should calculate future value
statusReason: Rounding required for multiply: result 162889.4626777442 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] BooleanLiteral
src/money/arithmetic.ts:46:7
     return product / denominator;
   }
 
-  if (!rounding) {
+  if (rounding) {
     throw new RoundingRequiredError(
       "multiply",
killedBy: Financial - Compound Interest should calculate future value
statusReason: Rounding required for multiply: result 162889.4626777442 is not an integer.
💡 Tip: Provide a rounding mode:
   money.multiply(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Survived] StringLiteral
src/money/arithmetic.ts:48:7
 
   if (!rounding) {
     throw new RoundingRequiredError(
-      "multiply",
+      "",
       Number(product) / Number(denominator)
     );

[Survived] ArithmeticOperator
src/money/arithmetic.ts:49:7
   if (!rounding) {
     throw new RoundingRequiredError(
       "multiply",
-      Number(product) / Number(denominator)
+      Number(product) * Number(denominator)
     );
   }

[Killed] BlockStatement
src/money/arithmetic.ts:69:11
   amount: bigint,
   divisor: string | number,
   rounding?: RoundingMode
-): bigint {
-  const { numerator, denominator } = parseMultiplier(divisor);
-
-  // result = amount / (numerator / denominator)
-  // result = (amount * denominator) / numerator
-
-  const product = amount * denominator;
-
-  if (product % numerator === 0n) {
-    return product / numerator;
-  }
-
-  if (!rounding) {
-    throw new RoundingRequiredError("divide", Number(product) / Number(numerator));
-  }
-
-  return divideWithRounding(product, numerator, rounding);
-}
+): bigint {}
 
 function parseMultiplier(multiplier: string | number): {
killedBy: Financial - Compound Interest should calculate present value
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/money/arithmetic.ts:75:19
   // result = amount / (numerator / denominator)
   // result = (amount * denominator) / numerator
 
-  const product = amount * denominator;
+  const product = amount / denominator;
 
   if (product % numerator === 0n) {
killedBy: Financial - Compound Interest should calculate present value
statusReason: expected '$0.00' to be '$1,000.00' // Object.is equality

[Killed] ConditionalExpression
src/money/arithmetic.ts:77:7
 
   const product = amount * denominator;
 
-  if (product % numerator === 0n) {
+  if (false) {
     return product / numerator;
   }
killedBy: Money Utilities divide should divide correctly
statusReason: Rounding required for divide: result 500 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] ArithmeticOperator
src/money/arithmetic.ts:77:7
 
   const product = amount * denominator;
 
-  if (product % numerator === 0n) {
+  if (product * numerator === 0n) {
     return product / numerator;
   }
killedBy: Money Utilities divide should divide correctly
statusReason: Rounding required for divide: result 500 is not an integer.
💡 Tip: Provide a rounding mode:
   money.divide(value, { rounding: RoundingMode.HALF_UP })
   Available modes: HALF_UP, HALF_DOWN, HALF_EVEN, FLOOR, CEIL, TRUNCATE

[Killed] ArithmeticOperator
src/money/arithmetic.ts:78:12
   const product = amount * denominator;
 
   if (product % numerator === 0n) {
-    return product / numerator;
+    return product * numerator;
   }
 
killedBy: Financial - Depreciation should calculate straight-line depreciation correctly
statusReason: expected '$5,000.00' to be '$200.00' // Object.is equality

[Survived] ArithmeticOperator
src/money/arithmetic.ts:82:47
   }
 
   if (!rounding) {
-    throw new RoundingRequiredError("divide", Number(product) / Number(numerator));
+    throw new RoundingRequiredError("divide", Number(product) * Number(numerator));
   }
 

[Survived] StringLiteral
src/money/arithmetic.ts:82:37
   }
 
   if (!rounding) {
-    throw new RoundingRequiredError("divide", Number(product) / Number(numerator));
+    throw new RoundingRequiredError("", Number(product) / Number(numerator));
   }
 

[Killed] BlockStatement
src/money/arithmetic.ts:91:3
 function parseMultiplier(multiplier: string | number): {
   numerator: bigint;
   denominator: bigint;
-} {
-  const s = multiplier.toString();
-
-  // Check for scientific notation
-  if (/[eE]/.test(s)) {
-    throw new Error("Scientific notation not supported");
-  }
-
-  const parts = s.split(".");
-  if (parts.length > 2) {
-    throw new Error("Invalid number format");
-  }
-
-  const integerPart = parts[0];
-  const fractionalPart = parts[1] || "";
-
-  const denominator = 10n ** BigInt(fractionalPart.length);
-  const numerator = BigInt(integerPart + fractionalPart);
-
-  return { numerator, denominator };
-}
+} {}
 
killedBy: Financial - Simple Interest simpleInterest should calculate simple interest with known values
statusReason: Cannot destructure property 'numerator' of 'parseMultiplier(...)' as it is undefined.

[Killed] ConditionalExpression
src/money/arithmetic.ts:95:7
   const s = multiplier.toString();
 
   // Check for scientific notation
-  if (/[eE]/.test(s)) {
+  if (true) {
     throw new Error("Scientific notation not supported");
   }
killedBy: Money Utilities divide should divide correctly
statusReason: Scientific notation not supported

[Killed] BlockStatement
src/money/arithmetic.ts:95:23
   const s = multiplier.toString();
 
   // Check for scientific notation
-  if (/[eE]/.test(s)) {
-    throw new Error("Scientific notation not supported");
-  }
+  if (/[eE]/.test(s)) {}
 
   const parts = s.split(".");
killedBy: Money should throw error for scientific notation multiplier
statusReason: expected [Function] to throw error including 'Scientific notation not supported' but got 'Cannot convert 1e10 to a BigInt'

[Killed] EqualityOperator
src/money/arithmetic.ts:100:7
   }
 
   const parts = s.split(".");
-  if (parts.length > 2) {
+  if (parts.length <= 2) {
     throw new Error("Invalid number format");
   }
killedBy: Money should multiply with rounding
statusReason: Invalid number format

[Killed] ConditionalExpression
src/money/arithmetic.ts:100:7
   }
 
   const parts = s.split(".");
-  if (parts.length > 2) {
+  if (true) {
     throw new Error("Invalid number format");
   }
killedBy: Money Property-Based Tests Multiplication Properties should have identity element: a * 1 = a
statusReason: Property failed after 1 tests
{ seed: -1272117802, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/money/arithmetic.ts:101:21
 
   const parts = s.split(".");
   if (parts.length > 2) {
-    throw new Error("Invalid number format");
+    throw new Error("");
   }
 
killedBy: Money should throw error for invalid number format in multiplier
statusReason: expected [Function] to throw error including 'Invalid number format' but got ''

[Killed] ConditionalExpression
src/money/arithmetic.ts:105:26
   }
 
   const integerPart = parts[0];
-  const fractionalPart = parts[1] || "";
+  const fractionalPart = true;
 
   const denominator = 10n ** BigInt(fractionalPart.length);
killedBy: MoneyBag should total across currencies using a converter
statusReason: Cannot convert undefined to a BigInt

[Killed] ArithmeticOperator
src/money/arithmetic.ts:108:28
   const fractionalPart = parts[1] || "";
 
   const denominator = 10n ** BigInt(fractionalPart.length);
-  const numerator = BigInt(integerPart + fractionalPart);
+  const numerator = BigInt(integerPart - fractionalPart);
 
   return { numerator, denominator };
killedBy: Money should multiply with rounding
statusReason: expected -400n to be 1500n // Object.is equality

[Killed] ObjectLiteral
src/money/arithmetic.ts:110:10
   const denominator = 10n ** BigInt(fractionalPart.length);
   const numerator = BigInt(integerPart + fractionalPart);
 
-  return { numerator, denominator };
+  return {};
 }
 
killedBy: Money should multiply with rounding
statusReason: Cannot mix BigInt and other types, use explicit conversions
