[Killed] BlockStatement
src/money/guards.ts:4:62
 import { Money } from "./Money";
 import { CurrencyMismatchError, InsufficientFundsError } from "../errors";
 
-export function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency.code !== b.currency.code) {
-    throw new CurrencyMismatchError(a.currency.code, b.currency.code);
-  }
-}
+export function assertSameCurrency(a: Money, b: Money): void {}
 
 export function assertNonNegative(money: Money): void {
killedBy: Financial - Leverage Ratios should throw error on currency mismatch
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/money/guards.ts:5:7
 import { CurrencyMismatchError, InsufficientFundsError } from "../errors";
 
 export function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency.code !== b.currency.code) {
+  if (a.currency.code === b.currency.code) {
     throw new CurrencyMismatchError(a.currency.code, b.currency.code);
   }
killedBy: Money should add correctly
statusReason: Currency mismatch: expected USD, received USD.
💡 Tip: Use a Converter to convert between currencies:
   const converter = new Converter('USD', { USD: rate });
   const converted = converter.convert(money, 'USD');

[Killed] ConditionalExpression
src/money/guards.ts:5:7
 import { CurrencyMismatchError, InsufficientFundsError } from "../errors";
 
 export function assertSameCurrency(a: Money, b: Money): void {
-  if (a.currency.code !== b.currency.code) {
+  if (false) {
     throw new CurrencyMismatchError(a.currency.code, b.currency.code);
   }
killedBy: Money should throw on currency mismatch
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/money/guards.ts:10:55
   }
 }
 
-export function assertNonNegative(money: Money): void {
-  if (money.isNegative()) {
-    // Spec doesn't explicitly name a NegativeError, but InsufficientFundsError might fit or just a generic error.
-    // Spec lists "InsufficientFundsError" in 4.7.
-    // But "assertNonNegative" is a guard.
-    // Let's throw an Error or a specific one if defined.
-    // "Any violation is considered a bug" -> maybe just Error?
-    // But for "InsufficientFunds", that's usually when subtracting.
-    // Let's use a generic Error for now or create a specific one if needed.
-    throw new Error("Money value must be non-negative");
-  }
-}
+export function assertNonNegative(money: Money): void {}
 
killedBy: Guards assertNonNegative should throw Error for negative values
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/money/guards.ts:11:7
 }
 
 export function assertNonNegative(money: Money): void {
-  if (money.isNegative()) {
+  if (true) {
     // Spec doesn't explicitly name a NegativeError, but InsufficientFundsError might fit or just a generic error.
     // Spec lists "InsufficientFundsError" in 4.7.
killedBy: Guards assertNonNegative should not throw for positive values
statusReason: expected [Function] to not throw an error but 'Error: Money value must be non-negati…' was thrown

[Killed] ConditionalExpression
src/money/guards.ts:11:7
 }
 
 export function assertNonNegative(money: Money): void {
-  if (money.isNegative()) {
+  if (false) {
     // Spec doesn't explicitly name a NegativeError, but InsufficientFundsError might fit or just a generic error.
     // Spec lists "InsufficientFundsError" in 4.7.
killedBy: Guards assertNonNegative should throw Error for negative values
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/money/guards.ts:19:21
     // "Any violation is considered a bug" -> maybe just Error?
     // But for "InsufficientFunds", that's usually when subtracting.
     // Let's use a generic Error for now or create a specific one if needed.
-    throw new Error("Money value must be non-negative");
+    throw new Error("");
   }
 }
killedBy: Guards assertNonNegative should throw Error for negative values
statusReason: expected [Function] to throw error including 'Money value must be non-negative' but got ''
