[Killed] EqualityOperator
src/rounding/index.ts:10:7
   denominator: bigint,
   mode: RoundingMode
 ): bigint {
-  if (denominator === 0n) {
+  if (denominator !== 0n) {
     throw new Error("Division by zero");
   }
killedBy: Money Utilities divide should handle rounding
statusReason: Division by zero

[Killed] BlockStatement
src/rounding/index.ts:10:27
   denominator: bigint,
   mode: RoundingMode
 ): bigint {
-  if (denominator === 0n) {
-    throw new Error("Division by zero");
-  }
+  if (denominator === 0n) {}
 
   const quotient = numerator / denominator;
killedBy: Rounding Edge Cases Division by Zero should throw error when dividing by zero
statusReason: expected 'RangeError' to be 'Error' // Object.is equality

[Killed] StringLiteral
src/rounding/index.ts:11:21
   mode: RoundingMode
 ): bigint {
   if (denominator === 0n) {
-    throw new Error("Division by zero");
+    throw new Error("");
   }
 
killedBy: Rounding Edge Cases Division by Zero should throw error when dividing by zero
statusReason: expected '' to be 'Division by zero' // Object.is equality

[Killed] EqualityOperator
src/rounding/index.ts:17:7
   const quotient = numerator / denominator;
   const remainder = numerator % denominator;
 
-  if (remainder === 0n) {
+  if (remainder !== 0n) {
     return quotient;
   }
killedBy: Money should multiply with rounding
statusReason: expected 55n to be 56n // Object.is equality

[Killed] BlockStatement
src/rounding/index.ts:17:25
   const quotient = numerator / denominator;
   const remainder = numerator % denominator;
 
-  if (remainder === 0n) {
-    return quotient;
-  }
+  if (remainder === 0n) {}
 
   const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
killedBy: Rounding Edge Cases Exact Division (remainder === 0) should return the exact quotient for CEIL when evenly divisible
statusReason: expected 6n to be 5n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:21:28
     return quotient;
   }
 
-  const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
+  const isNegativeResult = true;
   const isPositiveResult = !isNegativeResult;
 
killedBy: Money should multiply with rounding
statusReason: expected 54n to be 56n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:21:50
     return quotient;
   }
 
-  const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
+  const isNegativeResult = (numerator < 0n) !== (false);
   const isPositiveResult = !isNegativeResult;
 
killedBy: Rounding Edge Cases Negative Numbers should handle negative denominator
statusReason: expected -3n to be -4n // Object.is equality

[Killed] BooleanLiteral
src/rounding/index.ts:22:28
   }
 
   const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
-  const isPositiveResult = !isNegativeResult;
+  const isPositiveResult = isNegativeResult;
 
   const absRemainder = remainder < 0n ? -remainder : remainder;
killedBy: Money should multiply with rounding
statusReason: expected 54n to be 56n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:24:24
   const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
   const isPositiveResult = !isNegativeResult;
 
-  const absRemainder = remainder < 0n ? -remainder : remainder;
+  const absRemainder = true ? -remainder : remainder;
   const absDenominator = denominator < 0n ? -denominator : denominator;
 
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 2n to be 3n // Object.is equality

[Killed] UnaryOperator
src/rounding/index.ts:24:41
   const isNegativeResult = (numerator < 0n) !== (denominator < 0n);
   const isPositiveResult = !isNegativeResult;
 
-  const absRemainder = remainder < 0n ? -remainder : remainder;
+  const absRemainder = remainder < 0n ? +remainder : remainder;
   const absDenominator = denominator < 0n ? -denominator : denominator;
 
killedBy: Money Property-Based Tests Rounding Consistency division with rounding should produce integer minor units
statusReason: Property failed after 1 tests
{ seed: 1792455738, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:2:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [-1,2]
Shrunk 39 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rounding/index.ts:25:26
   const isPositiveResult = !isNegativeResult;
 
   const absRemainder = remainder < 0n ? -remainder : remainder;
-  const absDenominator = denominator < 0n ? -denominator : denominator;
+  const absDenominator = true ? -denominator : denominator;
 
   // Check for exact half
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_DOWN: 2.5 -> 2
statusReason: expected 3n to be 2n // Object.is equality

[Killed] EqualityOperator
src/rounding/index.ts:25:26
   const isPositiveResult = !isNegativeResult;
 
   const absRemainder = remainder < 0n ? -remainder : remainder;
-  const absDenominator = denominator < 0n ? -denominator : denominator;
+  const absDenominator = denominator >= 0n ? -denominator : denominator;
 
   // Check for exact half
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_DOWN: 2.5 -> 2
statusReason: expected 3n to be 2n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:28:18
   const absDenominator = denominator < 0n ? -denominator : denominator;
 
   // Check for exact half
-  const isHalf = absRemainder * 2n === absDenominator;
+  const isHalf = false;
   const isMoreThanHalf = absRemainder * 2n > absDenominator;
 
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 2n to be 3n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:28:18
   const absDenominator = denominator < 0n ? -denominator : denominator;
 
   // Check for exact half
-  const isHalf = absRemainder * 2n === absDenominator;
+  const isHalf = true;
   const isMoreThanHalf = absRemainder * 2n > absDenominator;
 
killedBy: Financial - Depreciation should handle rounding correctly
statusReason: expected '$33.34' to be '$33.33' // Object.is equality

[Killed] EqualityOperator
src/rounding/index.ts:29:26
 
   // Check for exact half
   const isHalf = absRemainder * 2n === absDenominator;
-  const isMoreThanHalf = absRemainder * 2n > absDenominator;
+  const isMoreThanHalf = absRemainder * 2n <= absDenominator;
 
   switch (mode) {
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_DOWN: 2.5 -> 2
statusReason: expected 3n to be 2n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:29:26
 
   // Check for exact half
   const isHalf = absRemainder * 2n === absDenominator;
-  const isMoreThanHalf = absRemainder * 2n > absDenominator;
+  const isMoreThanHalf = false;
 
   switch (mode) {
killedBy: Rounding Edge Cases HALF_DOWN more-than-half should round away from zero when fraction is greater than half
statusReason: expected 1n to be 2n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:32:5
   const isMoreThanHalf = absRemainder * 2n > absDenominator;
 
   switch (mode) {
-    case RoundingMode.FLOOR:
-      // If positive, quotient is already floor (truncation).
-      // If negative, quotient is ceil (truncation towards zero), so we need to subtract 1.
-      return isPositiveResult ? quotient : quotient - 1n;
+    case RoundingMode.FLOOR:
     case RoundingMode.CEIL:
       // If positive, quotient is floor, so add 1.
killedBy: Rounding Edge Cases Negative Numbers should handle negative result rounding correctly
statusReason: expected -3n to be -4n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:35:44
     case RoundingMode.FLOOR:
       // If positive, quotient is already floor (truncation).
       // If negative, quotient is ceil (truncation towards zero), so we need to subtract 1.
-      return isPositiveResult ? quotient : quotient - 1n;
+      return isPositiveResult ? quotient : quotient + 1n;
     case RoundingMode.CEIL:
       // If positive, quotient is floor, so add 1.
killedBy: Rounding Edge Cases Negative Numbers should handle negative result rounding correctly
statusReason: expected -2n to be -4n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:36:5
       // If positive, quotient is already floor (truncation).
       // If negative, quotient is ceil (truncation towards zero), so we need to subtract 1.
       return isPositiveResult ? quotient : quotient - 1n;
-    case RoundingMode.CEIL:
-      // If positive, quotient is floor, so add 1.
-      // If negative, quotient is ceil, so keep it.
-      return isPositiveResult ? quotient + 1n : quotient;
+    case RoundingMode.CEIL:
     case RoundingMode.HALF_UP:
       if (isMoreThanHalf || isHalf) {
killedBy: Financial - Depreciation should clamp book value to salvage value when rounding causes overshoot
statusReason: expected '$3.33' to be '$3.34' // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:39:33
     case RoundingMode.CEIL:
       // If positive, quotient is floor, so add 1.
       // If negative, quotient is ceil, so keep it.
-      return isPositiveResult ? quotient + 1n : quotient;
+      return isPositiveResult ? quotient - 1n : quotient;
     case RoundingMode.HALF_UP:
       if (isMoreThanHalf || isHalf) {
killedBy: Money Property-Based Tests Rounding Consistency different rounding modes should produce consistent results
statusReason: Property failed after 6 tests
{ seed: 1958601010, path: "5:1:0:0:0:0:1", endOnFailure: true }
Counterexample: [1,2]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/rounding/index.ts:40:5
       // If positive, quotient is floor, so add 1.
       // If negative, quotient is ceil, so keep it.
       return isPositiveResult ? quotient + 1n : quotient;
-    case RoundingMode.HALF_UP:
-      if (isMoreThanHalf || isHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
-      }
-      return quotient;
+    case RoundingMode.HALF_UP:
     case RoundingMode.HALF_DOWN:
       if (isMoreThanHalf) {
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 2n to be 3n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:41:11
       // If negative, quotient is ceil, so keep it.
       return isPositiveResult ? quotient + 1n : quotient;
     case RoundingMode.HALF_UP:
-      if (isMoreThanHalf || isHalf) {
+      if (false) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 2n to be 3n // Object.is equality

[Killed] BlockStatement
src/rounding/index.ts:41:37
       // If negative, quotient is ceil, so keep it.
       return isPositiveResult ? quotient + 1n : quotient;
     case RoundingMode.HALF_UP:
-      if (isMoreThanHalf || isHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
-      }
+      if (isMoreThanHalf || isHalf) {}
       return quotient;
     case RoundingMode.HALF_DOWN:
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 2n to be 3n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:42:35
       return isPositiveResult ? quotient + 1n : quotient;
     case RoundingMode.HALF_UP:
       if (isMoreThanHalf || isHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
+        return isPositiveResult ? quotient - 1n : quotient - 1n;
       }
       return quotient;
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_UP: 2.5 -> 3
statusReason: expected 1n to be 3n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:42:51
       return isPositiveResult ? quotient + 1n : quotient;
     case RoundingMode.HALF_UP:
       if (isMoreThanHalf || isHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
+        return isPositiveResult ? quotient + 1n : quotient + 1n;
       }
       return quotient;
killedBy: Rounding Comprehensive Logic HALF_UP (Commercial Rounding) should handle exact halves correctly
statusReason: expected -1n to be -3n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:45:5
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
       return quotient;
-    case RoundingMode.HALF_DOWN:
-      if (isMoreThanHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
-      }
-      return quotient;
+    case RoundingMode.HALF_DOWN:
     case RoundingMode.HALF_EVEN:
       if (isMoreThanHalf) {
killedBy: Rounding Edge Cases Modes that differ on odd halves should distinguish HALF_DOWN from HALF_EVEN on 3.5
statusReason: expected 4n to be 3n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:46:11
       }
       return quotient;
     case RoundingMode.HALF_DOWN:
-      if (isMoreThanHalf) {
+      if (true) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_DOWN: 2.5 -> 2
statusReason: expected 3n to be 2n // Object.is equality

[Killed] BlockStatement
src/rounding/index.ts:46:27
       }
       return quotient;
     case RoundingMode.HALF_DOWN:
-      if (isMoreThanHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
-      }
+      if (isMoreThanHalf) {}
       return quotient;
     case RoundingMode.HALF_EVEN:
killedBy: Rounding Edge Cases HALF_DOWN more-than-half should round away from zero when fraction is greater than half
statusReason: expected 1n to be 2n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:47:51
       return quotient;
     case RoundingMode.HALF_DOWN:
       if (isMoreThanHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
+        return isPositiveResult ? quotient + 1n : quotient + 1n;
       }
       return quotient;
killedBy: Rounding Edge Cases HALF_DOWN more-than-half should round away from zero when fraction is greater than half
statusReason: expected 0n to be -2n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:47:35
       return quotient;
     case RoundingMode.HALF_DOWN:
       if (isMoreThanHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
+        return isPositiveResult ? quotient - 1n : quotient - 1n;
       }
       return quotient;
killedBy: Rounding Edge Cases HALF_DOWN more-than-half should round away from zero when fraction is greater than half
statusReason: expected 0n to be 2n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:50:5
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
       return quotient;
-    case RoundingMode.HALF_EVEN:
-      if (isMoreThanHalf) {
-        return isPositiveResult ? quotient + 1n : quotient - 1n;
-      }
-      if (isHalf) {
-        // If quotient is odd, round up (away from zero? no, to nearest even).
-        // If quotient is even, keep it.
-        if (quotient % 2n !== 0n) {
-          return isPositiveResult ? quotient + 1n : quotient - 1n;
-        }
-      }
-      return quotient;
+    case RoundingMode.HALF_EVEN:
     case RoundingMode.TRUNCATE:
       // Truncate towards zero (simply return the quotient without adjustment)
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: 3.5 -> 4 (nearest even)
statusReason: expected 3n to be 4n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:51:11
       }
       return quotient;
     case RoundingMode.HALF_EVEN:
-      if (isMoreThanHalf) {
+      if (true) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: 2.5 -> 2 (nearest even)
statusReason: expected 3n to be 2n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:51:11
       }
       return quotient;
     case RoundingMode.HALF_EVEN:
-      if (isMoreThanHalf) {
+      if (false) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
killedBy: Financial - Loan Interest-Only Loans should handle commercial real estate example
statusReason: expected '$22,916.66' to be '$22,916.67' // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:54:11
       if (isMoreThanHalf) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
-      if (isHalf) {
+      if (true) {
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
killedBy: Financial - Compound Interest should calculate future value
statusReason: expected '$1,628.90' to be '$1,628.89' // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:54:11
       if (isMoreThanHalf) {
         return isPositiveResult ? quotient + 1n : quotient - 1n;
       }
-      if (isHalf) {
+      if (false) {
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: 3.5 -> 4 (nearest even)
statusReason: expected 3n to be 4n // Object.is equality

[Killed] EqualityOperator
src/rounding/index.ts:57:13
       if (isHalf) {
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
-        if (quotient % 2n !== 0n) {
+        if (quotient % 2n === 0n) {
           return isPositiveResult ? quotient + 1n : quotient - 1n;
         }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: 2.5 -> 2 (nearest even)
statusReason: expected 3n to be 2n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:57:13
       if (isHalf) {
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
-        if (quotient % 2n !== 0n) {
+        if (quotient * 2n !== 0n) {
           return isPositiveResult ? quotient + 1n : quotient - 1n;
         }
killedBy: Rounding Comprehensive Logic HALF_EVEN (Bankers Rounding) should handle exact halves correctly
statusReason: expected 3n to be 2n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:58:37
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
         if (quotient % 2n !== 0n) {
-          return isPositiveResult ? quotient + 1n : quotient - 1n;
+          return isPositiveResult ? quotient - 1n : quotient - 1n;
         }
       }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: 3.5 -> 4 (nearest even)
statusReason: expected 2n to be 4n // Object.is equality

[Killed] ArithmeticOperator
src/rounding/index.ts:58:53
         // If quotient is odd, round up (away from zero? no, to nearest even).
         // If quotient is even, keep it.
         if (quotient % 2n !== 0n) {
-          return isPositiveResult ? quotient + 1n : quotient - 1n;
+          return isPositiveResult ? quotient + 1n : quotient + 1n;
         }
       }
killedBy: Rounding Edge Cases Exact Half Cases (2.5, -2.5) HALF_EVEN: -3.5 -> -4
statusReason: expected -2n to be -4n // Object.is equality

[Killed] ConditionalExpression
src/rounding/index.ts:62:5
         }
       }
       return quotient;
-    case RoundingMode.TRUNCATE:
-      // Truncate towards zero (simply return the quotient without adjustment)
-      return quotient;
+    case RoundingMode.TRUNCATE:
     default:
       throw new Error(`Unsupported rounding mode: ${mode}`);
killedBy: Rounding Edge Cases Negative Numbers should handle negative result rounding correctly
statusReason: Unsupported rounding mode: TRUNCATE

[Killed] ConditionalExpression
src/rounding/index.ts:65:5
     case RoundingMode.TRUNCATE:
       // Truncate towards zero (simply return the quotient without adjustment)
       return quotient;
-    default:
-      throw new Error(`Unsupported rounding mode: ${mode}`);
+    default:
   }
 }
killedBy: Rounding Edge Cases Unsupported rounding mode should throw a helpful error for unsupported mode
statusReason: expected [Function] to throw an error
